AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>WLLIM</name>
          <description>Window Comparator Lower Limits</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>LLIM</name>
              <description>Sets the lower limit for the window comparator.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCWLIM</name>
          <description>Scale Window Comparator Limits</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SCWLIMEN</name>
              <description>Scale the window limits compare values per precision mode. When set to 0x0 (default), the values in the 20-bit limits registers will compare directly with the FIFO values regardless of the precision mode the slot is configured to. When set to 0x1, the compare values will be divided by the difference in precision bits while performing the window limit comparisons.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>The ADC FIFO Register contains the slot number and fifo data for the oldest conversion data in the FIFO. The COUNT field indicates the total number of valid entries in the FIFO. A write to this register will pop one of the FIFO entries off the FIFO and decrease the COUNT by 1 if the COUNT is greater than zero.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD</name>
              <description>RESERVED.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SLOTNUM</name>
              <description>Slot number associated with this FIFO data.</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COUNT</name>
              <description>Number of valid entries in the ADC FIFO.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA</name>
              <description>Oldest data in the FIFO.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPR</name>
          <description>This is a Pop Read mirrored copy of the ADCFIFO register with the only difference being that reading this register will result in a simultaneous FIFO POP which is also achieved by writing to the ADCFIFO Register. Note: The DFIFORDEN bit must be set in the CFG register for the the destructive read to be enabled.</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RSVDPR</name>
              <description>RESERVED.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SLOTNUMPR</name>
              <description>Slot number associated with this FIFO data.</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COUNT</name>
              <description>Number of valid entries in the ADC FIFO.</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DATA</name>
              <description>Oldest data in the FIFO.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTTRIGTIMER</name>
          <description>ADC-Internal Repeating Trigger Timer Configuration</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800703FF</resetMask>

          <fields>
            <field>
              <name>TIMEREN</name>
              <description>ADC-internal trigger timer enable.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the ADC-internal trigger timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the ADC-internal trigger timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Configure number of divide-by-2 of clock source as input to trigger counter. (Max value of 5.)  A value of 0 in this register would not divide down the ADC input clock. A value of 1 would divide the ADC input clock frequency by 2. A value of 5 would divide the ADC input clock frequency by 2^5 = 32. To update this value, first disable the INTTRIGTIMER by setting TIMEREN to DIS, change CLKDIV, and then reenable it INTTRIGTIMER by setting TIMEREN to EN again.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

