AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PRMODE3</name>
              <description>Set the Precision Mode For Slot 3.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P12B0</name>
                  <description>12-bit precision mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12B1</name>
                  <description>12-bit precision mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10B</name>
                  <description>10-bit precision mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8B</name>
                  <description>8-bit precision mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL3</name>
              <description>Select one of the 14 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>PGA channel A0 output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE1</name>
                  <description>PGA channel A1 output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE2</name>
                  <description>PGA channel B0 output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE3</name>
                  <description>PGA channel B1 output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN3</name>
              <description>This bit enables the window compare function for slot 3.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 3.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCDIS</name>
                  <description>Disable the window compare for slot 3.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN3</name>
              <description>This bit enables slot 3 for AUDADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 3 for AUDADC conversions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLDIS</name>
                  <description>Disable slot 3 for AUDADC conversions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SL4CFG</name>
          <description>Slot 4 Configuration</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF0F03</resetMask>

          <fields>
            <field>
              <name>ADSEL4</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRKCYC4</name>
              <description>Set additional input signal sampling/tracking time to the specified number of AUDADC clock cycles. (Note that a value of 0 in this register specifies the minimum required 5 cycles. A maximum of 64 specifies 69 cycles.)</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>

