AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO</name>
          <description>The AUDADC FIFO Register contains up to 2 samples for a single channel (high and low gain PGA samples), each sample up to 12-bits.  It also contains meta data in the form of which audio channel the sample(s) are from along with the PGA gain code for that sample pair.  When no data is present, FIFO entry reads back as all 1s (0xFFFFFFFF).</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HGDATA</name>
              <description>High-gain PGA sample data</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MIC</name>
              <description>Which audio channel this data is from encoded as int(slot number/2).  In other words, this is 1 if data is from slots 2 or 3, or 0 if from slots 0 or 1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>METAHI</name>
              <description>Meta data about this sample which represents the upper 3 bits of the PGA gain code</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LGDATA</name>
              <description>Low-gain PGA sample data</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>METALO</name>
              <description>Meta data about this sample which represents the lower 4 bits of the PGA gain code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOPR</name>
          <description>This is a pop-on-read mirrored copy of the ADCFIFO register with the only difference being that reading this register will result in a simultaneous FIFO POP which is also achieved by writing to the ADCFIFO Register. Note: The DFIFORDEN bit must be set in the CFG register for the the destructive read to be enabled.</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HGDATAPR</name>
              <description>High-gain PGA sample data</description>
              <bitRange>[31:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MICPR</name>
              <description>Which audio channel this data is from encoded as int(slot number/2).  In other words, this is 1 if data is from slots 2 or 3, or 0 if from slots 0 or 1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>METAHIPR</name>
              <description>Meta data about this sample which represents the upper 3 bits of the PGA gain code</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LGDATAPR</name>
              <description>Low-gain PGA sample data</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>METALOPR</name>
              <description>Meta data about this sample which represents the lower 4 bits of the PGA gain code</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTTRIGTIMER</name>
          <description>AUDADC-Internal Repeating Trigger Timer Configuration</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800703FF</resetMask>

          <fields>
            <field>
              <name>TIMEREN</name>
              <description>AUDADC-internal trigger timer enable.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the AUDADC-internal trigger timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the AUDADC-internal trigger timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>Configure number of divide-by-2 of clock source as input to trigger counter. (Max value of 5.)  A value of 0 in this register would not divide down the AUDADC input clock. A value of 1 would divide the AUDADC input clock frequency by 2. A value of 5 would divide the AUDADC input clock frequency by 2^5 = 32. To update this value, first disable the INTTRIGTIMER by setting TIMEREN to DIS, change CLKDIV, and then reenable it INTTRIGTIMER by setting TIMEREN to EN again.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TIMERMAX</name>
              <description>Trigger counter count max, used as initial condition to trigger. Also used repeatedly each time counter reaches it to restart trigger timer at zero. To update this value, first disable the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX, and then reenable it INTTRIGTIMER by setting TIMEREN to EN again.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

