AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>HFADJCK</name>
              <description>Repeat period for HFRC adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>Autoadjust repeat period = 4 seconds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16SEC</name>
                  <description>Autoadjust repeat period = 16 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SEC</name>
                  <description>Autoadjust repeat period = 32 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64SEC</name>
                  <description>Autoadjust repeat period = 64 seconds</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128SEC</name>
                  <description>Autoadjust repeat period = 128 seconds</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SEC</name>
                  <description>Autoadjust repeat period = 256 seconds</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512SEC</name>
                  <description>Autoadjust repeat period = 512 seconds</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024SEC</name>
                  <description>Autoadjust repeat period = 1024 seconds</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFADJEN</name>
              <description>HFRC adjustment control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the HFRC adjustment</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the HFRC adjustment</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKENSTAT</name>
          <description>This register provides the enable status to all the peripheral clocks.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKENSTAT</name>
              <description>Clock enable status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIPH_ALL_XTAL_EN</name>
                  <description>[24] Clock enable for PERIPH_ALL_XTAL_EN</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIPH_ALL_HFRC_EN</name>
                  <description>[25] Clock enable for PERIPH_ALL_HFRC_EN</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFADJEN</name>
                  <description>[26] HFRC Adjust enabled</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_EN_HFADJ</name>
                  <description>[27] HFRC HFADJ enabled</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>nOSEL</name>
                  <description>[28] ~OSEL</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkout_xtal_en</name>
                  <description>[29] XTAL clkout enabled</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clkout_hfrc_en</name>
                  <description>[30] HFRC clkout enabled</description>
                  <value>1073741824</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN2STAT</name>
          <description>This is a continuation of the clock enable status.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN2STAT</name>
              <description>Clock enable status 2</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CLKEN</name>
                  <description>[0] Clock enable for the ADC.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_ACTIVITY_CLKEN</name>
                  <description>[1] Clock enable for the APBDMA ACTIVITY</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_AOH_CLKEN</name>
                  <description>[2] Clock enable for the APBDMA AOH DOMAIN</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_AOL_CLKEN</name>
                  <description>[3] Clock enable for the APBDMA AOL DOMAIN</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_APB_CLKEN</name>
                  <description>[4] Clock enable for the APBDMA_APB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_AUD_CLKEN</name>
                  <description>[5] Clock enable for the APBDMA_AUD</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_CRYPTO_CLKEN</name>
                  <description>[6] Clock enable for the APBDMA_HCPA</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_DBG_CLKEN</name>
                  <description>[7] Clock enable for the APBDMA_DBG</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_DISP_CLKEN</name>
                  <description>[8] Clock enable for the APBDMA_DISP</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_DISPPHY_CLKEN</name>
                  <description>[9] Clock enable for the APBDMA_DISPPHY</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_DSPA_CLKEN</name>
                  <description>[10] Clock enable for the APBDMA_DSPA</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_GFX_CLKEN</name>
                  <description>[11] Clock enable for the APBDMA_GFX</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HSPA_CLKEN</name>
                  <description>[12] Clock enable for the APBDMA_HSPA</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HSPB_CLKEN</name>
                  <description>[13] Clock enable for the APBDMA_HSPB</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_HSPC_CLKEN</name>
                  <description>[14] Clock enable for the APBDMA_HSPC</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_IOS_CLKEN</name>
                  <description>[15] Clock enable for the APBDMA_IOS</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI0_CLKEN</name>
                  <description>[16] Clock enable for the APBDMA_MSPI0</description>
                  <value>65536</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI1_CLKEN</name>
                  <description>[17] Clock enable for the APBDMA_MSPI1</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_MSPI2_CLKEN</name>
                  <description>[18] Clock enable for the APBDMA_MSPI2</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_SDIO_CLKEN</name>
                  <description>[19] Clock enable for the APBDMA_SDIO</description>
                  <value>524288</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APBDMA_USB_CLKEN</name>
                  <description>[20] Clock enable for the APBDMA_USB</description>
                  <value>1048576</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDADC_CLKEN</name>
                  <description>[21] Clock enable for the AUDADC</description>
                  <value>2097152</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4_TPIU_CLKEN</name>
                  <description>[22] Clock enable for the CM4_TPIU</description>
                  <value>4194304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_TPIU_CLKEN</name>
                  <description>[23] Clock enable for the DBG_TPIU</description>
                  <value>8388608</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBG_TS_CLKEN</name>
                  <description>[24] Clock enable for the DBG_TS</description>
                  <value>16777216</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISP_CLK_CLKEN</name>
                  <description>[25] Clock enable for the DISP_CLK</description>
                  <value>33554432</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPHY_PLL_REF_CLKEN</name>
                  <description>[26] Clock enable for the DPHY_PLL_REF</description>
                  <value>67108864</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_I2S0_CLKEN</name>
                  <description>[27] Clock enable for the DSP_I2S0</description>
                  <value>134217728</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_I2S0_REFCLK_CLKEN</name>
                  <description>[28] Clock enable for the DSP_I2S0_REFCLK</description>
                  <value>268435456</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_I2S1_CLKEN</name>
                  <description>[29] Clock enable for the DSP_I2S1</description>
                  <value>536870912</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_I2S1_REFCLK_CLKEN</name>
                  <description>[30] Clock enable for the DSP_I2S1_REFCLK</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_MILLI_CLKEN</name>
                  <description>[31] Clock enable for the DSP_MILLI</description>
                  <value>2147483648</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKEN3STAT</name>
          <description>This is a continuation of the clock enable status.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLOCKEN3STAT</name>
              <description>Clock enable status 3</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_PDM0_CLKEN</name>
                  <description>[0] Clock enable for the DSP_PDM0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PDM1_CLKEN</name>
                  <description>[1] Clock enable for the DSP_PDM1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PDM2_CLKEN</name>
                  <description>[2] Clock enable for the DSP_PDM2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PDM3_CLKEN</name>
                  <description>[3] Clock enable for the DSP_PDM3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0_REFCLK_CLKEN</name>
                  <description>[4] Clock enable for the I3C0_REFCLK</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C1_REFCLK_CLKEN</name>
                  <description>[5] Clock enable for the I3C1_REFCLK</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC0_CLKEN</name>
                  <description>[6] Clock enable for the IOMSTRIFC0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC1_CLKEN</name>
                  <description>[7] Clock enable for the IO MASTER 1 IFC INTERFACE</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC2_CLKEN</name>
                  <description>[8] Clock enable for the IO MASTER 2 IFC INTERFACE</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC3_CLKEN</name>
                  <description>[9] Clock enable for the IO MASTER 3 IFC INTERFACE</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC4_CLKEN</name>
                  <description>[10] Clock enable for the IO MASTER 4 IFC INTERFACE</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC5_CLKEN</name>
                  <description>[11] Clock enable for the IO MASTER 5 IFC INTERFACE</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC6_CLKEN</name>
                  <description>[12] Clock enable for the IO MASTER 6 IFC INTERFACE</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOMSTRIFC7_CLKEN</name>
                  <description>[13] Clock enable for the IO MASTER 7 IFC INTERFACE</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGEN_CLKEN</name>
                  <description>[14] Clock enable for the RSTGEN</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTGEN_POS_CLKEN</name>
                  <description>[15] Clock enable for the RSTGEN</description>
                  <value>32768</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CLKEN</name>
                  <description>[16] Clock enable for the RTC</description>
                  <value>65536</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIO_XIN_CLKEN</name>
                  <description>[17] Clock enable for the SDIO_XIN</description>
                  <value>131072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0HF_CLKEN</name>
                  <description>[18] Clock enable for the UART0 HF</description>
                  <value>262144</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1HF_CLKEN</name>
                  <description>[19] Clock enable for the UART1 HF</description>
                  <value>524288</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2HF_CLKEN</name>
                  <description>[20] Clock enable for the UART2 HF</description>
                  <value>1048576</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3HF_CLKEN</name>
                  <description>[21] Clock enable for the UART3 HF</description>
                  <value>2097152</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_REFCLK_CLKEN</name>
                  <description>[22] Clock enable for the USB_REFCLK</description>
                  <value>4194304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT_CLKEN</name>
                  <description>[23] Clock enable for the WDT</description>
                  <value>8388608</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>This register controls a 'safe' mode for burst, which disables the clock when burst transition is happening. It also includes a register to force the HFRC during deep sleep. It is mainly used for debug and testing.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>

          <fields>
            <field>
              <name>CLKGENMISCSPARE</name>
              <description>Spare/Unused Chicken Bit</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

