AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>HFRC96TRUNKGATE</name>
              <description>DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0, will kill HFRC root clock.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HFRC96_TRUNK_GATE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0, will kill HFRC root clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFRCFUNCCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on HFRC_FUNC_CLK</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETMTRACECLKCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on ETM TRACE CLK</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBDMACPUCLKCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on APB DMA CPU CLK</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXAXICLKCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on GFX AXI CLK</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GFXCLKCLKGATEEN</name>
              <description>Chicken bit to enable clock gating on GFX CLK</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM4DAXICLKGATEEN</name>
              <description>Chicken bit to enable clock gating on CM4 DAXI CLK</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENUSBREFCLK</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBREFCLKENRST</name>
                  <description>Enable USB REF Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENI2S1REFCLK</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S1REFCLKENRST</name>
                  <description>Enable I2S instance 1  Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENI2S0REFCLK</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S0REFCLKENRST</name>
                  <description>Enable I2S instance 0  Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXIXACLKENOVRRIDE</name>
              <description>Chicken bit to disable Rev B added clock gating</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFEATURE_DISABLED</name>
                  <description>Fine grain clock gating enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>AXI Clock enabled when core is not in Sleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENI2S1</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S1CLKENRST</name>
                  <description>Enable I2S instance 1 engine Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENI2S0</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2S0CLKENRST</name>
                  <description>Enable I2S instance 0 engine Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENCRYPTO</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRYPTOCLKENRST</name>
                  <description>Enable Cryto engine Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENSDIO</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDIOCLKENRST</name>
                  <description>Enable SDIO  Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENUSB</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USBCLKENRST</name>
                  <description>Enable USB Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENGFX</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GFXCLKENRST</name>
                  <description>Enable GFX Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENDISPPHY</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISPPHYCLKENRST</name>
                  <description>Enable Display Phy Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRONCLKENDISP</name>
              <description>Chicken bit to disable Rev B clock enable during reset</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISPCLKENRST</name>
                  <description>Enable Display Clock to run during reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFEATURE</name>
                  <description>Chicken bit to revert to rev A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCHFRC2</name>
              <description>Force HFRC2 On.Setting this bit forces HFRC2 to remain on, including in deep sleep. When changing a module's clock source to HFRC2, this bit must be set and remain set when any module is using HFRC2 as its clock.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFRC</name>
                  <description>Do not force HFRC2 on; stops in deep sleep mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC</name>
                  <description>Force HFRC2 on; runs in deep sleep mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEHFRC2FQ192MHZ</name>
              <description>Use HFRC-192MHz or HFRC2-192MHz for MCU</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCFQ192MHz</name>
                  <description>Use HFRC-192MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2FQ192MHz</name>
                  <description>Use HFRC2-192MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEHFRC2FQ96MHZ</name>
              <description>Use HFRC-96MHz or HFRC2-96MHz for DSP</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCFQ96MHz</name>
                  <description>Use HFRC-96MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2FQ96MHz</name>
                  <description>Use HFRC2-96MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEHFRC2FQ48MHZ</name>
              <description>Use HFRC-48MHz or HFRC2-48MHz for DSP</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRCFQ48MHz</name>
                  <description>Use HFRC-48MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2FQ48MHz</name>
                  <description>Use HFRC2-48MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCBURSTOFF</name>
              <description>Force fclk, hclk, fclk_wic and fclk_pmu to be turned off during burst transition.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BURSTCLKON</name>
                  <description>fclk, hclk and fclk_wic are turned on during the burst transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURSTCLKOFF</name>
                  <description>fclk, hclk and fclk are turned off during burst transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCHFRC</name>
              <description>Force HFRC On .</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOFRC</name>
                  <description>HFRC stops in deep sleep mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRC</name>
                  <description>HFRC runs in deep sleep mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HF2ADJ0</name>
          <description>This register controls hf2adj enable, fast_start enable, fast_start_delay setting and counter input offset.</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00003FFE</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>HF2ADJXTHSMUXSEL</name>
              <description>0=XTHS 1=EXTREF select</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

