AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>LS</name>
              <description>Enable LS (light sleep) of cache RAMs. Software should DISABLE this bit since cache activity is too high to benefit from LS usage.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKGATE</name>
              <description>Enable clock gating of cache TAG RAM. Software should enable this bit for optimal power efficiency.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DENABLE</name>
              <description>Enable CM4 Data Caching.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IENABLE</name>
              <description>Enable CM4 Instruction Caching</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONFIG</name>
              <description>Sets the cache configuration</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W1_128B_512E</name>
                  <description>Direct mapped, 128-bit linesize, 512 entries (4 SRAMs active)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W2_128B_512E</name>
                  <description>Two-way set associative, 128-bit linesize, 512 entries (8 SRAMs active)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W1_128B_1024E</name>
                  <description>Direct mapped, 128-bit linesize, 1024 entries (8 SRAMs active)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W1_128B_2048E</name>
                  <description>Direct mapped, 128-bit linesize, 2048 entries (4 SRAMs active)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W2_128B_2048E</name>
                  <description>Two-way set associative, 128-bit linesize, 2048 entries (8 SRAMs active)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W1_128B_4096E</name>
                  <description>Direct mapped, 128-bit linesize, 4096 entries (8 SRAMs active)</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NC1ENABLE</name>
              <description>Enable Non-cacheable region 1. See NCR1 registers to define the region.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NC0ENABLE</name>
              <description>Enable Non-cacheable region 0. See NCR0 registers to define the region.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LRU</name>
              <description>Sets the cache repleacment policy. 0=LRR (least recently replaced), 1=LRU (least recently used). LRR minimizes writes to the TAG SRAM.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLE</name>
              <description>Enables the CM4 cache controller and enables power to the cache SRAMs. The ICACHE_ENABLE and DCACHE_ENABLE should be set to enable caching for each type of access.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CACHECTRL</name>
          <description>Cache Control</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>CACHEREADY</name>
              <description>Cache Ready Status (enabled and not processing an invalidate operation)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESETSTAT</name>
              <description>Reset Cache Statistics. When written to a 1, the cache monitor counters will be cleared. The monitor counters can be reset only when the CACHECFG.ENABLE_MONITOR bit is set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Cache Stats</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>default Cache Stats</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVALIDATE</name>
              <description>Writing a 1 to this bitfield invalidates the CM4 cache contents.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR0START</name>
          <description>CM4 Cache Noncachable Region 0 Start</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 0</description>
              <bitRange>[28:4]</bitRange>
              <access>read-write</access>

