AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IMON2</name>
          <description>Instruction Cache Hits</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IHIT</name>
              <description>Cache hits from lookup operations</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMON3</name>
          <description>Instruction Cache Line Hits</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ILINE</name>
              <description>Cache hits from line cache</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>CRYPTO</name>
      <version>1.0</version>
      <description>Embedded security and cryptographic services</description>
      <!-- <groupName>GROUP_CRYPTO</groupName> -->
      <baseAddress>0x400C0000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00001F30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOSEC</name>
        <description>CRYPTOSEC_IRQ</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>MEMORYMAP0</name>
          <description>This register maps the virtual register R0 to a physical address in memory.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP0</name>
              <description>Contains the physical address in memory to map the R0 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP1</name>
          <description>This register maps the virtual register R1 to a physical address in memory.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP1</name>
              <description>Contains the physical address in memory to map the R1 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP2</name>
          <description>This register maps the virtual register R2 to a physical address in memory.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP2</name>
              <description>Contains the physical address in memory to map the R2 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP3</name>
          <description>This register maps the virtual register R3 to a physical address in memory.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP3</name>
              <description>Contains the physical address in memory to map the R3 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP4</name>
          <description>This register maps the virtual register R4 to a physical address in memory.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP4</name>
              <description>Contains the physical address in memory to map the R4 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP5</name>
          <description>This register maps the virtual register R5 to a physical address in memory.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP5</name>
              <description>Contains the physical address in memory to map the R5 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

