AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP6</name>
          <description>This register maps the virtual register R6 to a physical address in memory.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP6</name>
              <description>Contains the physical address in memory to map the R6 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP7</name>
          <description>This register maps the virtual register R7 to a physical address in memory.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP7</name>
              <description>Contains the physical address in memory to map the R7 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP8</name>
          <description>This register maps the virtual register R8 to a physical address in memory.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP8</name>
              <description>Contains the physical address in memory to map the R8 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP9</name>
          <description>This register maps the virtual register R9 to a physical address in memory.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP9</name>
              <description>Contains the physical address in memory to map the R9 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP10</name>
          <description>This register maps the virtual register R10 to a physical address in memory.</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP10</name>
              <description>Contains the physical address in memory to map the R10 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP11</name>
          <description>This register maps the virtual register R11 to a physical address in memory.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP11</name>
              <description>Contains the physical address in memory to map the R11 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP12</name>
          <description>This register maps the virtual register R12 to a physical address in memory.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP12</name>
              <description>Contains the physical address in memory to map the R12 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP13</name>
          <description>This register maps the virtual register R13 to a physical address in memory.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP13</name>
              <description>Contains the physical address in memory to map the R13 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP14</name>
          <description>This register maps the virtual register R14 to a physical address in memory.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP14</name>
              <description>Contains the physical address in memory to map the R14 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

