AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP24</name>
          <description>This register maps the virtual register R24 to a physical address in memory.</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP24</name>
              <description>Contains the physical address in memory to map the R24 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP25</name>
          <description>This register maps the virtual register R25 to a physical address in memory.</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP25</name>
              <description>Contains the physical address in memory to map the R25 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP26</name>
          <description>This register maps the virtual register R26 to a physical address in memory.</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP26</name>
              <description>Contains the physical address in memory to map the R26 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP27</name>
          <description>This register maps the virtual register R27 to a physical address in memory.</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP27</name>
              <description>Contains the physical address in memory to map the R27 register to.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP28</name>
          <description>This register maps the virtual register R28 to a physical address in memory.</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP28</name>
              <description>Contains the physical address in memory to map the R28 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP29</name>
          <description>This register maps the virtual register R29 to a physical address in memory.</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP29</name>
              <description>Contains the physical address in memory to map the R29 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP30</name>
          <description>This register maps the virtual register R30 to a physical address in memory.</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP30</name>
              <description>Contains the physical address in memory to map the R30 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MEMORYMAP31</name>
          <description>This register maps the virtual register R31 to a physical address in memory.</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FE</resetMask>

          <fields>
            <field>
              <name>PHYSADDRMAP31</name>
              <description>Contains the physical address in memory to map the R31 register.</description>
              <bitRange>[10:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OPCODE</name>
          <description>This register holds the PKAs OPCODE.</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OPCODE</name>
              <description>Defines the PKA operation:</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD</name>
                  <description>Add,Inc opcode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB</name>
                  <description>Sub,Dec,Neg opcode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODADD</name>
                  <description>ModAdd,ModInc opcode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODSUB</name>
                  <description>ModSub,ModDec,ModNeg opcode</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AND</name>
                  <description>AND,TST0,CLR0 opcode</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR</name>
                  <description>OR,COPY,SET0 opcode</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOR</name>
                  <description>XOR,FLIP0,INVERT,COMPARE opcode</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHR0</name>
                  <description>SHR0 opcode</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHR1</name>
                  <description>SHR1 opcode</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHL0</name>
                  <description>SHL0 opcode</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHL1</name>
                  <description>SHL1 opcode</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULLOW</name>
                  <description>MulLow opcode</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODMUL</name>
                  <description>ModMul opcode</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODMULN</name>
                  <description>ModMulN opcode</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODEXP</name>
                  <description>ModExp opcode</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISION</name>
                  <description>Division opcode</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV</name>
                  <description>Div opcode</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODDIV</name>
                  <description>ModDiv opcode</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATE</name>
                  <description>Terminate opcode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEN</name>
              <description>The length of the operation. The value serves as a pointer to PKA length register, for example, if the value is 0, PKA_L0 holds the size of the operation.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

