AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RNGIMR</name>
          <description>Interrupt masking register. Consists of {prng_imr trng_imr} bit[31-16] - PRNG_IMR bit[15-0] - TRNG_IMR(Ws - PRNG bit exists only if PRNG_EXISTS flag)</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>RNGDMADONEINT</name>
              <description>0x1 - masks the RNG DMA completion interrupt. No interrupt is generated.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WATCHDOGINTMASK</name>
              <description>0x1 - masks the watchdog interrupt. No interrupt is generated.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VNERRINTMASK</name>
              <description>0x1 - masks the Von-Neumann error interrupt. No interrupt is generated.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CRNGTERRINTMASK</name>
              <description>0x1 - masks the CRNGT error interrupt. No interrupt is generated.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCORRERRINTMASK</name>
              <description>0x1 - masks the autocorrelation interrupt. No interrupt is generated.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EHRVALIDINTMASK</name>
              <description>0x1 - masks the EHR interrupt. No interrupt is generated.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGISR</name>
          <description>Status register. If corresponding RNG_IMR bit is unmasked, an interrupt is generated.Consists of trng_isr and prng_isr bit[15-0] - TRNG bit[31-16] - PRNG</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF002F</resetMask>

          <fields>
            <field>
              <name>WHICHKATERR</name>
              <description>When the KAT_ERR bit is set, these bits represent which Known Answer Test had failed:</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INSTANT_1</name>
                  <description>first test of instantiation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INSTANT_2</name>
                  <description>second test of instantiation</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESEED_1</name>
                  <description>first test of reseeding</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESEED_2</name>
                  <description>second test of reseeding</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KATERR</name>
              <description>0x1 indicates that one of the KAT (Known Answer Tests) tests has failed. When set, the entire engine ceases to function.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REQSIZE</name>
              <description>0x1 indicates that the request size counter (which represents how many generations of random bits in the PRNG have been produced) has reached 2^12, thus requiring a working state update before generating new random numbers.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRNGCRNGTERR</name>
              <description>0x1 indicates CRNGT in the PRNG test failed. Failure occurs when two consecutive results of AES are equal</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDCNTRTOP40</name>
              <description>0x1 indicates that the top 40 bits of the reseed counter are set (that is the reseed counter is larger than 2^48-2^8). This is a recommendation for running the reseed algorithm before the counter reaches its max value.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESEEDCNTRFULL</name>
              <description>0x1 indicates that the reseed counter has reached 2^48, requiring to run the reseed algorithm before generating new random numbers.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTPUTREADY</name>
              <description>0x1 indicates that the result of PRNG is valid and ready to be read. The result can be read from the RNG_READOUT register.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

