AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>CRNGTERR</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCORRERR</name>
              <description>Cannot be cleared by SW! Only RNG reset clears this bit.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EHRVALID</name>
              <description>Writing value 0x1 - clears corresponding bit in RNGISR</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TRNGCONFIG</name>
          <description>This register handles TRNG configuration</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SOPSEL</name>
              <description>Secure Output Port selection:</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOP_DATA_1</name>
                  <description>sop_data port reflects TRNG output (EHR_DATA).</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOP_DATA_2</name>
                  <description>sop_data port reflects PRNG output (RNG_READOUT). Note: Secure output is used for direct connection of the RNG block outputs to an engine input key.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNDSRCSEL</name>
              <description>Defines the length of the oscillator ring (= the number of inverters) out of four possible selections.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TRNGVALID</name>
          <description>This register indicates that the TRNG data is valid.</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EHRVALID</name>
              <description>0x1 indicates that collection of bits in the TRNG is completed, and data can be read from the EHR_DATA register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA0</name>
          <description>This register contains the data collected in the TRNG[31_0]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[31_0]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA1</name>
          <description>This register contains the data collected in the TRNG[63_32]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[63_32]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA2</name>
          <description>This register contains the data collected in the TRNG[95_64]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[95_64]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA3</name>
          <description>This register contains the data collected in the TRNG[127_96]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[127_96]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

