AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA4</name>
          <description>This register contains the data collected in the TRNG[159_128]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[159_128]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>EHRDATA5</name>
          <description>This register contains the data collected in the TRNG[191_160]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EHRDATA</name>
              <description>Contains the data collected in the TRNG[191_160]. Note: can only be set while in debug mode (rng_debug_enable input is set).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNDSOURCEENABLE</name>
          <description>This register holds the enable signal for the random source.</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>RNDSRCEN</name>
              <description>Enable signal for the random source.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SAMPLECNT1</name>
          <description>Counts clocks between sampling of random bit.</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SAMPLECNTR1</name>
              <description>Sets the number of rng_clk cycles between two consecutive ring oscillator samples. Note: If the Von-Neumann is bypassed, the minimum value for sample counter must not be less than decimal seventeen.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCORRSTATISTIC</name>
          <description>Statistics about autocorrelation test activations.</description>
          <addressOffset>0x00000134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>

          <fields>
            <field>
              <name>AUTOCORRFAILS</name>
              <description>Count each time an autocorrelation test fails. Any write to the register resets the counter. Stops collecting statistics if one of the counters has reached the limit.</description>
              <bitRange>[21:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCORRTRYS</name>
              <description>Count each time an autocorrelation test starts. Any write to the register resets the counter. Stops collecting statistics if one of the counters has reached the limit.</description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TRNGDEBUGCONTROL</name>
          <description>This register is used to debug the TRNG</description>
          <addressOffset>0x00000138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000E</resetMask>

          <fields>
            <field>
              <name>AUTOCORRELATEBYPASS</name>
              <description>When this bit is set, the autocorrelation test in the TRNG module is bypassed. Note: Can only be set while in debug mode. If TRNG_TESTS_BYPASS_EN HW flag is defined, this bit can be set while not in debug mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRNGCRNGTBYPASS</name>
              <description>When this bit is set, the CRNGT test in the TRNG is bypassed. Note: Can only be set while in debug mode. If TRNG_TESTS_BYPASS_EN HW flag is defined, this bit can be set while not in debug mode.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VNCBYPASS</name>
              <description>When this bit is set, the Von-Neumann balancer is bypassed (including the 32 consecutive bits test). Note: Can only be set while in debug mode. If TRNG_TESTS_BYPASS_EN HW flag is defined, this bit can be set while not in debug mode.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGSWRESET</name>
          <description>Generate SW reset solely to RNG block.</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>RNGSWRESET</name>
              <description>Any value written (0x0 or 0x1) causes a reset cycle to the TRNG block.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

