AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RNGDEBUGENINPUT</name>
          <description>Defines the RNG in debug mode</description>
          <addressOffset>0x000001B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>RNGDEBUGEN</name>
              <description>Reflects the rng_debug_enable input port</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGBUSY</name>
          <description>RNG busy indication</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>PRNGBUSY</name>
              <description>Reflects prng_busy.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TRNGBUSY</name>
              <description>Reflects trng_busy.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGBUSY</name>
              <description>Reflects rng_busy output port which Consists of trng_busy and prng_busy.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RSTBITSCOUNTER</name>
          <description>Resets the counter of collected bits in the TRNG</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>RSTBITSCOUNTER</name>
              <description>Writing any value to this address resets the bits counter and trng valid registers.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RNGVERSION</name>
          <description>This register holds the RNG version</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>RNGUSE5SBOXES</name>
              <description>RNG use 5 (or 20) SBOX AES</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20_SBOX_AES</name>
                  <description>20 SBOX AES</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_SBOX_AES</name>
                  <description>5 SBOX AES</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESEEDINGEXISTS</name>
              <description>Reseeding exists.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXISTS</name>
                  <description>exists</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORESEED</name>
                  <description>Reseed does not exists</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KATEXISTS</name>
              <description>KAT exists.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXIST</name>
                  <description>does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXISTS</name>
                  <description>exists</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRNGEXISTS</name>
              <description>PRNG Exists.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXIST</name>
                  <description>does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXISTS</name>
                  <description>exists</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRNGTESTSBYPASSEN</name>
              <description>TRNG tests bypass enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_NE</name>
                  <description>trng tests bypass not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRNG_E</name>
                  <description>trng tests bypass enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUTOCORREXISTS</name>
              <description>Auto correct exists.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXIST</name>
                  <description>does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXISTS</name>
                  <description>exists</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRNGTEXISTS</name>
              <description>CRNGT exists.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXIST</name>
                  <description>does not exist</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXISTS</name>
                  <description>exists</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EHRWIDTH192</name>
              <description>EHR width selection.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128_EHR</name>
                  <description>128 bit EHR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192_EHR</name>
                  <description>192 bit EHR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGCLKENABLE</name>
          <description>Writing to this register enables_disables the RNG clock.</description>
          <addressOffset>0x000001C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Writing value 0x1 enables RNG clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

