AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY12</name>
          <description>bits 95:64 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x00000428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY12</name>
              <description>bits 95:64 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY13</name>
          <description>bits 127:96 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY13</name>
              <description>bits 127:96 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY14</name>
          <description>bits 159:128 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY14</name>
              <description>bits 159:128 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY15</name>
          <description>bits 191:160 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x00000434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY15</name>
              <description>bits 191:160 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY16</name>
          <description>bits 223:192 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY16</name>
              <description>bits 223:192 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESKEY17</name>
          <description>bits 255:224 of AES Key1 (used as the second AES tunnel stage key in tunneling operations).</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESKEY17</name>
              <description>bits 255:224 of AES Key1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV00</name>
          <description>bits 31:0 of AES_IV0 register. AES IV0 is used as the AES IV (Initialization Value) register in non-tunneling operations,and as the first tunnel stage IV register in tunneling operations.The IV register should be loaded according to the AES mode:in AES CBC_CBC-MAC - the AES IV register should be loaded with the IV (initialization vector).in XTS-AES - the AES IV register should be loaded with the T value (unless the HW T calculation mode is active, in which the T value is calculated by the HW).</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV00</name>
              <description>bits 31:0 of AES_IV0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV01</name>
          <description>bits 63:32 of AES_IV0 128b register.For the description of AES_IV0, see the AES_IV_0_0 register description</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV01</name>
              <description>bits 63:32 of AES_IV0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV02</name>
          <description>bits 95:64 of AES_IV0 128b register.For the description of AES_IV0, see the AES_IV_0_0 register description</description>
          <addressOffset>0x00000448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV02</name>
              <description>bits 95:64 of AES_IV0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

