AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>AESCTR03</name>
          <description>bits 127:96 of AES_CTR0 128b register.For the description of AES_CTR0, see the AES_CTR_0_0 register description.</description>
          <addressOffset>0x0000046C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESCTR03</name>
              <description>bits 127:96 of AES_CTR0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESBUSY</name>
          <description>This register is set when the AES core is active</description>
          <addressOffset>0x00000470</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESBUSY</name>
              <description>AES_BUSY register. This register is set when the AES core is active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESSK</name>
          <description>writing to this address causes sampling of the HW key to the AES_KEY0 register</description>
          <addressOffset>0x00000478</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESSK</name>
              <description>writing to this address causes sampling of the HW key to the AES_KEY0 register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCMACINIT</name>
          <description>Writing to this address triggers the AES engine generating of K1 and K2 for AES CMAC operations. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x0000047C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESCMACINIT</name>
              <description>Writing to this address starts the generating of K1 and K2 for AES CMAC operations</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESSK1</name>
          <description>writing to this address causes sampling of the HW key to the AES_KEY1 register</description>
          <addressOffset>0x000004B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESSK1</name>
              <description>writing to this address causes sampling of the HW key to the AES_KEY1 register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESREMAININGBYTES</name>
          <description>This register should be set with the amount of remaining bytes until the end of the current AES operation. The AES engine counts down from this value to determine the last _ one before last blocks in AES CMAC, XTS AES and AES CCM.</description>
          <addressOffset>0x000004BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESREMAININGBYTES</name>
              <description>This register should be set with the amount of remaining bytes until the end of the current AES operation. The AES engine counts down from this value to determine the last _ one before last blocks in AES CMAC, XTS AES and AES CCM.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCONTROL</name>
          <description>This register holds the configuration of the AES engine. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x000004C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xB7C0FDFF</resetMask>

          <fields>
            <field>
              <name>DIRECTACCESS</name>
              <description>Using direct access and not the din-dout interface</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESXORCRYPTOKEY</name>
              <description>This field determines the value that is written to AES_KEY0, when AES_SK is kicked:</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRYPTOKEY</name>
                  <description>The value that is written to AES_KEY0 is the value of the HW cryptokey, as is.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTOKEY_XOR</name>
                  <description>The value that is written to AES_KEY0 is the value of the HW cryptokey xored with the current value of AES_KEY0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESOUTMIDTUNTOHASH</name>
              <description>This field determines for AES-TO-HASH-AND-DOUT tunneling operations, whether the AES outputs to the HASH the result of the first or the second tunneling stage:</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_2</name>
                  <description>The AES engine writes to the hash the result of the second tunnel stage.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_1</name>
                  <description>The AES engine writes to the hash the result of the first tunnel stage.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESTUNNELB1PADEN</name>
              <description>This field determines whether the input data to the second tunnel stage is padded with zeroes (according to the remaining_bytes value) or not:</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_NO_PAD</name>
                  <description>The data input to the second tunnel block is not padded with zeros.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_IS_PAD</name>
                  <description>The data input to the second tunnel block is padded with zeros.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESOUTPUTMIDTUNNELDATA</name>
              <description>This fields determines whether the AES output is the result of the first or second tunneling stage:</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENGINE_RSLT_2</name>
                  <description>The AES engine outputs the result of the second tunnel stage (standard tunneling).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENGINE_RSLT_1</name>
                  <description>The AES engine outputs the result of the first tunnel stage.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESTUNNEL0ENCRYPT</name>
              <description>This field determines whether the first tunnel stage performs encrypt or decrypt operation :</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TUNNEL_1_D</name>
                  <description>the first tunnel stage performs decrypt operations.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNNEL_1_E</name>
                  <description>the first tunnel stage performs encrypt operations.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESTUNB1USESPADDEDDATAIN</name>
              <description>This field determines, for tunneling operations, the data that is fed to the second tunneling stage:</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLOCK_1</name>
                  <description>the output of the first block (standard tunneling operation).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFTER_PAD</name>
                  <description>data_in after padding rather than the output of the first block.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESTUNNEL1DECRYPT</name>
              <description>This field determines whether the second tunnel stage performs encrypt or decrypt operation :</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TUNNEL_2_E</name>
                  <description>the second tunnel stage performs encrypt operations.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TUNNEL_2_D</name>
                  <description>the second tunnel stage performs decrypt operations.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NKKEY1</name>
              <description>This field determines the AES key length of the second stage operation in tunneling operations:</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128_BITS_KEY</name>
                  <description>128 bits key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192_BITS_KEY</name>
                  <description>192 bits key</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_BITS_KEY</name>
                  <description>256 bits key</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_A</name>
                  <description>Not applicable</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NKKEY0</name>
              <description>This field determines the AES Key length in non tunneling operations, and the AES key length of the first stage in tunneling operations:</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128_BITS_KEY</name>
                  <description>128 bits key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192_BITS_KEY</name>
                  <description>192 bits key</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256_BITS_KEY</name>
                  <description>256 bits key</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_A</name>
                  <description>Not applicable</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBCISBITLOCKER</name>
              <description>If MODE_KEY0 is set to 3b001 (CBC), and this field is set - the mode isBITLOCKER.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

