AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HASHXORDIN</name>
          <description>This register is always xored with the input to the hash engine,it should be 0 if xored is not reqiured .</description>
          <addressOffset>0x00000688</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HASHXORDATA</name>
              <description>This register holds the value to be xor-ed with hash input data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LOADINITSTATE</name>
          <description>Indication to HASH that the following data is to be loaded into initial value registers in HASH(H0:H15) or IV to AES MAC</description>
          <addressOffset>0x00000694</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LOAD</name>
              <description>Load data to initial state registers. digest_iv for hash_aes_mac. When done loading data this bit should be reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHSELAESMAC</name>
          <description>select the AES MAC module rather than the hash module</description>
          <addressOffset>0x000006A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>GHASHSEL</name>
              <description>GHASH select.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_MOD</name>
                  <description>select the hash module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GHASH_MOD</name>
                  <description>select the ghash module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHSELAESMAC</name>
              <description>Hash or AES MAC module select.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_MOD</name>
                  <description>select the hash module</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAC_MOD</name>
                  <description>select the AES mac module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHVERSION</name>
          <description>HASH VERSION Register</description>
          <addressOffset>0x000007B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>MAJORVERSIONNUMBER</name>
              <description>major version number</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MINORVERSIONNUMBER</name>
              <description>minor version number</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIXES</name>
              <description>Fixes field.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHCONTROL</name>
          <description>Selects which HASH mode to run</description>
          <addressOffset>0x000007C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000B</resetMask>

          <fields>
            <field>
              <name>MODE3</name>
              <description>bit 3 of the HASH mode field. The hash mode field possible values are:4b0000 - MD5 if present 0x0001  SHA 1 4b0010 - SHA-256 4b1010 - SHA-224</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MODE01</name>
              <description>bits 1:0 of the HASH mode field. The hash mode field possible values are:</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MD5</name>
                  <description>MD5 if present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_1</name>
                  <description>SHA-1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_256</name>
                  <description>SHA-256</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHPADEN</name>
          <description>Enables the hash hw padding.</description>
          <addressOffset>0x000007C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>0x1 : Enable generation of padding by HW Pad block. 0x0 :  Disable generation of padding by HW Pad block.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

