AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>GHASHSUBKEY00</name>
          <description>Bits 31:0 of GHASH Key0 (used as the GHASH module key).</description>
          <addressOffset>0x00000960</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHSUBKEY00</name>
              <description>Bits 31:0 of GHASH Key0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHSUBKEY01</name>
          <description>Bits 63:32 of GHASH Key0 (used as the GHASH module key).</description>
          <addressOffset>0x00000964</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHSUBKEY01</name>
              <description>Bits 63:32 of GHASH Key0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHSUBKEY02</name>
          <description>Bits 95:64 of GHASH Key0 (used as the GHASH module key).</description>
          <addressOffset>0x00000968</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHSUBKEY02</name>
              <description>Bits 95:64 of GHASH Key0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHSUBKEY03</name>
          <description>Bits 127:96 of GHASH Key0 (used as the GHASH module key).</description>
          <addressOffset>0x0000096C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHSUBKEY03</name>
              <description>Bits 127:96 of GHASH Key0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHIV00</name>
          <description>Bits 31:0 of GHASH_IV0 register. GHASH IV0 is used as the GHASH IV (Initialization Value) register.</description>
          <addressOffset>0x00000970</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHIV00</name>
              <description>Bits 31:0 of GHASH_IV0 register of the GHASH module. For the description of GHASH_IV0, see the GHASH_0_0 register description</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHIV01</name>
          <description>Bits 63:32 of GHASH_IV0 register. GHASH IV0 is used as the GHASH IV (Initialization Value) register.</description>
          <addressOffset>0x00000974</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHIV01</name>
              <description>Bits 63:32 of GHASH_IV0 register of the GHASH module.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHIV02</name>
          <description>Bits 95:64 of GHASH_IV0 register. GHASH IV0 is used as the GHASH IV (Initialization Value) register.</description>
          <addressOffset>0x00000978</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHIV02</name>
              <description>Bits 95:64 of GHASH_IV0 register of the GHASH module.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHIV03</name>
          <description>Bits 127:96 of GHASH_IV0 register.GHASH IV0 is used as the GHASH IV (Initialization Value) register.</description>
          <addressOffset>0x0000097C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>GHASHIV03</name>
              <description>Bits 127:96 of GHASH_IV0 register of the GHASH module.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GHASHBUSY</name>
          <description>The GHASH module GHASH_BUSY Register. This register is set when the GHASH core is active.</description>
          <addressOffset>0x00000980</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>GHASHBUSY</name>
              <description>GHASH_BUSY Register. This register is set when the GHASH core is active</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

