AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>ONLYENCRYPTLOCAL</name>
              <description>ONLY_ENCRYPT_LOCAL</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SUPPORT256192KEYLOCAL</name>
              <description>SUPPORT_256_192_KEY_LOCAL</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TUNNELINGENBLOCAL</name>
              <description>TUNNELING_ENB_LOCAL</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESDINBYTERESOLUTIONLOCAL</name>
              <description>AES_DIN_BYTE_RESOLUTION_LOCAL</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTREXISTSLOCAL</name>
              <description>CTR_EXISTS_LOCAL</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESXEXEXISTSLOCAL</name>
              <description>AES_XEX_EXISTS_LOCAL</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESXEXHWTCALCLOCAL</name>
              <description>AES_XEX_HW_T_CALC_LOCAL</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESCCMEXISTSLOCAL</name>
              <description>AES_CCM_EXISTS_LOCAL</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESCMACEXISTSLOCAL</name>
              <description>AES_CMAC_EXISTS_LOCAL</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESXCBCMACEXISTSLOCAL</name>
              <description>AES_XCBC_MAC_EXISTS_LOCAL</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DESEXISTSLOCAL</name>
              <description>DES_EXISTS_LOCAL</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>C2EXISTSLOCAL</name>
              <description>C2_EXISTS_LOCAL</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HASHEXISTSLOCAL</name>
              <description>HASH_EXISTS_LOCAL</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MD5PRSNTLOCAL</name>
              <description>MD5_PRSNT_LOCAL</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHA256PRSNTLOCAL</name>
              <description>SHA_256_PRSNT_LOCAL</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHA512PRSNTLOCAL</name>
              <description>SHA_512_PRSNT_LOCAL</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RC4EXISTSLOCAL</name>
              <description>RC4_EXISTS_LOCAL</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKAEXISTSLOCAL</name>
              <description>PKA_EXISTS_LOCAL</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGEXISTSLOCAL</name>
              <description>RNG_EXISTS_LOCAL</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PAUEXISTSLOCAL</name>
              <description>PAU_EXISTS_LOCAL</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSCRPTREXISTSLOCAL</name>
              <description>DSCRPTR_EXISTS_LOCAL</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAMSIZELOCAL</name>
              <description>SRAM_SIZE_LOCAL</description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RKEKECCEXISTSLOCALN</name>
              <description>RKEK_ECC_EXISTS_LOCAL_N</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXTMEMSECUREDLOCAL</name>
              <description>EXT_MEM_SECURED_LOCAL</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HASHINFUSESLOCAL</name>
              <description>HASH_IN_FUSES_LOCAL</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LARGERKEKLOCAL</name>
              <description>LARGE_RKEK_LOCAL</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

