AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>SYNTHESISCONFIG</name>
              <description>POWER_GATING_EXISTS_LOCAL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTCRYPTOKEYSEL</name>
          <description>AES hardware key select. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000A38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>SELCRYPTOKEY</name>
              <description>Select the source of the HW key that is used by the AES engine:</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RKEK</name>
                  <description>rkek</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Krtl</name>
                  <description>the Krtl.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KCP</name>
                  <description>the provision key KCP.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KCE</name>
                  <description>the code encryption key KCE.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KPICV</name>
                  <description>the KPICV, The ICV provisioning key .</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KCEICV</name>
                  <description>the code encryption key KCEICV Note: When 'kprtl_lock' is set - kprtl will be masked (trying to load it will load zeros to the AES key register. When 'kcertl_lock' is set - kcertl will be masked (trying to load it will load zeros to the AES key register. When scan_mode is asserted all the RTL keys (Krtll) will be masked.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTCORECLKGATINGENABLE</name>
          <description>This register enables the core clk gating by masking_enabling the cc_idle_state output signal.</description>
          <addressOffset>0x00000A78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTCORECLKGATINGENABLE</name>
              <description>Enable the core clk gating,</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTCCISIDLE</name>
          <description>This register holds the idle indication of CC . Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000A7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000003B9</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>CRYPTOISIDLE</name>
              <description>crypto flow is done</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKAISIDLE</name>
              <description>pka is idle</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGISIDLE</name>
              <description>rng is idle</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FATALWR</name>
              <description>fatal write</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NVMISIDLE</name>
              <description>nvm is idle</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NVMARBISIDLE</name>
              <description>nvm arbiter is idle</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AHBISIDLE</name>
              <description>ahb stste machine is idle</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SYMISBUSY</name>
              <description>symetric flow is busy</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTCCISIDLEEVENT</name>
              <description>The event that indicates that CC is idle.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTCCISIDLE</name>
              <description>Read if CC is idle.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

