AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID3</name>
          <description>Component ID3.</description>
          <addressOffset>0x00000FFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000B1</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL3</name>
              <description>constant 0xB1</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN0</name>
          <description>The DCU [31:0] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN0</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN1</name>
          <description>The DCU [63:32] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN1</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN2</name>
          <description>The DCU [95:64] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN2</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCUEN3</name>
          <description>The DCU [1271:96] enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCUEN3</name>
              <description>Debug Control Unit (DCU) Enable bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK0</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK0</name>
              <description>DCU_lock [31:0] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK1</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK1</name>
              <description>DCU_lock [63:32] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK2</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK2</name>
              <description>DCU_lock [95:64] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTDCULOCK3</name>
          <description>The DCU lock register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HOSTDCULOCK3</name>
              <description>DCU_lock [127:96] register (a dedicated lock register per DCU bit).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

