AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>HOSTKCEICVLOCK</name>
              <description>When this FW controlled register is set, the Kceicv HW key is masked (to zero).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKPICVLOCK</name>
              <description>When this FW controlled register is set, the Kpicv HW key is masked (to zero).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTFATALERR</name>
              <description>When the 'FATAL_ERROR' register is asserted - HW keys will not be copied from OTP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOAPBFILTERING</name>
          <description>This register holds the AO_APB_FILTERING data. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>APBCONLYINSTACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_INST_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYINSTACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only instruction accesses</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYPRIVACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYPRIVACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only privileged accesses</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYSECACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_SEC_ACCESS_ALLOWED register cant be modified (until the next POR).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>APBCONLYSECACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB-C slave accepts only secure accesses</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYPRIVACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED register cant be modified (until the next POR)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYPRIVACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB slave accepts only privileged accesses</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYSECACCESSALLOWLOCK</name>
              <description>when this FW controlled register is set, the ONLY_SEC_ACCESS_ALLOWED register cant be modified (until the next POR).</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYSECACCESSALLOW</name>
              <description>when this FW controlled register is set, the APB slave accepts only secure accesses</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOCCGPPC</name>
          <description>holds the AO_CC_GPPC value from AONote: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>AOCCGPPC</name>
              <description>The AO_CC_GPPC value</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFCCSWRST</name>
          <description>Writing to this register generates a general reset to CryptoCell. This reset takes about 4 core clock cycles.Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTRGFCCSWRST</name>
              <description>Writing 1 to this field generates a general reset to CryptoCell.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

