AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>ERRORKCEZEROCNT</name>
              <description>Indication that the number of zeroes in the loaded KCE is not equal to the value set in the OEM flag.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ERRORPROVZEROCNT</name>
              <description>Indication that the number of zeroes in the loaded KCP is not equal to the value set in the OEM flag.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ERRORKDRZEROCNT</name>
              <description>Indication that the number of zeroes in the loaded KDR is not equal to the value set in the manufacture flag.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LCSREG</name>
              <description>Indicates the LCS (Lifecycle State) value.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM</name>
                  <description>CM lifecycle state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM</name>
                  <description>DM lifecycle state</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE</name>
                  <description>SE lifecycle state</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RMA</name>
                  <description>RMA lifecycle state</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTSHADOWKDRREG</name>
          <description>This register interface is used to update the RKEK(KDR) registers when the device is in CM or DM mode , it is Write-once (per warm boot) in RMA LCS, The RKEK is updated by shifting .</description>
          <addressOffset>0x00001F18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTSHADOWKDRREG</name>
              <description>This field is used to update the KDR registers when the device is in CM , DM or RMA mode, The KDR is updated by shifting .</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTSHADOWKCPREG</name>
          <description>This register interface is used to update the KCP registers when the device is in CM or DM mode, The KCP is updated by shifting</description>
          <addressOffset>0x00001F1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTSHADOWKCPREG</name>
              <description>This field is used to update the KCP registers when the device is in CM or DM mode, The KCP is updated by shifting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTSHADOWKCEREG</name>
          <description>This register interface is used to update the KCE registers when the device is in CM or DM mode, The KCE is updated by shifting</description>
          <addressOffset>0x00001F20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTSHADOWKCEREG</name>
              <description>This field is used to update the KCE registers when the device is in CM or DM mode, The KCE is updated by shifting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTSHADOWKPICVREG</name>
          <description>This register interface is used to update the KPICV registers when the device is in CM or DM mode, The KPICV is updated by shifting</description>
          <addressOffset>0x00001F24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTSHADOWKPICVREG</name>
              <description>This field is used to update the KPICV registers when the device is in CM or DM mode, The KPICV is updated by shifting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTSHADOWKCEICVREG</name>
          <description>This register interface is used to update the KCEICV registers when the device is in CM or DM mode, The KCEICV is updated by shifting</description>
          <addressOffset>0x00001F28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTSHADOWKCEICVREG</name>
              <description>This field is used to update the KCEICV registers when the device is in CM or DM mode, The KCEICV is updated by shifting</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

