AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>LAYER0COLMODE</name>
              <description>Color mode</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER0CM_LUTBLE</name>
                  <description>8-bit color palette look-up table (LUT8)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGBX5551</name>
                  <description>16-bit RGBX5551 color format</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGBX8888</name>
                  <description>32-bit RGBX8888 color format</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGB332</name>
                  <description>8-bit RGB332 color format</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RGB565</name>
                  <description>16-bit RGB565 color format</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_XRGB8888</name>
                  <description>32-bit XRGB8888 color format</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_L8</name>
                  <description>L8 Grayscale/Palette format</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_L1</name>
                  <description>L1 Grayscale/Palette format</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_L4</name>
                  <description>L4 Grayscale/Palette format</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_YUYV</name>
                  <description>color format</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_RBG</name>
                  <description>24-bit RGB color format</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_YUY2</name>
                  <description>YUY2 color format</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_ABGR8888</name>
                  <description>32-bit ABGR8888 color format</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_BGRA8888</name>
                  <description>32-bit BGRA8888 color format</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_Video</name>
                  <description>Video 420 Mode</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER0CM_Trilinear</name>
                  <description>Trilinea 420 Video Mode</description>
                  <value>17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0STARTXY</name>
          <description>X and Y start dimensions of layer 0.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER0XOFF</name>
              <description>Specify the pixel offset of the starting X dimension of layer 0</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0YOFF</name>
              <description>Specify the pixel offset of the starting Y dimension of layer 0</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0SIZEXY</name>
          <description>X and Y size of layer 0.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER0PIXSZEX</name>
              <description>Specify the pixel size of the layer 0 in the X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER0PIXSZEY</name>
              <description>Specify the pixel size of the layer 0 in the Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER0ADDR</name>
          <description>The start address of the framebuffer to be accessed by layer 0.</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER0STARTADDRFBUF</name>
              <description>Specify the start address of framebuffer for each layer 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

