AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER2MODE</name>
          <description>Activate and set-up layer 2.</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER2EN</name>
              <description>When set to 1, layer n is enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2FORCE</name>
              <description>When set to 1, force alpha with global alpha is enabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2BFILTER</name>
              <description>When set to 1, bilinear filtering is enabled</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2PREMULT</name>
              <description>When set to 1, premultiply image alpha is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2HLOCK</name>
              <description>When set to 1, HLOCK signal on AHB DMAs is asserted</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2GAMMA</name>
              <description>When set to 1, Gamma Look Up Table is enabled</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This field is reserved.</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2ALPHA</name>
              <description>Alpha layer global value (0x00-0xFF range)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER2DBLEND</name>
              <description>Destination blending function</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER2_DBLACK_BLEND</name>
                  <description>blend black</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DWHITE_BLEND</name>
                  <description>blend white</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DALBHAS_BLEND</name>
                  <description>blend alpha source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DALPHAG_BLEND</name>
                  <description>blend alpha global</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DALPHASG_BLEND</name>
                  <description>blend alpha source and alpha global</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DINVERT_BLEND_SRC</name>
                  <description>blend inverted source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DINVERT_GLOBAL_BLEND</name>
                  <description>blend inverted global</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DINVERTSG_BLEND</name>
                  <description>blend inverted source and inverted global</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DALPHA_BLEND</name>
                  <description>blend alpha destination</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_DINVERT_BLEND_DST</name>
                  <description>blend inverted destination</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER2SBLEND</name>
              <description>Source blending function</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER2_SBLACK_BLEND</name>
                  <description>blend black</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SWHITE_BLEND</name>
                  <description>blend white</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SALBHAS_BLEND</name>
                  <description>blend alpha source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SALPHAG_BLEND</name>
                  <description>blend alpha global</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SALPHASG_BLEND</name>
                  <description>blend alpha source and alpha global</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SINVERT_BLEND_SRC</name>
                  <description>blend inverted source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SINVERT_GLOBAL_BLEND</name>
                  <description>blend inverted global</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SINVERTSG_BLEND</name>
                  <description>blend inverted source and inverted global</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SALPHA_BLEND</name>
                  <description>blend alpha destination</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER2_SINVERT_BLEND_DST</name>
                  <description>blend inverted destination</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

