AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>STATDBIPENDCOM</name>
              <description>Indicates pending commands in DBI interface</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDBIRGB</name>
              <description>Indicates pending RGB data in DBI interface</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATTEAR</name>
              <description>Indicates DBI Type-B tearing effect</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATSTICKY</name>
              <description>Indicates sticky underflow. This bit clears when interrupt register is written</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATUF</name>
              <description>Indicates current underflow</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATLAST</name>
              <description>Indicates that the last row is currently displayed</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATCSYNC</name>
              <description>Indicates the CSYNC signal status (0 or 1) at the current time of reading</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATVSYNC</name>
              <description>Indicates the VSYNC signal status and the tearing e?ect signal status (0 or 1) at the current time of reading</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATHSYNC</name>
              <description>Indicates the HSYNC signal status (0 or 1) at the current time of reading</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATDE</name>
              <description>Indicates the DE signal status (0 or 1) at the current time of reading</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATNOTBLANK</name>
              <description>Indicates that the controller is not in active vertical blanking</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COLMOD</name>
          <description>Color mode status register indicating formats/back pressure are enabled.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x006E0000</resetValue>
          <resetMask>0xE07FFFFF</resetMask>

          <fields>
            <field>
              <name>CLMDBKPRESSURE</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDLVDS</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDJDI</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDARGB4444</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDRGBA4444</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDQPI</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDDBIBEXTCTRL</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDTSC6</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDTSC</name>
              <description>Indicates that back pressure support for the DBI Type B interface is enabled</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDLUT8</name>
              <description>Indicates that the LUT8 color format is enabled</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

