AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>RxDSINR</name>
              <description>(RW1C) RxDSI data type not recognised; Set to 1 if the data type is not recognised by the display device is reported in the Acknowledge packet by the display device</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCHECKSUM</name>
              <description>(RW1C) Set to 1 if the computed CRC differs from the received CRC value and is reported in the acknowledge packet by the display device</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RxECCM</name>
              <description>(RW1C) RxECC multibit error; Set to 1 if there is no ECC correction for the packet or there are more than 2 bit errors in the packet isreported in the Acknowledge packet by the display device</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RxECCS</name>
              <description>(RW1C) RRxECC single bit error; Set to 1 if ECC syndrome was computed and corrected for one bit error is reported in the Acknowledge packet by the display device</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFALSECNTRL</name>
              <description>(RW1C) RxFalse Control Error; Set to 1 if a control error is reported in the acknowledge packet by the display device</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXPERIPHERAL</name>
              <description>(RW1C) Rx Peripheral timeout Error; Set to 1 if the high speed receive timer value or LP Tx timer value are expired, display device is reported in the Acknowledge packet</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXLPTXSYNCERR</name>
              <description>(RW1C) Rx LP tx sync error; Set to 1 if Low power transmission sync error occurs in the display device and is reported in the Acknowledge packet by the display device</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXESCAPEMODE</name>
              <description>(RW1C) Entry Error;  Set to 1 if Escape Mode Entry command is not understandable by the display device and is reported in the Acknowledge packet by the display device.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXEOTSYNCERROR</name>
              <description>(RW1C) Set to 1 if End of transmission synchronisation Error is reported in the acknowledgment packet by the display device</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSOTSYNCERROR</name>
              <description>(RW1C) Set to 1 if synchronisation error occurrence in the   start of transmission sequence is reported in the acknowledge packet by the display device</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSOTERROR</name>
              <description>(RW1C) Set to 1 if a start of transmission sequence error is reported in the Acknowledge packet by the display device</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTREN</name>
          <description>Interrupt enable register.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DPI</name>
              <description>PGRMERR     DPI program error; Set to 1 indicates that the error in DPI parameters programming</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPILINETO</name>
              <description>Dpi line timeout; Set to 1 indicates that the line time out during the DPI transfer</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCONTENT</name>
              <description>Detected  Rx Contention Detected; Set to enable the interrupt for contention detected error in the acknowledgment packet reports</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INITDONE</name>
              <description>Set 1 indicates that the DSI initialisation is done DSI Tx is ready to accept the DPI or DBI or Generic transfer</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPECIALPACK</name>
              <description>Special packet command sent; Set to enable the confirmation interrupt for transmitting DPI events set in the dpi data and dpi control registers</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDSI</name>
              <description>Rx DSI protocol violation; Set to enable DSI protocol violation error</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

