AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>SHUTDOWN</name>
              <description>Set to 1 to indicate a shut down short packet has to be packetised for the DPIs virtual channel</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PLLLOCKCNT</name>
          <description>The PLL counter value</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000007D0</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>PLLCNTVAL</name>
              <description>Pll counter value in terms of low power clock.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INITCNT</name>
          <description>Count register to initialize the DSI HOST IP</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000007D0</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>MSTR</name>
              <description>Counter value in terms of low power clock to initialise the DSI Host IP (TINIT) that drives a stop state on the mipis D-PHY bus; DPHY Initialization period min 100 x B5s; Time out value is calculated by txclkesc and the count value is 7d0h(2000 in decimal)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MAXRETPACSZE</name>
          <description>MAXRETPACSZE register description needed here.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000087FF</resetMask>

          <fields>
            <field>
              <name>HSLP</name>
              <description>Indicates the data transfer type</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COUNTVAL</name>
              <description>Set the count value in bytes to collect the return data packet for reverse direction data flow in data lane0 in response to a DBI read operation; Count value equals the maximum size of the payload in a Long packet transmitted from peripheral back to; for DBI and DPI interleaving Min value - 1; Max value - Maximum payload for a long packet size is 1K bytes Note: DCS short Read Response or Long read response with 1 or 2 parameters is applicable in this mode; For DBI only, Min value - 1 Max value - Maximum payload for a long packet size is 1K bytes</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VIDEOMODEFMT</name>
          <description>Sets the Video mode format (packet sequence) to be supported in DSI.</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>VIDEMDFMT</name>
              <description>Sets the Video mode format (packet sequence) to be supported in DSI; in Non Burst Mode, in addition to programming this register the horizontal active area count register value should also be programmed equal to RGB word count value; in Burst Mode, in addition to programming this register the horizontal active area count register value should also be programmed greater than the RGB word count value, leaving more time during a scan line for LP mode (saving power) or for multiplexing other transmissions onto the DSI link;</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VIDEMDFMT_0</name>
                  <description>VIDEMDFMT enum description needed here.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONBURSTPULSE</name>
                  <description>Non Burst Mode with Sync Pulse</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONBURSTEVENTS</name>
                  <description>Non Burst Mode with Sync events</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <description>MODE   Burst Mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEOT</name>
          <description>The EOT clock register disables the video.</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>BTA</name>
              <description>Disable video; Set by the processor to inform the DSI controller to disable the BTA sent at the last blanking line of VFP. By default, this bit is set to 0; 0    BTA sending at the last blanking line of VFP is enabled; 1 BTA sending at the last blanking line of VFP is disabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

