AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CPUMBINTCLR</name>
          <description>CPU Mailbox Interrupt Clear</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUMBINTCLR</name>
              <description>CPU Mailbox interrupt Clear. The corresponding data bit will clear the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CPUMBINTSTAT</name>
          <description>CPU Mailbox Interrupt Status</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUMBINTSTAT</name>
              <description>CPU CPU Mailbox interrupt status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CPUCPUMBDATA</name>
          <description>CPU CPU Mailbox Data</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUCPUMBDATA</name>
              <description>CPU CPU Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0CPUMBDATA</name>
          <description>DSP0 to CPU Mailbox Data</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0CPUMBDATA</name>
              <description>DSP0 to CPU Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1CPUMBDATA</name>
          <description>DSP1 to CPU Mailbox Data</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1CPUMBDATA</name>
              <description>DSP1 to CPU Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MBINTSET</name>
          <description>DSP0 Mailbox Interrupt Set</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0MBINTSET</name>
              <description>DSP0 Mailbox interrupt Set. The corresponding data bit will set the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MBINTCLR</name>
          <description>DSP0 Mailbox Interrupt Clear</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0MBINTCLR</name>
              <description>DSP0 Mailbox interrupt Clear. The corresponding data bit will clear the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MBINTSTAT</name>
          <description>DSP 0 Mailbox Interrupt Status</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0MBINTSTAT</name>
              <description>DSP 0 CPU Mailbox interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CPUDSP0MBDATA</name>
          <description>CPU to DSP 0 Mailbox Data</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUDSP0MBDATA</name>
              <description>DSP 0 CPU Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0DSP0MBDATA</name>
          <description>DSP0 to DSP 0 Mailbox Data</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0DSP0MBDATA</name>
              <description>DSP0 to DSP 0 Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

