AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1DSP0MBDATA</name>
          <description>DSP1 to DSP 0 Mailbox Data</description>
          <addressOffset>0x000000B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1DSP0MBDATA</name>
              <description>DSP1 to DSP 0 Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MBINTSET</name>
          <description>DSP1 Mailbox Interrupt Set</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1MBINTSET</name>
              <description>DSP1 Mailbox interrupt Set. The corresponding data bit will set the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MBINTCLR</name>
          <description>DSP1 Mailbox Interrupt Clear</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1MBINTCLR</name>
              <description>DSP1 Mailbox interrupt Clear. The corresponding data bit will clear the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MBINTSTAT</name>
          <description>DSP 1 Mailbox Interrupt Status</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1MBINTSTAT</name>
              <description>DSP 1 CPU Mailbox interrupt</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CPUDSP1MBDATA</name>
          <description>CPU to DSP 1 Mailbox Data</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUDSP1MBDATA</name>
              <description>DSP 1 CPU Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0DSP1MBDATA</name>
          <description>DSP0 to DSP 1 Mailbox Data</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0DSP1MBDATA</name>
              <description>DSP0 to DSP 1 Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1DSP1MBDATA</name>
          <description>DSP1 to DSP 1 Mailbox Data</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1DSP1MBDATA</name>
              <description>DSP1 to DSP 1 Mailbox data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0CONTROL</name>
          <description>DSP 0 control settings</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <resetMask>0x7FFFFF3F</resetMask>

          <fields>
            <field>
              <name>DSP0IDMAXTRIGSRC</name>
              <description>DSP 0 IDMA Cross Trigger Source. All enabled sources are ANDed to generate a trigger enable. \n Bit30-12:IRQ18-0 Bit11: IDMATRIGPULSE, Bit10: DSP Timer1, Bit9: DSP Timer0, Bit8: alternate DSP iDMA trigger out</description>
              <bitRange>[30:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0IDMATRIG</name>
              <description>DSP 0 IDMA Trigger Control</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTRIG</name>
                  <description>Trigger is disabled until a cross trigger pulse is asserted. This will allow another source (determined by the XTRIGSRC register) to allow the DMA descriptor chain to proceed.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSTEP</name>
                  <description>Trigger is disabled until a trigger pulse (PULSE in IDMATRIG register) is asserted. This will allow a single step in the DMA descriptor chain to be enabled until next completion.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON</name>
                  <description>Trigger is always enabled. With this set, any trigger out will immediately generate a trigger in</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Trigger is disabled. This will pause the iDMA indefinitely until enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP0RUNSTALL</name>
              <description>DSP 0 RunStall. When asserted, DSP 0 will stall until bit is cleared.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

