AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0L5LVLINT</name>
          <description>DSP 0 L5 Level Interrupt Mux</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP0L5LVLINT</name>
              <description>DSP 0 L5 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0IDMATRIGCTL</name>
          <description>DSP 0 IDMA Trigger Control and Status</description>
          <addressOffset>0x00000130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>DSP0IDMATRIGPULSE</name>
              <description>DSP 0 iDMA Trigger Pulse - When written a '1', this will cause a single step enable (valid only when IDMATRIG is set to SSTEP)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0IDMATRIGSTAT</name>
              <description>DSP 0 iDMA Trigger Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK31TO0A</name>
          <description>DSP0 Interrupt OR Mask A for IRQ31-0</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0INTMCUIOORMASKA</name>
              <description>DSP0 MCU IO Interrupt OR Mask A</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK63TO32A</name>
          <description>DSP0 Interrupt OR Mask A for IRQ63-32</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0FF3FF</resetMask>

          <fields>
            <field>
              <name>DSP0GPIOORMASKA</name>
              <description>DSP0 GPIO Interrupt OR Mask A</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0PDMORMASKA</name>
              <description>DSP0 PDM Interrupt OR Mask A</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0I2SORMASKA</name>
              <description>DSP0 I2S Interrupt OR Mask A</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0TMRORMASKA</name>
              <description>DSP0 Timer Interrupt OR Mask A</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK95TO64A</name>
          <description>DSP0 Interrupt OR Mask A for IRQ95-64</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0MBINTORMASKA</name>
              <description>DSP0 Mailbox Interrupt OR Mask A</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK31to0B</name>
          <description>DSP0 Interrupt OR Mask B for IRQ31-0</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0INTMCUIOORMASKB</name>
              <description>DSP0 MCU IO Interrupt OR Mask B</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK63TO32B</name>
          <description>DSP0 Interrupt OR Mask A for IRQ63-32</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0FF3FF</resetMask>

          <fields>
            <field>
              <name>DSP0GPIOORMASKB</name>
              <description>DSP0 GPIO Interrupt OR Mask B</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0PDMORMASKB</name>
              <description>DSP0 PDM Interrupt OR Mask B</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0I2SORMASKB</name>
              <description>DSP0 I2S Interrupt OR Mask B</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

