AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DS25</name>
              <description>Drive strength selection for GPIO 25</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P1X</name>
                  <description>0.1x output driver selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P5X</name>
                  <description>0.5x output driver selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P75X</name>
                  <description>0.75x output driver selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P0X</name>
                  <description>1.0x output driver selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTCFG25</name>
              <description>Pin IO mode selection for GPIO pin 25</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Output Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUSHPULL</name>
                  <description>Output configured in push pull mode. Will drive 0 and 1 values on pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OD</name>
                  <description>Output configured in open drain mode. Will only drive pin low, tristate otherwise.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>Output configured in Tristate-able push pull mode. Will drive 0, 1 of HiZ on pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRPTEN25</name>
              <description>Interrupt enable for GPIO 25</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Interrupts are disabled for this GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTFALL</name>
                  <description>Interrupts are enabled for falling edge transition on this GPIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRISE</name>
                  <description>Interrupts are enabled for rising edge transitions on this GPIO</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTANY</name>
                  <description>Interrupts are enabled for any edge transition on this GPIO</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDZERO25</name>
              <description>Return 0 for read data on GPIO 25</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INPEN25</name>
              <description>Input enable for GPIO 25</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FNCSEL25</name>
              <description>Function select for GPIO pin 25</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2SCL</name>
                  <description>Serial I2C Master Clock output (IOM 2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2SCK</name>
                  <description>Serial SPI Master Clock output (IOM 2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED2</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General purpose I/O</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRC_EXT</name>
                  <description>External LFRC Clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_TMS</name>
                  <description>JTAG tms input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT25</name>
                  <description>Timer/Counter input or output; Selection of direction is done via CTIMER register settings.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCE25</name>
                  <description>IOMSTR/MSPI N Chip Select. Polarity is determined by CE_POLARITY field</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSBUS9</name>
                  <description>Observation bus bit 9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED9</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED10</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FPIO</name>
                  <description>Fast PIO</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED12</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED13</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED14</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCANIN8</name>
                  <description>Internal function (SCAN)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PINCFG26</name>
          <description>Controls the operation of GPIO pin 26.</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0C7FFFFF</resetMask>

          <fields>
            <field>
              <name>FOEN26</name>
              <description>Force output enable active regardless of function selected. Otherwise the selected function will enable the output only when needed</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

