AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>INPEN127</name>
              <description>Input enable for GPIO 127</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FNCSEL127</name>
              <description>Function select for GPIO pin 127</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESERVED0</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED1</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED2</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>General purpose I/O</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED4</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED5</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CT127</name>
                  <description>Timer/Counter input or output; Selection of direction is done via CTIMER register settings.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED7</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBSBUS15</name>
                  <description>Observation bus bit 15</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED9</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED10</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED11</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED12</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED13</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED14</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED15</name>
                  <description>Reserved selection.  Operation unknown if selected.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADKEY</name>
          <description>Lock state of the PINCFG and GPIO configuration registers. Write a value of 0x73 to unlock write access to the PAD and GPIO.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PADKEY</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value to unlock the register.</description>
                  <value>115</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RD0</name>
          <description>GPIO Input 0 (31-0)</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RD0</name>
              <description>GPIO31-0 Reads pin state - read only. Returns the pad pin state for pins 0-31 if the PINCFG's input enable (INPEN) is active and RDZERO is inactive.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

