AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IOM6IRQ</name>
          <description>IOM6 IRQ select for flow control.</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM6IRQ</name>
              <description>IOM6 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM7IRQ</name>
          <description>IOM7 IRQ select for flow control.</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM7IRQ</name>
              <description>IOM7 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SDIFCDWP</name>
          <description>SDIF CD and WP Select.</description>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00007F7F</resetValue>
          <resetMask>0x00007F7F</resetMask>

          <fields>
            <field>
              <name>SDIFWP</name>
              <description>SDIF WP pad select.</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIFCD</name>
              <description>SDIF CD pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OBSDATA</name>
          <description>GPIO Observation mode sample</description>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>OBSDATA</name>
              <description>Sample of the data output on the GPIO observation port. May have async sampling issues, as the data is not synronized to the read operation. Intended for debug purposes only.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS0</name>
          <description>Read only. Reflects the value of the input enable signals for pads 31-0 sent to the pad.</description>
          <addressOffset>0x0000029C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA0</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS1</name>
          <description>Read only. Reflects the value of the input enable signals for pads 63-32 sent to the pad.</description>
          <addressOffset>0x000002A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA1</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS2</name>
          <description>Read only. Reflects the value of the input enable signals for pads 95-64 sent to the pad.</description>
          <addressOffset>0x000002A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA2</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEOBS3</name>
          <description>Read only. Reflects the value of the input enable signals for pads 127-96 sent to the pad.</description>
          <addressOffset>0x000002A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IEDATA3</name>
              <description>1 indicates the input_en is active and the value of the pad will be trasmitted to the internal logic within the device.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OEOBS0</name>
          <description>Read only. Reflects the value of the output enable signals for pads 31-0 sent to the pad.</description>
          <addressOffset>0x000002AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OEDATA0</name>
              <description>The signal is negative active, and a value of 0 indicates the output_en_ is active and the MCU will be driving the pad.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

