AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MCUN0GPIO37</name>
              <description>GPIO37 MCU N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO36</name>
              <description>GPIO36 MCU N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO35</name>
              <description>GPIO35 MCU N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO34</name>
              <description>GPIO34 MCU N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO33</name>
              <description>GPIO33 MCU N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO32</name>
              <description>GPIO32 MCU N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN0INT1CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x000002D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN0GPIO63</name>
              <description>GPIO63 MCU N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO62</name>
              <description>GPIO62 MCU N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO61</name>
              <description>GPIO61 MCU N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO60</name>
              <description>GPIO60 MCU N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO59</name>
              <description>GPIO59 MCU N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO58</name>
              <description>GPIO58 MCU N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO57</name>
              <description>GPIO57 MCU N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO56</name>
              <description>GPIO56 MCU N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO55</name>
              <description>GPIO55 MCU N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO54</name>
              <description>GPIO54 MCU N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO53</name>
              <description>GPIO53 MCU N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO52</name>
              <description>GPIO52 MCU N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO51</name>
              <description>GPIO51 MCU N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO50</name>
              <description>GPIO50 MCU N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO49</name>
              <description>GPIO49 MCU N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO48</name>
              <description>GPIO48 MCU N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO47</name>
              <description>GPIO47 MCU N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO46</name>
              <description>GPIO46 MCU N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

