AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MCUN0GPIO126</name>
              <description>GPIO126 MCU N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO125</name>
              <description>GPIO125 MCU N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO124</name>
              <description>GPIO124 MCU N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO123</name>
              <description>GPIO123 MCU N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO122</name>
              <description>GPIO122 MCU N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO121</name>
              <description>GPIO121 MCU N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO120</name>
              <description>GPIO120 MCU N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO119</name>
              <description>GPIO119 MCU N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO118</name>
              <description>GPIO118 MCU N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO117</name>
              <description>GPIO117 MCU N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO116</name>
              <description>GPIO116 MCU N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO115</name>
              <description>GPIO115 MCU N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO114</name>
              <description>GPIO114 MCU N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO113</name>
              <description>GPIO113 MCU N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO112</name>
              <description>GPIO112 MCU N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO111</name>
              <description>GPIO111 MCU N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO110</name>
              <description>GPIO110 MCU N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO109</name>
              <description>GPIO109 MCU N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO108</name>
              <description>GPIO108 MCU N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO107</name>
              <description>GPIO107 MCU N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO106</name>
              <description>GPIO106 MCU N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO105</name>
              <description>GPIO105 MCU N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO104</name>
              <description>GPIO104 MCU N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO103</name>
              <description>GPIO103 MCU N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN0GPIO102</name>
              <description>GPIO102 MCU N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

