AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MCUN1GPIO36</name>
              <description>GPIO36 MCU N1-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO35</name>
              <description>GPIO35 MCU N1-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO34</name>
              <description>GPIO34 MCU N1-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO33</name>
              <description>GPIO33 MCU N1-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO32</name>
              <description>GPIO32 MCU N1-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN1INT1STAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN1GPIO63</name>
              <description>GPIO63 MCU N1-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO62</name>
              <description>GPIO62 MCU N1-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO61</name>
              <description>GPIO61 MCU N1-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO60</name>
              <description>GPIO60 MCU N1-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO59</name>
              <description>GPIO59 MCU N1-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO58</name>
              <description>GPIO58 MCU N1-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO57</name>
              <description>GPIO57 MCU N1-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO56</name>
              <description>GPIO56 MCU N1-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO55</name>
              <description>GPIO55 MCU N1-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO54</name>
              <description>GPIO54 MCU N1-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO53</name>
              <description>GPIO53 MCU N1-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO52</name>
              <description>GPIO52 MCU N1-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO51</name>
              <description>GPIO51 MCU N1-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO50</name>
              <description>GPIO50 MCU N1-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO49</name>
              <description>GPIO49 MCU N1-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO48</name>
              <description>GPIO48 MCU N1-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO47</name>
              <description>GPIO47 MCU N1-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO46</name>
              <description>GPIO46 MCU N1-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO45</name>
              <description>GPIO45 MCU N1-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

