AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP0N0GPIO46</name>
              <description>GPIO46 DSP0 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO45</name>
              <description>GPIO45 DSP0 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO44</name>
              <description>GPIO44 DSP0 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO43</name>
              <description>GPIO43 DSP0 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO42</name>
              <description>GPIO42 DSP0 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO41</name>
              <description>GPIO41 DSP0 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO40</name>
              <description>GPIO40 DSP0 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO39</name>
              <description>GPIO39 DSP0 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO38</name>
              <description>GPIO38 DSP0 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO37</name>
              <description>GPIO37 DSP0 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO36</name>
              <description>GPIO36 DSP0 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO35</name>
              <description>GPIO35 DSP0 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO34</name>
              <description>GPIO34 DSP0 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO33</name>
              <description>GPIO33 DSP0 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO32</name>
              <description>GPIO32 DSP0 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0N0INT2EN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0N0GPIO95</name>
              <description>GPIO95 DSP0 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO94</name>
              <description>GPIO94 DSP0 N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO93</name>
              <description>GPIO93 DSP0 N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO92</name>
              <description>GPIO92 DSP0 N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO91</name>
              <description>GPIO91 DSP0 N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO90</name>
              <description>GPIO90 DSP0 N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO89</name>
              <description>GPIO89 DSP0 N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO88</name>
              <description>GPIO88 DSP0 N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

