AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP0N0GPIO87</name>
              <description>GPIO87 DSP0 N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO86</name>
              <description>GPIO86 DSP0 N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO85</name>
              <description>GPIO85 DSP0 N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO84</name>
              <description>GPIO84 DSP0 N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO83</name>
              <description>GPIO83 DSP0 N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO82</name>
              <description>GPIO82 DSP0 N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO81</name>
              <description>GPIO81 DSP0 N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO80</name>
              <description>GPIO80 DSP0 N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO79</name>
              <description>GPIO79 DSP0 N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO78</name>
              <description>GPIO78 DSP0 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO77</name>
              <description>GPIO77 DSP0 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO76</name>
              <description>GPIO76 DSP0 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO75</name>
              <description>GPIO75 DSP0 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO74</name>
              <description>GPIO74 DSP0 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO73</name>
              <description>GPIO73 DSP0 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO72</name>
              <description>GPIO72 DSP0 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO71</name>
              <description>GPIO71 DSP0 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO70</name>
              <description>GPIO70 DSP0 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO69</name>
              <description>GPIO69 DSP0 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO68</name>
              <description>GPIO68 DSP0 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO67</name>
              <description>GPIO67 DSP0 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO66</name>
              <description>GPIO66 DSP0 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO65</name>
              <description>GPIO65 DSP0 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO64</name>
              <description>GPIO64 DSP0 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0N0INT3EN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0N0GPIO127</name>
              <description>GPIO127 DSP0 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

