AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP1N0GPIO55</name>
              <description>GPIO55 DSP1 N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO54</name>
              <description>GPIO54 DSP1 N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO53</name>
              <description>GPIO53 DSP1 N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO52</name>
              <description>GPIO52 DSP1 N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO51</name>
              <description>GPIO51 DSP1 N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO50</name>
              <description>GPIO50 DSP1 N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO49</name>
              <description>GPIO49 DSP1 N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO48</name>
              <description>GPIO48 DSP1 N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO47</name>
              <description>GPIO47 DSP1 N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO46</name>
              <description>GPIO46 DSP1 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO45</name>
              <description>GPIO45 DSP1 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO44</name>
              <description>GPIO44 DSP1 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO43</name>
              <description>GPIO43 DSP1 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO42</name>
              <description>GPIO42 DSP1 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO41</name>
              <description>GPIO41 DSP1 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO40</name>
              <description>GPIO40 DSP1 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO39</name>
              <description>GPIO39 DSP1 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO38</name>
              <description>GPIO38 DSP1 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO37</name>
              <description>GPIO37 DSP1 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO36</name>
              <description>GPIO36 DSP1 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO35</name>
              <description>GPIO35 DSP1 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO34</name>
              <description>GPIO34 DSP1 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO33</name>
              <description>GPIO33 DSP1 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO32</name>
              <description>GPIO32 DSP1 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1N0INT1SET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1N0GPIO63</name>
              <description>GPIO63 DSP1 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

