AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP1N0GPIO78</name>
              <description>GPIO78 DSP1 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO77</name>
              <description>GPIO77 DSP1 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO76</name>
              <description>GPIO76 DSP1 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO75</name>
              <description>GPIO75 DSP1 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO74</name>
              <description>GPIO74 DSP1 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO73</name>
              <description>GPIO73 DSP1 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO72</name>
              <description>GPIO72 DSP1 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO71</name>
              <description>GPIO71 DSP1 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO70</name>
              <description>GPIO70 DSP1 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO69</name>
              <description>GPIO69 DSP1 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO68</name>
              <description>GPIO68 DSP1 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO67</name>
              <description>GPIO67 DSP1 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO66</name>
              <description>GPIO66 DSP1 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO65</name>
              <description>GPIO65 DSP1 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO64</name>
              <description>GPIO64 DSP1 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1N0INT3EN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x000003F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1N0GPIO127</name>
              <description>GPIO127 DSP1 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO126</name>
              <description>GPIO126 DSP1 N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO125</name>
              <description>GPIO125 DSP1 N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO124</name>
              <description>GPIO124 DSP1 N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO123</name>
              <description>GPIO123 DSP1 N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO122</name>
              <description>GPIO122 DSP1 N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO121</name>
              <description>GPIO121 DSP1 N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO120</name>
              <description>GPIO120 DSP1 N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

