AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP1N1GPIO62</name>
              <description>GPIO62 DSP1 N1-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO61</name>
              <description>GPIO61 DSP1 N1-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO60</name>
              <description>GPIO60 DSP1 N1-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO59</name>
              <description>GPIO59 DSP1 N1-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO58</name>
              <description>GPIO58 DSP1 N1-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO57</name>
              <description>GPIO57 DSP1 N1-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO56</name>
              <description>GPIO56 DSP1 N1-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO55</name>
              <description>GPIO55 DSP1 N1-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO54</name>
              <description>GPIO54 DSP1 N1-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO53</name>
              <description>GPIO53 DSP1 N1-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO52</name>
              <description>GPIO52 DSP1 N1-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO51</name>
              <description>GPIO51 DSP1 N1-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO50</name>
              <description>GPIO50 DSP1 N1-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO49</name>
              <description>GPIO49 DSP1 N1-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO48</name>
              <description>GPIO48 DSP1 N1-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO47</name>
              <description>GPIO47 DSP1 N1-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO46</name>
              <description>GPIO46 DSP1 N1-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO45</name>
              <description>GPIO45 DSP1 N1-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO44</name>
              <description>GPIO44 DSP1 N1-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO43</name>
              <description>GPIO43 DSP1 N1-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO42</name>
              <description>GPIO42 DSP1 N1-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO41</name>
              <description>GPIO41 DSP1 N1-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO40</name>
              <description>GPIO40 DSP1 N1-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO39</name>
              <description>GPIO39 DSP1 N1-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO38</name>
              <description>GPIO38 DSP1 N1-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

