AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP1N1GPIO94</name>
              <description>GPIO94 DSP1 N1-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO93</name>
              <description>GPIO93 DSP1 N1-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO92</name>
              <description>GPIO92 DSP1 N1-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO91</name>
              <description>GPIO91 DSP1 N1-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO90</name>
              <description>GPIO90 DSP1 N1-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO89</name>
              <description>GPIO89 DSP1 N1-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO88</name>
              <description>GPIO88 DSP1 N1-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO87</name>
              <description>GPIO87 DSP1 N1-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO86</name>
              <description>GPIO86 DSP1 N1-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO85</name>
              <description>GPIO85 DSP1 N1-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO84</name>
              <description>GPIO84 DSP1 N1-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO83</name>
              <description>GPIO83 DSP1 N1-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO82</name>
              <description>GPIO82 DSP1 N1-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO81</name>
              <description>GPIO81 DSP1 N1-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO80</name>
              <description>GPIO80 DSP1 N1-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO79</name>
              <description>GPIO79 DSP1 N1-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO78</name>
              <description>GPIO78 DSP1 N1-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO77</name>
              <description>GPIO77 DSP1 N1-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO76</name>
              <description>GPIO76 DSP1 N1-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO75</name>
              <description>GPIO75 DSP1 N1-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO74</name>
              <description>GPIO74 DSP1 N1-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO73</name>
              <description>GPIO73 DSP1 N1-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO72</name>
              <description>GPIO72 DSP1 N1-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO71</name>
              <description>GPIO71 DSP1 N1-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO70</name>
              <description>GPIO70 DSP1 N1-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

