AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP1N1GPIO78</name>
              <description>GPIO78 DSP1 N1-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO77</name>
              <description>GPIO77 DSP1 N1-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO76</name>
              <description>GPIO76 DSP1 N1-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO75</name>
              <description>GPIO75 DSP1 N1-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO74</name>
              <description>GPIO74 DSP1 N1-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO73</name>
              <description>GPIO73 DSP1 N1-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO72</name>
              <description>GPIO72 DSP1 N1-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO71</name>
              <description>GPIO71 DSP1 N1-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO70</name>
              <description>GPIO70 DSP1 N1-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO69</name>
              <description>GPIO69 DSP1 N1-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO68</name>
              <description>GPIO68 DSP1 N1-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO67</name>
              <description>GPIO67 DSP1 N1-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO66</name>
              <description>GPIO66 DSP1 N1-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO65</name>
              <description>GPIO65 DSP1 N1-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO64</name>
              <description>GPIO64 DSP1 N1-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1N1INT2SET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1N1GPIO95</name>
              <description>GPIO95 DSP1 N1-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO94</name>
              <description>GPIO94 DSP1 N1-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO93</name>
              <description>GPIO93 DSP1 N1-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO92</name>
              <description>GPIO92 DSP1 N1-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO91</name>
              <description>GPIO91 DSP1 N1-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO90</name>
              <description>GPIO90 DSP1 N1-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO89</name>
              <description>GPIO89 DSP1 N1-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N1GPIO88</name>
              <description>GPIO88 DSP1 N1-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

