AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>CLPBSY</name>
              <description>command list processor busy</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RASTBSY</name>
              <description>rasterizer busy</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DEPTHFIFOBSY</name>
              <description>depth buffer busy (Cores 3-0)</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RENDERBSY</name>
              <description>render output unit busy (Cores 3-0)</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TEXTMAPBSY</name>
              <description>texture map busy (Cores 3-0)</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIPEBSY</name>
              <description>pipeline busy (Cores 3-0)</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREBSY</name>
              <description>processing core busy (Cores 3-0)</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BUSCTRL</name>
          <description>Bus Control</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BUSCTRL</name>
              <description>Bus Control</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMEMLDIADDR</name>
          <description>Load shader instruction memory address.</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IMEM</name>
              <description>ADDR Load shader.  Load shader instruction memory address.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMEMLDIDATAHL</name>
          <description>Load shader instruction Memory data (31:0).</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IMEM</name>
              <description>DATA Load shader.  Load shader instruction Memory data (31:0).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IMEMLDIDATAHH</name>
          <description>Load shader instruction Memory data (63:32).</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>IMEM</name>
              <description>DATA Load shader.  Load shader instruction Memory data (63:32).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDLISTSTATUS</name>
          <description>On read, returns command list processor status; On write, resets command list processor.</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LIST</name>
              <description>processor status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDLISTRINGSTOP</name>
          <description>Updates GPU command list pointer to stop executing.</description>
          <addressOffset>0x000000EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>UPDATEPRT</name>
              <description>Updates GPU command list pointer to stop executing.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDLISTADDR</name>
          <description>Command list base pointer.</description>
          <addressOffset>0x000000F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BASEPTR</name>
              <description>Command list base pointer.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

