AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CMDLISTSIZE</name>
          <description>Command list length in words.</description>
          <addressOffset>0x000000F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LISTWORDS</name>
              <description>Command list length in words.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPTCTRL</name>
          <description>On write, clears the IRQ (CHECK address!).</description>
          <addressOffset>0x000000F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC000000F</resetMask>

          <fields>
            <field>
              <name>CHANGEFREQ</name>
              <description>change  frequency  of  asynchronous clock</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[29:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUTOCLR</name>
              <description>if set, auto clears interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTDRAWEND</name>
              <description>if set, signals interrupt at the end of drawing command</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTCMDEND</name>
              <description>if set, signals interrupt at the end of command list</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IRQACTIVE</name>
              <description>if set to zero IRQ is active high, if set to one IRQ is active low</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLEAR</name>
          <description>On write, resets the GPU (CHECK address!).</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RESETGPU</name>
              <description>On write, resets the GPU (CHECK address!).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DRAWCMD</name>
          <description>Rasterizer drawing command.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>RSVD</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[31:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>START</name>
              <description>Start the draw command</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIXEL</name>
                  <description>draw pixel using STARTXY</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINE</name>
                  <description>draw line from STARTXY to ENDXY</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECT</name>
                  <description>fill rectangle  from  STARTXY  to ENDXY</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRI</name>
                  <description>draw triangle (if enabled)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD</name>
                  <description>draw quadrilateral (if enabled)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAWPT0</name>
          <description>Stores only integer values. For greater accurancy DRAWPT0X and DRAWPT0Y registers are used which are 16, 16 fixed point.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>COORDY</name>
              <description>vertex 0 Y coordinate (integer value)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COORDX</name>
              <description>vertex 0 X coordinate (integer value)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

