AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>SSZ2</name>
              <description>Receive audio sample length for phase 2.  0: 8b, 2: 16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8b</name>
                  <description>Receive audio sample length is 8 bits for phase 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16b</name>
                  <description>Receive audio sample length is 16 bits for phase 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24b</name>
                  <description>Receive audio sample length is 24 bits for phase 2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32b</name>
                  <description>Receive audio sample length is 32 bits for phase 2.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRLEN1</name>
              <description>Number of channels in phase 1;  0: 1 Channel in phase 2, .. 0x7: 8 channels in phase 1</description>
              <bitRange>[14:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1CHLS</name>
                  <description>One channel in phase 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CHLS</name>
                  <description>Two channels in phase 1.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CHLS</name>
                  <description>Three channels in phase 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CHLS</name>
                  <description>Four channels in phase 1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5CHLS</name>
                  <description>Five channels in phase 1.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CHLS</name>
                  <description>Six channels in phase 1.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7CHLS</name>
                  <description>Seven channels in phase 1.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CHLS</name>
                  <description>Eight channels in phase 1.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDLEN1</name>
              <description>Receive channel length in bits for phase 1. 0: 8b, 2: 16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8b</name>
                  <description>Receive channel length is 8 bits for phase 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16b</name>
                  <description>Receive channel length is 16 bits for phase 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24b</name>
                  <description>Receive channel length is 24 bits for phase 1.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32b</name>
                  <description>Receive channel length is 32 bits for phase 1.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JUST</name>
              <description>Audio sample justification.  0: Left-justified, 1: Right-justified</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSZ1</name>
              <description>Receive audio sample length for phase 1.  0: 8b, 2: 16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8b</name>
                  <description>Receive audio sample length is 8 bits for phase 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16b</name>
                  <description>Receive audio sample length is 16 bits for phase 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24b</name>
                  <description>Receive audio sample length is 24 bits for phase 1.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32b</name>
                  <description>Receive audio sample length is 32 bits for phase 1.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SIOCFG</name>
          <description>Specified polarity and clock configuration of the I2S IPB clocks and IO signals</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01F103F0</resetValue>
          <resetMask>0x0FFFFFF1</resetMask>

          <fields>
            <field>
              <name>FWID</name>
              <description>period of fsync/lr_clk in units of sclks</description>
              <bitRange>[27:20]</bitRange>
              <access>read-write</access>

