AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PRx</name>
              <description>Receive clock edge polarity bit. 0: sdata is sampled on the rising edge of sclk.  1: sdata is sampled on the falling edge of sclk.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MSL</name>
              <description>Master/Slave clock configuration.  0: External clock(sclk and lr_clk provided externally).  1: Internal clock (sclk and lr_clk sourced internally).</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRTX</name>
              <description>Transmit clock edge polarity bit. 0: sdata is transmitted starting from the falling edge of sclk.  1: sdata is transmitted starting from the rising edge of sclk.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSP</name>
              <description>Polarity of fsync/lr_clk signal.  0: Active high.   1: Active low</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FPER</name>
              <description>Frame period in units of sclk. Period is FPER + 1 sclks in length.  0: 1 sclk, 0x3F: 64 sclks</description>
              <bitRange>[15:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OEN</name>
              <description>Output enable for SDATA output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>I2SCTL</name>
          <description>Specified polarity and clock configuration of the I2S IPB clocks and IO signals</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000033</resetMask>

          <fields>
            <field>
              <name>I2SVAL</name>
              <description>I2S validity bit mode.  1: RX data stored only when validity mask condition is asserted. 0: No validity mask conditions checking is done.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXRST</name>
              <description>Active high receiver reset signal. 1: Flush the RX FIFO</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXEN</name>
              <description>Receive enable control.  1: Enables capture of serial audio, starting with first channel.  0: No receive data captured. For Full duplex operation, RXEN and TXEN MUST be set in a single register write access, or the Slave FSM may ignore one of the bit-field read-modify-write accesses. TXRST and RXRST must be cleared in advance.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRST</name>
              <description>Transmit reset signal.  1 will reset the TX side registers and flush the TX FIFO.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXEN</name>
              <description>Transmit enable signal.  1 will enable the transmission of serial audio. For Full duplex operation, RXEN and TXEN MUST be set in a single register write access, or the Slave FSM may ignore one of the bit-field read-modify-write accesses. TXRST and RXRST must be cleared in advance.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IPBIRPT</name>
          <description>Additional mask and status registers for the IPB core.</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F003F</resetMask>

          <fields>
            <field>
              <name>TXDMAI</name>
              <description>TX dma interrupt</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDMAI</name>
              <description>RX dma interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXEI</name>
              <description>TX Empty interrupt. TX unit attempted to read an empty FIFO</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFI</name>
              <description>RX Full interrupt.  RX unit attempted to write to a full FIFO</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFFI</name>
              <description>Transmit fifo low limit interrupt</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFFI</name>
              <description>Receive fifo high limit interrupt</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMAM</name>
              <description>Transmit FIFO interrupt mask. Will assert interrupt when = 1 and cimdmareq_tx is asserted</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

