AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MCLKEN</name>
              <description>Enable for the master audio clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>Configuration control of the DMA process, including the direction of DMA, and enablement of DMA</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFF33</resetMask>

          <fields>
            <field>
              <name>RXREQCNT</name>
              <description>Number of blocks of samples transferred before asserting the RXREQCNT interrupt signal. A block is 8 samples. The interrupt will assert if enabled and after RXREQCNT blocks of data has been transferred from the I2S into the device. A value of 0 will cause the assertion of the interrupt for every block of transfer done.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXREQCNT</name>
              <description>Number of blocks of samples transferred before asserting the TXREQCNT interrupt signal. A block is 8 samples. The interrupt will assert if enabled and after TXREQCNT blocks of data has been transferred to the I2S module from the device. A value of 0 will cause the assertion of the interrupt for every block of transfer done.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDMAPRI</name>
              <description>Sets the Priority of the TXDMA request</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXDMAEN</name>
              <description>DMA Enable for TX channel. Setting this bit to EN will start the DMA operation. This should be the last DMA related register set prior to issuing the command</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TXDMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable TXDMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMAPRI</name>
              <description>Sets the Priority of the RXDMA request</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDMAEN</name>
              <description>DMA Enable for RX channel. Setting this bit to EN will start the DMA operation. This should be the last DMA related register set prior to issuing the command</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable RXDMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable RXDMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDMATOTCNT</name>
          <description>Contains the total count of samples to be stored for the current RX DMA operation. This register is updated as DMA beats complete.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>RXTOTCNT</name>
              <description>Number of 32b audio samples to transfer for RX DMA.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXDMAADDR</name>
          <description>The address which the DMA operation will store the incoming audio samples. This address is updated as the samples are stored.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RXTARGADDR</name>
              <description>Address bits of the target byte address for source of RX write DMA.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

