AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SUBMODCTRL</name>
          <description>Provides enable for each submodule. Only a sigle submodule can be enabled at one time.</description>
          <addressOffset>0x0000011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000820</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>SMOD2TYPE</name>
              <description>Submodule 2 module type. This is the I2S Master/Slave interface</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>SPI Master submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MI2C</name>
                  <description>MI2C submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPI</name>
                  <description>SPI Slave submodule</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SI2C</name>
                  <description>I2C Slave submodule</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI2S</name>
                  <description>Master/Slave submodule</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD2EN</name>
              <description>Submodule 2 enable (1) or disable (0)</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SMOD1TYPE</name>
              <description>Submodule 1 module type. This is the I2C Master interface</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>SPI Master submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MI2C</name>
                  <description>MI2C submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSPI</name>
                  <description>SPI Slave submodule</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SI2C</name>
                  <description>I2C Slave submodule</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI2S</name>
                  <description>Master/Slave submodule</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD1EN</name>
              <description>Submodule 1 enable (1) or disable (0)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SMOD0TYPE</name>
              <description>Submodule 0 module type. This is the SPI Master interface.</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSPI</name>
                  <description>MSPI submodule</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MI2C</name>
                  <description>I2C Master submodule</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSI2S</name>
                  <description>I2S Master/Slave Module</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NA</name>
                  <description>NOT INSTALLED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOD0EN</name>
              <description>Submodule 0 enable (1) or disable (0)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>Writes to this register will start an IO transaction, as well as set various parameters for the command itself. Reads will return the command value written to the CMD register.
To read the number of bytes that have yet to be transferred, refer to the CTSIZE field within the CMDSTAT register.</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF3FFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETLO</name>
              <description>This register holds the low order byte of offset to be used in the transaction. The number of offset bytes to use is set with bits 1:0 of the command.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

