AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>TVRGPWD</name>
              <description>Power Down, Calibrated Voltage Reference Generator.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Powers down the CVRG.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_UP</name>
                  <description>Power up the CVRG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TVRGTEMPCOTRIM</name>
              <description>Calibrated Voltage Reference Generator tc trim (bottom transistor)</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL</name>
          <description>Overrides for Voltage Regulators Controls</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKACTIVE</name>
              <description>SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKRSTB</name>
              <description>SIMO BUCK RSTB control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKPDNB</name>
              <description>SIMO BUCK PDNB control. Override for PWRCTRL going to analog when SIMOBUCKOVER = 1</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SIMOBUCKOVER</name>
              <description>Override control for SIMO BUCK signals</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOACTIVE</name>
              <description>ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog when ANALDOOVER = 1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOPDNB</name>
              <description>ANALDO PDNB control. Override for PWRCTRL going to analog when ANALDOOVER = 1</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ANALDOOVER</name>
              <description>Override control for ANALDO signals</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOACTIVE</name>
              <description>MEM LP LDO ACTVIVE control. Override for PWRCTRL going to analog when MEMLPLDOOVER = 1</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOPDNB</name>
              <description>MEM LP LDO PDNB control. Override for PWRCTRL going to analog when MEMLPLDOOVER = 1</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOOVER</name>
              <description>Override control for MEM LP LDO signals</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOCOLDSTARTEN</name>
              <description>MEM LDO COLDSTART EN control. This is a shadow backed register and no need to set MEMLDOOVER.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVE</name>
              <description>MEM LDO ACTIVE control. Override for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVEEARLY</name>
              <description>MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOPDNB</name>
              <description>MEM LDO PDNB control. Override signal for PWRCTRL going to analog when MEMLDOOVER = 1</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOOVER</name>
              <description>Override control for MEM LDO signals</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOCOLDSTARTEN</name>
              <description>CORE LDO COLDSTART EN control. This is a shadow backed register and no need to set CORELDOOVER.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOACTIVE</name>
              <description>CORE LDO ACTIVE control. Override for PWRCTRL going to analog when CORELDOOVER = 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

