AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>XTALHSRSTRIM</name>
              <description>xtalhs_rs_trim</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASTRIM</name>
              <description>xtalhs_ibias_trim</description>
              <bitRange>[27:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASCOMPTRIM</name>
              <description>xtalhs_ibias_comp_trim</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBIASCOMP2TRIM</name>
              <description>xtalhs_ibias_comp2_trim</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSDRIVERSTRENGTH</name>
              <description>xtalhs_driver_strength</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSDRIVETRIM</name>
              <description>xtalhs_drive_trim</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCAPTRIM</name>
              <description>xtalhs_cap_trim</description>
              <bitRange>[9:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCAP2TRIM</name>
              <description>xtalhs_cap2_trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>XTALHSCTRL</name>
          <description>XTALHS Control</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>XTALHSEXTERNALCLOCK</name>
              <description>xtalhs_external_clock</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPADOUTEN</name>
              <description>xtalhs_padout_en</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSSELRCOM</name>
              <description>xtalhs_sel_rcom</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPDNPNIMPROVE</name>
              <description>xtalhs_pdn_pn_improve</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSINJECTIONENABLE</name>
              <description>xtalhs_injection_enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSIBSTENABLE</name>
              <description>xtalhs_ibst_enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCOMPSEL</name>
              <description>xtalhs_comp_sel</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSCOMPPDNB</name>
              <description>xtalhs_comp_pdnb</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XTALHSPDNB</name>
              <description>xtalhs_pdnb</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MRAMPWRCTRL</name>
          <description>MRAM Power Control</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MRAMPWRCTRL</name>
              <description>MRAM low power mode control. When set to 1, tmc_lpr and tmc_slp are driven by the value of MRAMLPREN and MRAMSLPEN of this register.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAMSLPEN</name>
              <description>MRAM sleep mode enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MRAMLPREN</name>
              <description>MRAM low power mode enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BODISABLE</name>
          <description>Brownout Disable</description>
          <addressOffset>0x000001AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODCLVREN</name>
              <description>Disable VDDC_LV Brown Out reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDC_LV Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDC_LV Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODSREN</name>
              <description>Disable VDDS Brown Out reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDS Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDS Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODFREN</name>
              <description>Disable VDDF Brown Out reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDF Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDF Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODCREN</name>
              <description>Disable VDDC Brown Out reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable VDDC Brown Out reset.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable VDDC Brown Out reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODLRDE</name>
              <description>Disable Unregulated 1.8V Brown-out reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Unregulated 1.8v brown out reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable Unregulated 1.8v brown out reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D2ASPARE</name>
          <description>Spare registers to analog module</description>
          <addressOffset>0x000001B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000018</resetMask>

          <fields>
            <field>
              <name>VDDCAOROVERRIDE</name>
              <description>VDDCAOR Override. Set to 1 to connect to the VDDC rail, set to 0 to connect to the VDDC_LV rail. Before setting this bit to 0, the VDDC_LV rail must first be enabled by setting SIMOBUCK0_b.VDDCLVRXCOMPEN. Do not modify this field unless directed to do so by Ambiq engineering. If modifying, a RMW operation such as MCUCTRL->D2ASPARE_b.VDDCAOROVERRIDE=1 must be used.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

