AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>VDDCPUOVERRIDE</name>
              <description>VDDCPU Override. Set to 1 to connect to the VDDC rail, set to 0 to connect to the VDDC_LV rail. Before setting this bit to 0, the VDDC_LV rail must first be enabled by setting SIMOBUCK0_b.VDDCLVRXCOMPEN. Do not modify this field unless directed to do so by Ambiq engineering. If modifying, a RMW operation such as MCUCTRL->D2ASPARE_b.VDDCPUOVERRIDE=1 must be used.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BOOTLOADER</name>
          <description>Bootloader and secure boot functions</description>
          <addressOffset>0x000001B8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFC00000F</resetMask>

          <fields>
            <field>
              <name>SECBOOTONRST</name>
              <description>Indicates whether the secure boot on warm reset is enabled</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOT</name>
              <description>Indicates whether the secure boot on cold reset is enabled</description>
              <bitRange>[29:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOTFEATURE</name>
              <description>Indicates whether the secure boot feature is enabled.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure boot disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure boot enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error in secure boot configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBLLOCK</name>
              <description>Secure boot loader lock. Always resets to 1, write 1 to clear. Enables system visibility to bootloader until set.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Disable the secure boot lock</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROTLOCK</name>
              <description>This field controls access to OEM keybank and restricts further application of NVM protections via the FLASHWPROTn and FLASHRPROTn registers. On read, 0 indicates locked, 1 indicates unlocked. Write 1 to clear (lock) the register. Default value of the hardware is 1 (unlocked), but the default value is also affected by INFOC_SECURITY->PLONEXIT. If PLONEXIT is set, PROTLOCK is asserted by SBL and the OEM application will see the value as 0 (locked).</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>On write, this value asserts the lock. On read, see above description.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>On write, this value (writing 0) has no effect. On read, see above description.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBRLOCK</name>
              <description>Secure boot ROM lock. Always resets to 1, write 1 to clear. Enables system visibility to bootloader until set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK</name>
                  <description>Enable the secure boot lock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOTLOADERLOW</name>
              <description>Determines whether the bootloader code is visible at address 0x00000000 or not. Resets to 1, write 1 to clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR0</name>
                  <description>Bootloader code at 0x00000000.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOADDR0</name>
                  <description>Bootloader code is not visible at address</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SHADOWVALID</name>
          <description>Register to indicate whether the shadow registers have been successfully loaded from the Flash Information Space.</description>
          <addressOffset>0x000001BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>INFO0VALID</name>
              <description>Indicates whether info0 contains valid data</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash info0 (customer) space contains valid data.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLDSLEEP</name>
              <description>Indicates whether the bootloader should sleep or deep sleep if no image loaded.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEEPSLEEP</name>
                  <description>Bootloader will go to deep sleep if no flash image loaded</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLEEP</name>
                  <description>Bootloader will go to normalsleep if no flash image loaded</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Indicates whether the shadow registers contain valid data from the Flash Information Space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Flash information space contains valid data.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRATCH0</name>
          <description>Scratch register that is not reset by any reset</description>
          <addressOffset>0x000001C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SCRATCH0</name>
              <description>Scratch register 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

