AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK1</name>
          <description>1. Control the even division of 3 clocks: refresh, low power and TONCLK. 2. Control gap bewteen secondary switches. 3. Debug features: control the amount of time TONCLK is on, and the time before snubber asserts for each buck sequence. 4. Enable or disable the observation bus. 5. Select the buck sequence operation mode. 6. Control delay between primary Pmos and Nmos transitions.</description>
          <addressOffset>0x00000340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00400000</resetValue>
          <resetMask>0x03C007C0</resetMask>

          <fields>
            <field>
              <name>TONCLKTRIM</name>
              <description>This divides the 100 MHz ton clock. Even divides are supported only. This value represents the division amount minus 1.</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCLKACTTRIM</name>
              <description>This divides the 5 MHz refresh clock. Even divides are supported only. This value represents the division amount minus 1.</description>
              <bitRange>[10:6]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK2</name>
          <description>SIMO Buck Muxed VDDC Active Sequence Trim Control</description>
          <addressOffset>0x00000344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F007800</resetMask>

          <fields>
            <field>
              <name>VDDCACTLOWTONTRIM</name>
              <description>VDDC active high ton trim control for Buck sequence.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCACTHIGHTONTRIM</name>
              <description>VDDC active high ton trim control for Buck sequence.</description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK3</name>
          <description>SIMO Buck Muxed VDDC low power Sequence Trim Control</description>
          <addressOffset>0x00000348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3C01E000</resetMask>

          <fields>
            <field>
              <name>VDDCLPLOWTONTRIM</name>
              <description>VDDC LP low ton trim control for Buck sequence.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDCLPHIGHTONTRIM</name>
              <description>VDDC LP high ton trim control for Buck sequence.</description>
              <bitRange>[16:13]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK6</name>
          <description>SIMO Buck Muxed VDDF Active Sequence Trim Control</description>
          <addressOffset>0x00000354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001E0000</resetMask>

          <fields>
            <field>
              <name>VDDFACTHIGHTONTRIM</name>
              <description>VDDF active high ton trim control for Buck sequence.</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK7</name>
          <description>SIMO Buck Muxed VDDF active Sequence Trim Control</description>
          <addressOffset>0x00000358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007C1F00</resetMask>

          <fields>
            <field>
              <name>ZXCOMPZXTRIM</name>
              <description>Zxcomp trim. Feedthrough to analog.</description>
              <bitRange>[22:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFACTLOWTONTRIM</name>
              <description>VDDF active low ton trim control for Buck sequence.</description>
              <bitRange>[12:8]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK8</name>
          <description>SIMO Buck Muxed VDDF Low Power Sequence Trim Control</description>
          <addressOffset>0x0000035C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03C01E00</resetMask>

          <fields>
            <field>
              <name>VDDFLPLOWTONTRIM</name>
              <description>VDDF low power low ton trim control for Buck sequence.</description>
              <bitRange>[25:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDFLPHIGHTONTRIM</name>
              <description>VDDF low power high ton trim control for Buck sequence.</description>
              <bitRange>[12:9]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK9</name>
          <description>SIMO Buck Muxed VDDS Active Sequence Trim Control</description>
          <addressOffset>0x00000360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07DE0000</resetMask>

          <fields>
            <field>
              <name>VDDSACTLOWTONTRIM</name>
              <description>VDDS active low ton trim control for Buck sequence.</description>
              <bitRange>[26:22]</bitRange>
              <access>read-write</access>

