AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>VDDSACTHIGHTONTRIM</name>
              <description>VDDS active high ton trim control for Buck sequence.</description>
              <bitRange>[20:17]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK12</name>
          <description>SIMO Buck Compare, Brown out, Active, Low power Trim Control</description>
          <addressOffset>0x0000036C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF00000</resetMask>

          <fields>
            <field>
              <name>LPTRIMVDDF</name>
              <description>Low power VDDF trim.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTTRIMVDDF</name>
              <description>Active VDDF trim.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK13</name>
          <description>SIMO Buck Compare, Brown out, Active, Low power Trim Control</description>
          <addressOffset>0x00000370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFF00000</resetMask>

          <fields>
            <field>
              <name>LPTRIMVDDS</name>
              <description>Low power VDDS trim.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTTRIMVDDS</name>
              <description>Active VDDS trim.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SIMOBUCK15</name>
          <description>SIMO Buck Compare, Brown out, Active and Low power Trim Control</description>
          <addressOffset>0x00000378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x9F000000</resetMask>

          <fields>
            <field>
              <name>TRIMLATCHOVER</name>
              <description>Override / Bypass the simobuck trim latch to enable on-the-fly trimming for VDDF and VDDS active and LP trims</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ZXCOMPOFFSETTRIM</name>
              <description>Zxcomp offset trim. Feedthrough to analog.</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRSW0</name>
          <description>PWRSW Control 0</description>
          <addressOffset>0x0000037C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PWRSWVDDRCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddrcpu_dynsel and pgn</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRCPUSTATSEL</name>
              <description>VDDRCPU power switch static select</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRCPUPGN</name>
              <description>override value for pwrsw_vddrcpu_pgn</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRCPUDYNSEL</name>
              <description>override value for pwrsw_vddrcpu_dynsel</description>
              <bitRange>[28:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMLOVERRIDE</name>
              <description>override enable for pwrsw_vddml_dynsel</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMLSTATSEL</name>
              <description>VDDML power switch static select</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMLDYNSEL</name>
              <description>override value for pwrsw_vddml_dynsel</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

