AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PWRSWVDDCPUPGN</name>
              <description>override value for pwrsw_vddcpu_pgn</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCPUDYNSEL</name>
              <description>override value for pwrsw_vddcpu_dynsel</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRSW1</name>
          <description>PWRSW Control 1</description>
          <addressOffset>0x00000380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SHORTVDDFVDDSORVAL</name>
              <description>pwrsw short override value for vddf/vdds</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDFVDDSOREN</name>
              <description>pwrsw short override select for vddf/vdds</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDCVDDCLVORVAL</name>
              <description>pwrsw short override value for vddc/vddclv</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SHORTVDDCVDDCLVOREN</name>
              <description>pwrsw short override select for vddc/vddclv</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEVDDRMOFF</name>
              <description>Setting this bit forces VDDRM to be open when Flash is off. This is valid for only normal operational mode (i.e. without overrides).</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEVDDRMVDDS</name>
              <description>Setting this bit selects VDDS for VDDRM when Flash is off. This is valid for only normal operational mode (i.e. without overrides).</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USEVDDF4VDDRCPUINHP</name>
              <description>Setting this bit selects VDDF for VDDRCPU in when MCU is in HP mode. This is valid for only normal operational mode (i.e without overrides).</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIGPWRSWOVRDRVSEL</name>
              <description>digpwrsw_ovrdrv_sel</description>
              <bitRange>[24:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIGPWRSWOVRDRVEN</name>
              <description>digpwrsw_ovrdrv_en</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWOVRDRVEN</name>
              <description>pwrsw_ovrdrv_en</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWCOMPPDNB</name>
              <description>pwrsw_comp_pdnb</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDLOVERRIDE</name>
              <description>override enable for pwrsw_vddl_pgn</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDLPGN</name>
              <description>override value for pwrsw_vddl_pgn</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMOVERRIDE</name>
              <description>override enable for pwrsw_vddrm_dynsel and pgn</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMSTATSEL</name>
              <description>VDDRM power switch static select</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRMPGN</name>
              <description>override value for pwrsw_vddrm_pgn</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRMDYNSEL</name>
              <description>override value for pwrsw_vddrm_dynsel</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRLOVERRIDE</name>
              <description>override enable for pwrsw_vddrl_dynsel and pgn</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

