AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMWPROT0</name>
          <description>These bits write-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMAWPROT0</name>
              <description>Write protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA writes, when set to 0, DMA may write the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMWPROT1</name>
          <description>These bits write-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMAWPROT1</name>
              <description>Write protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA writes, when set to 0, DMA may write the region.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMRPROT0</name>
          <description>These bits read-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DMARPROT0</name>
              <description>Read protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASRAMRPROT1</name>
          <description>These bits read-protect system SRAM from DMA operations in 8KB chunks.</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMARPROT1</name>
              <description>Read protect SRAM from DMA. Each bit provides write protection for an 8KB region of memory. When set to 1, the region will be protected from DMA reads, when set to 0, DMA may read the region.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>USBPHYRESET</name>
          <description>DSP0 CACHE RAM TRIM</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1BFC19FC</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>

          <fields>
            <field>
              <name>RESERVED18</name>
              <description>Self-timed override (test mode only)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED17</name>
              <description>DSP0 ICACHE DATA WABLM - 00=No adjust 11=increased delay, enabled by WABL</description>
              <bitRange>[30:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED16</name>
              <description>DSP0 ICACHE DATA RAM WABL - Write Assist Enable (active high)</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED15</name>
              <description>DSP0 ICACHE DATA RAWLM</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED14</name>
              <description>DSP0 ICACHE DATA RAWL</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED13</name>
              <description>DSP0 ICACHE DATA EMAW</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED12</name>
              <description>DSP0 ICACHE DATA EMAS</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED11</name>
              <description>DSP0 ICACHE DATA EMA</description>
              <bitRange>[20:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED10</name>
              <description>Override for DSP0 ICACHE DATA RET1N override enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED09</name>
              <description>DSP0 ICACHE DATA RET1N value</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

