AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MICBIASVOLTAGETRIM</name>
              <description>Output voltage trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGAADCIFCTRL</name>
          <description>PGA ADCIF control</description>
          <addressOffset>0x00000438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000070FF</resetMask>

          <fields>
            <field>
              <name>PGAADCIFVCOMPSEL</name>
              <description>Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)</description>
              <bitRange>[14:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFVCOMPEN</name>
              <description>Enable for VCOMP output</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHBPDNB</name>
              <description>Power down for channels B0 and B1 (0 = powered down; 1 = standby)</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHBACTIVE</name>
              <description>PGAADCIF active signal for channels B0 and B1. Starts and stops 2 clocks after demultiplexed SOC signal.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHAPDNB</name>
              <description>Power down for channels A0 and A1 (0 = powered down; 1 = standby)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAADCIFCHAACTIVE</name>
              <description>PGAADCIF active signal for channels A0 and A1. Starts and stops 2 clocks after demultiplexed SOC signal.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL1</name>
          <description>PGA control 1</description>
          <addressOffset>0x0000043C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xBFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PGAGAINAOVRD</name>
              <description>Apply BYPASS and GAIN bits from this register (for channel A) instead of automatically via audio ADC.  Note that audio ADC FIFO meta data will not reflect dB gain as used when configuring audio ADC.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VCOMPSELPGA</name>
              <description>Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAVREFGENQUICKSTARTEN</name>
              <description>VREFGEN quick start enable (pulsed during startup)</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAVREFGENPDNB</name>
              <description>VREFGEN power down (0: powered down, 1: powered up)</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGAIREFGENPDNB</name>
              <description>IREFGEN power down (0: powered down, 1: powered up)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAVCMGENQCHARGEEN</name>
              <description>Channel A VCMGEN quick charge enable (pulsed during channel powerup)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAVCMGENPDNB</name>
              <description>Channel A VCMGEN power down  (0: powered down, 1: powered up)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAOPAMPOUTPDNB</name>
              <description>Channels A0 and A1 output stage opamp power down (0: powered down, 1: powered up)</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHAOPAMPINPDNB</name>
              <description>Channels A0 and A1 input stage opamp power down (0: powered down, 1: powered up). Must be 1 when respective PGACHABYPASSEN = 0.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHABYPASSEN</name>
              <description>Bypass enable for Channels A0 and A1 (1: bypass, when gain LT 12 dB; 0: otherwise)</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA1GAIN2SEL</name>
              <description>Channel A1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA1GAIN2DIV2SEL</name>
              <description>Channel A1 PGA divide by two select (0: 0 dB, 1: -6dB), needed for fully differential inputs</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

