AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SDIOCTRL</name>
          <description>SDIO/eMMC Control</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001080</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>SDIODATOPENDRAINEN</name>
              <description>SDIO DAT line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOCMDOPENDRAINEN</name>
              <description>SDIO CMD line configured as open-drian. 0: Push-pull mode, 1: Open-drain mode</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOXINCLKSEL</name>
              <description>Select clock source for SDIO xin_clk.</description>
              <bitRange>[16:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOASYNCWKUPENA</name>
              <description>SDIO asynchronous wakeup mode. 0: Synchronous wakeup mode, 1: Asynchronous wakeup mode</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOOTAPDLYSEL</name>
              <description>Selects one of the 16 Taps on the sdcard_clk. This is effective only when otapdlyena is asserted.</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOOTAPDLYENA</name>
              <description>Used to enable the selective Tap delay on the sdcard_clk so as to generate the delayed sdcard_clk. This is used to latch the CMD/DAT outputs to generate delay on them w.r.t CLK going out. This signal along with otapdlysel[3:0] selects the amount of delay to be inserted on the Clock line. This signal should not be asserted when operating in DS mode.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOITAPDLYSEL</name>
              <description>Selects one of the 32 Taps on the rxclk_in line. This is effective only when itapdlyena is asserted and Tuning is not enabled.</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOITAPDLYENA</name>
              <description>Used to enable selective Tap delay line on the Looped back SD Clock (rxclk_in). This signal along with the itapdlysel[4:0] selects the the amount of delay to be inserted on the line. When Tuning is enabled (for SDR104 and optionally for SDR50), this signal is ignored and internalcontrols are used instead. This should not be asserted when operating in DS mode.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOITAPCHGWIN</name>
              <description>This is used to gate the output of the Tap Delay lines so as to avoid glithches being propagated into the Core. This signal should be asserted few clocks before the itapdlysel changes and should be asserted for few clocks after.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOXINCLKEN</name>
              <description>SDIO serial clock source enable.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SDIOSYSCLKEN</name>
              <description>SDIO system clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PDMCTRL</name>
          <description>PDM Control</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>PDMGLOBALEN</name>
              <description>PDM global enable to allow all PDMs to have synchronized interface clocks and FIFO sampling.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MSPI0</name>
      <version>1.0</version>
      <description>Multi-bit SPI Master</description>
      <!-- <groupName>GROUP_MSPI</groupName> -->
      <baseAddress>0x40060000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000324</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MSPI0</name>
        <description>MSPI0_IRQ</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>This register is used to enable individual PIO based transactions to a device on the bus. The CFG register must be programmed properly for the transfer, and the ADDR and INSTR registers should be programmed if the SENDI and SENDA fields are enabled.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1FF7</resetMask>

          <fields>
            <field>
              <name>XFERBYTES</name>
              <description>Number of bytes to transmit or receive (based on TXRX bit)</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

