AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>ENWLAT</name>
              <description>Enable Write Latency Counter (time between address and first data byte). Counter value is WRITELATENCY.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENDCX</name>
              <description>Enable DCX signal on data [1]</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENTURN</name>
              <description>Indicates whether TX->RX turnaround cycles should be enabled for this operation (see TURNAROUND field in CFG register).</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIOSCRAMBLE</name>
              <description>Enables data scrambling for PIO opertions. This should only be used for data operations and never for commands to a device.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BIGENDIAN</name>
              <description>1 indicates data in FIFO is in big endian format (MSB first); 0 indicates little endian data (default, LSB first).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXRX</name>
              <description>1 Indicates a TX operation, 0 indicates an RX operation of XFERBYTES</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDI</name>
              <description>Indicates whether an instruction phase should be sent (see INSTR field and ISIZE field in CFG register)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SENDA</name>
              <description>Indicates whether an address phase should be sent (see ADDR register and ASIZE field in CFG register)</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIODEV</name>
              <description>Selects the Device configutation to use for PIO requests</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEVICE0</name>
                  <description>Use DEVICE0 Configuration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEVICE1</name>
                  <description>Use DEVICE1 CONFIGURATION</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>Command status:  1 indicates controller is busy (command in progress)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STATUS</name>
              <description>Command status:  1 indicates command has completed. Cleared by writing 1 to this bit or starting a new transfer.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>START</name>
              <description>Write to 1 to initiate a PIO transaction on the bus (typically the entire register should be written at once with this bit set).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>These registers are used to enable individual PIO based transactions to a device on the bus. The CFG register must be programmed properly for the transfer, and the ADDR and INSTR registers should be programmed if the SENDI and SENDA fields are enabled.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>PIOMIXED</name>
              <description>Provides override controls for data operations where instruction, address, and data may transfer in different rates.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Transfers all proceed using the settings in DEVCFG register (everything in the same data rate)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Data operations proceed in dual data rate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD2</name>
                  <description>Address and Data operations proceed in dual data rate</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Data operations proceed in quad data rate</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Address and Data operations proceed in quad data rate</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <description>Data operations proceed in octal data rate</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD8</name>
                  <description>Address and Data operations proceed in octal data rate</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>Optional Address field to send for PIO transfers</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Optional Address field to send (after optional instruction field) - qualified by ASIZE in CMD register. NOTE:  This register is aliased to DMADEVADDR.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

