AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PADSET1</name>
              <description>Only applicable on mspi1. When set, use  gpio95 .. gpio 104 as the pads. This extra set of pads is to run mspi0 on HEX and mspi1 concurrently. Note that the timing of this extra pads may not be as good as the origianl pads.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTEN</name>
              <description>Output pad enable configuration. Indicates which pads should be driven. Bits [3:0] are Quad0 data. Bits [7:4] are Quad1 data. Bit [8] is clock. Bit [9] is BM/DQS. Bit [10:17] are data for 16-bit. Bit[18] is BM/DQS for 16-bit. Bit[19] is not used.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUAD0</name>
                  <description>Quad0 (4 data + 1 clock)</description>
                  <value>271</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD1</name>
                  <description>Quad1 (4 data + 1 clock)</description>
                  <value>496</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCTAL</name>
                  <description>Octal (8 data + 1 clock)</description>
                  <value>1023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL0</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>259</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL1</name>
                  <description>Serial (2 data + 1 clock)</description>
                  <value>304</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEX</name>
                  <description>Octal (16 data + 1 clock + 2 bytemask)</description>
                  <value>524287</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADOVEREN</name>
          <description>Enables PIO-like pad override control</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>OVERRIDEEN</name>
              <description>Output pad override enable. Bit mask for pad outputs. When set to 1, the values in the OVERRIDE field are driven on the pad (output enable is implicitly set in this mode). [7:0]=data [8]=clock [9]=DM</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PADOVER</name>
          <description>Override data value</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>OVERRIDE</name>
              <description>Output pad override value. [7:0]=data [8]=clock [9]=DM</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0AXI</name>
          <description>Specifies the base address and aperture range of the device as mapped onto the AXI bus</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF001F</resetMask>

          <fields>
            <field>
              <name>BASE0</name>
              <description>XIPEN has to be enabled to enable aperture. The BASE address needs to be SIZE aligned.</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>READONLY0</name>
              <description>Indicates the AXI aperture is read-only</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READONLY</name>
                  <description>Indicates AXI aperture only supports read operations</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READWRITE</name>
                  <description>Indicates AXI aperture supports read and write operations</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIZE0</name>
              <description>Indicates the AXI aperture size</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64K</name>
                  <description>64KB Aperture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE128K</name>
                  <description>128KB Aperture</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE256K</name>
                  <description>256KB Aperture</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE512K</name>
                  <description>512KB Aperture</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1M</name>
                  <description>1MB Aperture</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2M</name>
                  <description>2MB Aperture</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4M</name>
                  <description>4MB Aperture</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE8M</name>
                  <description>8MB Aperture</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE16M</name>
                  <description>16MB Aperture</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE32M</name>
                  <description>32MB Aperture</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE64M</name>
                  <description>64MB Aperture</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEV0CFG</name>
          <description>Command formatting for PIO based transactions (initiated by writes to CTRL register)</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WRITELATENCY0</name>
              <description>Number of write Latency cycles. Qualified by ENTURN bit field.</description>
              <bitRange>[31:26]</bitRange>
              <access>read-write</access>

