AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>SEPIO0</name>
              <description>Separate IO configuration. This bit should be set when the target device has separate MOSI and MISO pins. Respective IN/OUT bits below should be set to map pins.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXNEG0</name>
              <description>Launches TX data a half clock cycle (~10ns) early. This should normally be programmed to zero (NORMAL).</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>TX launched from posedge internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>TX data launched from negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXNEG0</name>
              <description>Adjusts the RX capture phase to the negedge of the 48MHz internal clock (~10ns early). For normal operation, it is expected that RXNEG will be set to 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX data sampled on posedge of internal clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEGEDGE</name>
                  <description>RX data sampled on negedge of internal clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXCAP0</name>
              <description>Controls RX data capture phase. A setting of 0 (NORMAL) captures read data at the normal capture point relative to the internal clock launch point. However, to accomodate chip/pad/board delays, a setting of RXCAP of 1 is expected to be used to align the capture point with the return data window. This bit is used in conjunction with RXNEG to provide 4 unique capture points, all about 10ns apart.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>RX Capture phase aligns with CPHA setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY</name>
                  <description>RX Capture phase is delayed from CPHA setting by one clock edge</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKDIV0</name>
              <description>Clock Divider. Allows dividing 96 MHz base clock by integer multiples. Enumerations are provided for common frequency, but any integer divide from 96 MHz is allowed. Odd divide ratios will result in a 33/66 percent duty cycle with a long low clock pulse (to allow longer round-trip for read data).</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK96</name>
                  <description>96 MHz MSPI clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK48</name>
                  <description>48 MHz MSPI clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK32</name>
                  <description>32 MHz MSPI clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK24</name>
                  <description>24 MHz MSPI clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK16</name>
                  <description>16 MHz MSPI clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK12</name>
                  <description>12 MHz MSPI clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK8</name>
                  <description>8 MHz MSPI clock</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK6</name>
                  <description>6 MHz MSPI clock</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK4</name>
                  <description>4 MHz MSPI clock</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK3</name>
                  <description>3 MHz MSPI clock</description>
                  <value>32</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL0</name>
              <description>Serial clock polarity.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Clock inactive state is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Clock inactive state is high.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA0</name>
              <description>Serial clock phase.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MIDDLE</name>
                  <description>Clock toggles in middle of data bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START</name>
                  <description>Clock toggles at start of data bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TURNAROUND0</name>
              <description>Number of turnaound cycles (for TX->RX transitions). Qualified by ENTURN bit field.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

