AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>RXDQSDELAYHI0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default) for 2nd DQS on HEX mode.</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAYNEGEN0</name>
              <description>When 1, RXDQSDELAYNEG is used for falling edge of the clock.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAYNEG0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default) of falling edge.</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDQSDELAY0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXDQSDELAY0</name>
              <description>This acts as an offset to the computed value (should be set to 0 by default)</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEFINEDELAY0</name>
              <description>Enables use of delay line to provide fine control over traditional RX capture clock.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DQSSYNCNEG0</name>
              <description>Use negative edge of clock for DDR data sync</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENABLEDQS0</name>
              <description>In EMULATEDDR mode, enable DQS for read capture</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>QUADDDR0</name>
              <description>Deprecated. No effect on RevC.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMULATEDDR0</name>
              <description>Drive external clock at 1/2 rate to emulate DDR mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0CFG1</name>
          <description>Timing and mode configuration bits for the MSPI module.</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008200</resetValue>
          <resetMask>0x0001FFBF</resetMask>

          <fields>
            <field>
              <name>DQSTURN0</name>
              <description>In DQS mode, the internal cycle count to enable DQS path.</description>
              <bitRange>[16:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXHI0</name>
              <description>Force st_rx to start at clock high of mspi_clk</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TAFOURTH0</name>
              <description>Add 1/4th mspi_clk in DDR to turnaround. Recommended set this to 1 when EMULATEDDR is set in non-DQS mode (ENABLEDQS = 0).</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HYPERIO0</name>
              <description>When using Windbond, set this bit to 1 to generate CA[47:0] in hardware.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXSMP0</name>
              <description>Sampling edge based on sclk edge. No effect when div1</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RBX0</name>
              <description>Enable the support of RBX ( page boundary crossing  on read )</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WBX0</name>
              <description>Enable the support of WBX ( page boundary crossing  on write )</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCLKRXHALT0</name>
              <description>Halt sclk based on xfer_count</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCAPEXT0</name>
              <description>Specify the number of apb_clk of RX capture phse {RXCAPEXT, RXCAP}</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SFTURN0</name>
              <description>Subtract from internal counter of write latency and turnaround</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0XIP</name>
          <description>When any SPI flash is configured, this register must be properly programmed before XIP or AUTO DMA operations commence.</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFD</resetMask>

          <fields>
            <field>
              <name>XIPWRITELATENCY0</name>
              <description>Number of write Latency cycles. Qualified by XIPENWLAT bit field.</description>
              <bitRange>[25:20]</bitRange>
              <access>read-write</access>

