AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PCMCHSET</name>
              <description>PCM output chanel 0xsetting</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHANDIS</name>
                  <description>Channel Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONOL</name>
                  <description>MONO Left</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONOR</name>
                  <description>MONO right</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STEREO</name>
                  <description>Stereo</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORECTRL</name>
          <description>PDM to PCM Control</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000434</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CORECTRL</name>
              <description>Overall control of PDM core. Internal use only</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOCNT</name>
          <description>FIFO count</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>FIFOCNT</name>
              <description>Valid 32-bit entries currently in the FIFO.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOREAD</name>
          <description>FIFO Read</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFOREAD</name>
              <description>FIFO read data.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOFLUSH</name>
          <description>FIFO Flush</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>FIFOFLUSH</name>
              <description>FIFO FLUSH.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHR</name>
          <description>FIFO Threshold</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>FIFOTHR</name>
              <description>FIFO Threshold value. When the FIFO count is equal to, or larger than this value (in words), a THR interrupt is generated (if enabled). If used for DMA purposes then only supported values are 0x4, 0x8, 0xc, 0x10, 0x14, 0x18 and 0x1C.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error receieved</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCMP</name>
              <description>DMA completed a transfer</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UNDFL</name>
              <description>This is the FIFO underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OVF</name>
              <description>This is the FIFO overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>THR</name>
              <description>This is the FIFO threshold interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DERR</name>
              <description>DMA Error receieved</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

