AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DAUTOHIP</name>
              <description>Raise priority to high on fifo full, and DMAPRI set to low</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMAPRI</name>
              <description>Sets the Priority of the DMA request</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low Priority (service as best effort)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Priority (service immediately)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADIR</name>
              <description>Direction</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P2M</name>
                  <description>Peripheral to Memory (SRAM) transaction. THe PDM module will only DMA to memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2P</name>
                  <description>Memory to Peripheral transaction. Not available for PDM module</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable DMA Function</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable DMA Function</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMATARGADDR</name>
          <description>DMA Target Address</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>UTARGADDR</name>
              <description>SRAM Target</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LTARGADDR</name>
              <description>DMA Target Address. This register is not updated with the current address of the DMA, but will remain static with the original address during the DMA transfer.</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMA Status</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>DMAERR</name>
              <description>DMA Error</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMACPL</name>
              <description>DMA Transfer Complete</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMATIP</name>
              <description>DMA Transfer In Progress</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DMATOTCOUNT</name>
          <description>DMA Total Transfer Count</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>TOTCOUNT</name>
              <description>Total Transfer Count. The transfer count must be a multiple of the THR setting to avoid DMA overruns.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="PDM0">
      <name>PDM1</name>
      <baseAddress>0x40202000</baseAddress>
      <interrupt>
        <name>PDM1</name>
        <description>PDM1_IRQ</description>
        <value>49</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="PDM0">
      <name>PDM2</name>
      <baseAddress>0x40203000</baseAddress>
      <interrupt>
        <name>PDM2</name>
        <description>PDM2_IRQ</description>
        <value>50</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="PDM0">
      <name>PDM3</name>
      <baseAddress>0x40204000</baseAddress>
      <interrupt>
        <name>PDM3</name>
        <description>PDM3_IRQ</description>
        <value>51</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>PWRCTRL</name>
      <version>1.0</version>
      <description>PWR Controller Register Bank</description>
      <!-- <groupName>GROUP_PWRCTRL</groupName> -->
      <baseAddress>0x40021000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000250</size>
        <usage>registers</usage>
      </addressBlock>

