AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PWRSTCACHEB0</name>
              <description>This bit is 1 if power is supplied to Cache Bank 0</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTNVM0</name>
              <description>This bit is 1 if power is supplied to NVM 0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTDTCM</name>
              <description>Power status for DTCM. Each bit corresponds to one of the TCMs. bit0=DTCM0_0, bit1=DTCM0_1, bit2=DTCM1.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any DTCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM8K</name>
                  <description>Only lower 8k is powered up</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM128K</name>
                  <description>Only lower 128k is powered up</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM384K</name>
                  <description>All 384k is powered up</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMRETCFG</name>
          <description>This controls the power down of the SRAM banks in deep sleep mode. If this is set, then the power for that SRAM bank will be gated when the core goes into deep sleep. Upon wake, the data within the SRAMs will be erased. If this is not set, retention voltage will be applied to the SRAM bank when the core goes into deep sleep. Upon wake, the data within the SRAMs are retained. Do not set this if the SRAM bank is used as the target for DMA transfer while CPU in deepsleep.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>CACHEPWDSLP</name>
              <description>power down cache in deep sleep</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power down cache in deep sleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Retain cache in deep sleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVM0PWDSLP</name>
              <description>Powerdown NVM0 in deep sleep</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>NVM0 is powered down during deepsleep</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>NVM0 is kept powered on during deepsleep</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMPWDSLP</name>
              <description>power down DTCM in deep sleep</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All DTCM retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0</name>
                  <description>Group0_DTCM0 powered down in deep sleep (0KB-8KB)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1</name>
                  <description>Group0_DTCM1 powered down in deep sleep (8KB-128KB)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Both DTCMs in group0 are powered down in deep sleep (0KB-128KB)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLBUTGROUP0DTCM0</name>
                  <description>Group1 and Group0_DTCM1 are powered down in deep sleep (8KB-384KB)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Group1 DTCM powered down in deep sleep (128KB-384KB)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All DTCMs powered down in deep sleep (0KB-384KB)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPWRSTATUS</name>
          <description>Power ON Status for domains that are not part of devpwrstatus or mempwrstatus</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0xE000000F</resetMask>

          <fields>
            <field>
              <name>SYSDEEPSLEEP</name>
              <description>Indicates all device domains powered down and MCU entered DEEPSLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

