AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>PWRDEFVALDEVSTMC</name>
              <description>Default count max value for dev ST MC</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRCTRL</name>
          <description>This register includes additional debug control bits. This is an internal Ambiq-only register. Customers should not attempt to change this or else functionality cannot be guaranteed.</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKEN</name>
              <description>Enables and Selects the SIMO Buck as the supply for the low-voltage power domains. It takes the initial value from the bit set in Customer INFO space.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the SIMO Buck</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the SIMO Buck</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LEGACYVRLPOVR</name>
          <description>When an override is set for a power domain, VR logic will ignore that power domain state in making a decision to go into lp state.</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>IGNOREDBG</name>
              <description>Ignore DBG</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDSP1H</name>
              <description>Ignore DSP1H</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDSP0H</name>
              <description>Ignore DSP0H</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDSPA</name>
              <description>Ignore DSPA</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREAUD</name>
              <description>Ignore AUD</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREUSBPHY</name>
              <description>Ignore USB PHY</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREUSB</name>
              <description>Ignore USB Control</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNORESDIO</name>
              <description>Ignore SDIO</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNORECRYPTO</name>
              <description>Ignore CRYPTO</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDISPPHY</name>
              <description>Ignore DISP PHY</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREDISP</name>
              <description>Ignore DISP Control</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREGFX</name>
              <description>Ignore GFX</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREMSPI</name>
              <description>Ignore MSPI</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPE</name>
              <description>Ignore HCPE</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPD</name>
              <description>Ignore HCPD</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPC</name>
              <description>Ignore HCPC</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPB</name>
              <description>Ignore HCPB</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IGNOREHCPA</name>
              <description>Ignore HCPA</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

