AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>IGNOREIOS</name>
              <description>Ignore IOS</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRSTATUS</name>
          <description>Provides BUCK and LDOs status.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>SIMOBUCKST</name>
              <description>Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the SIMO BUCK is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the SIMO BUCK is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the SIMO BUCK is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEMLDOST</name>
              <description>Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP.</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the MEMLDO is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the MEMLDO is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the MEMLDO is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORELDOST</name>
              <description>Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0] indicates ACT/LP.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Indicates the the CORELDO is OFF.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Indicates the the CORELDO is ON and in LP mode.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Indicates the the CORELDO is ON and in ACT mode.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP0</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTULPUART3</name>
              <description>Weight used for ULP mode UART3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPUART2</name>
              <description>Weight used for ULP mode UART2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPUART1</name>
              <description>Weight used for ULP mode UART1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPUART0</name>
              <description>Weight used for ULP mode UART0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOS</name>
              <description>Weight used for ULP mode IOS</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDSP1</name>
              <description>Weight used for ULP mode DSP1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDSP0</name>
              <description>Weight used for ULP mode DSP0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPMCU</name>
              <description>Weight used for ULP mode MCU</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

