AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP1</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTULPIOM7</name>
              <description>Weight used for ULP mode IOM7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM6</name>
              <description>Weight used for ULP mode IOM6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM5</name>
              <description>Weight used for ULP mode IOM5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM4</name>
              <description>Weight used for ULP mode IOM4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM3</name>
              <description>Weight used for ULP mode IOM3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM2</name>
              <description>Weight used for ULP mode IOM2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM1</name>
              <description>Weight used for ULP mode IOM1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPIOM0</name>
              <description>Weight used for ULP mode IOM0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP2</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTULPUSB</name>
              <description>Weight used for ULP mode USB</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPSDIO</name>
              <description>Weight used for ULP mode SDIO</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPCRYPTO</name>
              <description>Weight used for ULP mode CRYPTO</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDISP</name>
              <description>Weight used for ULP mode DISP</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPGFX</name>
              <description>Weight used for ULP mode GFX</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPMSPI1</name>
              <description>Weight used for ULP mode MSPI1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPMSPI0</name>
              <description>Weight used for ULP mode MSPI0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPADC</name>
              <description>Weight used for ULP mode ADC</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP3</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x0000014C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTULPMSPI2</name>
              <description>Weight used for ULP mode MSPI2</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPI3C1</name>
              <description>Weight used for ULP mode I3C1</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPI3C0</name>
              <description>Weight used for ULP mode I3C0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

