AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>WTLPI3C1</name>
              <description>Weight used for LP mode I3C1</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPI3C0</name>
              <description>Weight used for LP mode I3C0</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPAUDADC</name>
              <description>Weight used for LP mode AUDADC</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPAUDPB</name>
              <description>Weight used for LP mode AUDPB</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPAUDREC</name>
              <description>Weight used for LP mode AUDREC</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDBG</name>
              <description>Weight used for LP mode DBG</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDSPA</name>
              <description>Weight used for LP mode DSPA</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP4</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00FF</resetMask>

          <fields>
            <field>
              <name>WTLPPDM3</name>
              <description>Weight used for LP mode PDM3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPPDM2</name>
              <description>Weight used for LP mode PDM2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPPDM1</name>
              <description>Weight used for LP mode PDM1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPPDM0</name>
              <description>Weight used for LP mode PDM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPI2S1</name>
              <description>Weight used for LP mode I2S1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPI2S0</name>
              <description>Weight used for LP mode I2S0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP5</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x0000016C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>WTLPUSBPHY</name>
              <description>Weight used for LP mode USB PHY</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDISPPHY</name>
              <description>Weight used for LP mode DISP PHY</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTHP0</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTHPUART3</name>
              <description>Weight used for HP mode UART3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPUART2</name>
              <description>Weight used for HP mode UART2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPUART1</name>
              <description>Weight used for HP mode UART1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPUART0</name>
              <description>Weight used for HP mode UART0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

