AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
          <fields>
            <field>
              <name>EMONSEL6</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0ON</name>
                  <description>Increment the counter for DSP0 active mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1ON</name>
                  <description>Increment the counter for DSP1 active mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCON</name>
                  <description>Increment the counter when ADC is powered on</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDPBON</name>
                  <description>Increment the counter when AUDPB is powered on</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDRECON</name>
                  <description>Increment the counter when AUDREC is powered on</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S0ON</name>
                  <description>Increment the counter when I2S0 is powered on</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S1ON</name>
                  <description>Increment the counter when I2S1 is powered on</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM0ON</name>
                  <description>Increment the counter when PDM0 is powered on</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM1ON</name>
                  <description>Increment the counter when PDM1 is powered on</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM2ON</name>
                  <description>Increment the counter when PDM2 is powered on</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM3ON</name>
                  <description>Increment the counter when PDM3 is powered on</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDADCON</name>
                  <description>Increment the counter when AUDADC is powered on</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTOON</name>
                  <description>Increment the counter when CRYPTO is powered on</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBGON</name>
                  <description>Increment the counter when DBG is powered on</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPON</name>
                  <description>Increment the counter when DISP is powered on</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPPHYON</name>
                  <description>Increment the counter when DISPPHY is powered on</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSPAON</name>
                  <description>Increment the counter when DSPA is powered on</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GFXON</name>
                  <description>Increment the counter when GFX is powered on</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0ON</name>
                  <description>Increment the counter when UART0 is powered on</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1ON</name>
                  <description>Increment the counter when UART1 is powered on</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2ON</name>
                  <description>Increment the counter when UART2 is powered on</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3ON</name>
                  <description>Increment the counter when UART3 is powered on</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0ON</name>
                  <description>Increment the counter when IOM0 is powered on</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1ON</name>
                  <description>Increment the counter when IOM1 is powered on</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2ON</name>
                  <description>Increment the counter when IOM2 is powered on</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3ON</name>
                  <description>Increment the counter when IOM3 is powered on</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0ON</name>
                  <description>Increment the counter when I3C0 is powered on</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C1ON</name>
                  <description>Increment the counter when I3C1 is powered on</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4ON</name>
                  <description>Increment the counter when IOM4 is powered on</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5ON</name>
                  <description>Increment the counter when IOM5 is powered on</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6ON</name>
                  <description>Increment the counter when IOM6 is powered on</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7ON</name>
                  <description>Increment the counter when IOM7 is powered on</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOSON</name>
                  <description>Increment the counter when IOS is powered on</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0ON</name>
                  <description>Increment the counter when MSPI0 is powered on</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1ON</name>
                  <description>Increment the counter when MSPI1 is powered on</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI2ON</name>
                  <description>Increment the counter when MSPI2 is powered on</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIOON</name>
                  <description>Increment the counter when SDIO is powered on</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBON</name>
                  <description>Increment the counter when USB is powered on</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBPHYON</name>
                  <description>Increment the counter when USBPHY is powered on</description>
                  <value>42</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCFG7</name>
          <description>The counter increments when the counter is enabled and the mode selected here matches the power mode.</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>EMONSEL7</name>
              <description>Power modes for incrementing the counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEVER</name>
                  <description>Never increment the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Always increment the counter</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUSLEEP</name>
                  <description>Increment the counter for MCU sleep mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCUDEEPSLEEP</name>
                  <description>Increment the counter for MCU deepsleep mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0ON</name>
                  <description>Increment the counter for DSP0 active mode</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1ON</name>
                  <description>Increment the counter for DSP1 active mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCON</name>
                  <description>Increment the counter when ADC is powered on</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDPBON</name>
                  <description>Increment the counter when AUDPB is powered on</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDRECON</name>
                  <description>Increment the counter when AUDREC is powered on</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S0ON</name>
                  <description>Increment the counter when I2S0 is powered on</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S1ON</name>
                  <description>Increment the counter when I2S1 is powered on</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM0ON</name>
                  <description>Increment the counter when PDM0 is powered on</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM1ON</name>
                  <description>Increment the counter when PDM1 is powered on</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM2ON</name>
                  <description>Increment the counter when PDM2 is powered on</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDM3ON</name>
                  <description>Increment the counter when PDM3 is powered on</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDADCON</name>
                  <description>Increment the counter when AUDADC is powered on</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYPTOON</name>
                  <description>Increment the counter when CRYPTO is powered on</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBGON</name>
                  <description>Increment the counter when DBG is powered on</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPON</name>
                  <description>Increment the counter when DISP is powered on</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISPPHYON</name>
                  <description>Increment the counter when DISPPHY is powered on</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSPAON</name>
                  <description>Increment the counter when DSPA is powered on</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GFXON</name>
                  <description>Increment the counter when GFX is powered on</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0ON</name>
                  <description>Increment the counter when UART0 is powered on</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1ON</name>
                  <description>Increment the counter when UART1 is powered on</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2ON</name>
                  <description>Increment the counter when UART2 is powered on</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART3ON</name>
                  <description>Increment the counter when UART3 is powered on</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM0ON</name>
                  <description>Increment the counter when IOM0 is powered on</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1ON</name>
                  <description>Increment the counter when IOM1 is powered on</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2ON</name>
                  <description>Increment the counter when IOM2 is powered on</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3ON</name>
                  <description>Increment the counter when IOM3 is powered on</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C0ON</name>
                  <description>Increment the counter when I3C0 is powered on</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C1ON</name>
                  <description>Increment the counter when I3C1 is powered on</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4ON</name>
                  <description>Increment the counter when IOM4 is powered on</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5ON</name>
                  <description>Increment the counter when IOM5 is powered on</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6ON</name>
                  <description>Increment the counter when IOM6 is powered on</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7ON</name>
                  <description>Increment the counter when IOM7 is powered on</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOSON</name>
                  <description>Increment the counter when IOS is powered on</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0ON</name>
                  <description>Increment the counter when MSPI0 is powered on</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1ON</name>
                  <description>Increment the counter when MSPI1 is powered on</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI2ON</name>
                  <description>Increment the counter when MSPI2 is powered on</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIOON</name>
                  <description>Increment the counter when SDIO is powered on</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBON</name>
                  <description>Increment the counter when USB is powered on</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USBPHYON</name>
                  <description>Increment the counter when USBPHY is powered on</description>
                  <value>42</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EMONCOUNT0</name>
          <description>Energy Monitor count value for counter 0</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>EMONCOUNT0</name>
              <description>Energy Monitor count value counter 0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

