AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>This register contains the status for brownout events and the causes for resets.\n NOTE 1: All bits in this register, including reserved bits, are writable. Therefore care should be taken not to write this register.\n NOTE 2:  This register is only reset by POI not by HRESETn. Its contents are intended to survive all reset level except POI and full power cycles.</description>
          <addressOffset>0x0000885C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>BOSSTAT</name>
              <description>VDDS Analog Brownout Event occured.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOFSTAT</name>
              <description>VDDF Analog Brownout Event occured.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOCSTAT</name>
              <description>VDDC Analog Brownout Event occured.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BOUSTAT</name>
              <description>An Unregulated Supply Brownout Event occured.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WDRSTAT</name>
              <description>Reset was initiated by a Watchdog Timer Reset.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBGRSTAT</name>
              <description>Reset was a initiated by Debugger Reset.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>POIRSTAT</name>
              <description>Reset was a initiated by Software POI Reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SWRSTAT</name>
              <description>Reset was a initiated by SW POR or AIRCR Reset.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BORSTAT</name>
              <description>Reset was initiated by a Brown-Out Reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PORSTAT</name>
              <description>Reset was initiated by a Power-On Reset.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EXRSTAT</name>
              <description>Reset was initiated by an External Reset.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>RTC</name>
      <version>1.0</version>
      <description>Real Time Clock</description>
      <!-- <groupName>GROUP_RTC</groupName> -->
      <baseAddress>0x40004800</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC_IRQ</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>RTCCTL</name>
          <description>This is the register control for the RTC module. It enables counter writes and sets the alarm repeat interval.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>HR1224</name>
              <description>Hours Counter mode Only 24HR mode supported</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>24HR</name>
                  <description>Hours in 24 hour mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable the 24 hour mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTOP</name>
              <description>RTC input clock control</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Allow the RTC input clock to run</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop the RTC input clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPT</name>
              <description>Alarm repeat interval</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Alarm interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YEAR</name>
                  <description>Interrupt every year</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONTH</name>
                  <description>Interrupt every month</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WEEK</name>
                  <description>Interrupt every week</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAY</name>
                  <description>Interrupt every day</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HR</name>
                  <description>Interrupt every hour</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIN</name>
                  <description>Interrupt every minute</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEC</name>
                  <description>Interrupt every second/10th/100th</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRTC</name>
              <description>Counter write control</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Counter writes are disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Counter writes are enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSTAT</name>
          <description>This is the register status for the RTC module.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>WRITEBUSY</name>
              <description>Indicates that an RTC update (write) is still in progress. Writes are initiated by writing the CTTLOW register - CTRUP must be written before CTRLOW to be updated (otherwise it will retain its current value)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

