AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BLOCK</name>
          <description>Block size</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>

          <fields>
            <field>
              <name>BLKCNT</name>
              <description>This register is enabled when Block Count Enable in the Transfer Mode register is set to 1 and is valid only for multiple block transfers. The HC decrements the block count after each block transfer and stops when the count reaches zero. It can be accessed only if no transaction is executing (i.e. after a transaction has stopped). Read operations during transfer return an invalid value and write operations shall be ignored. When saving transfer context as a result of Suspend command, the number of blocks yet to be transferred can be determined by reading this register. When restoring transfer context prior to issuing a Resume command, the HD shall restore the previously save block count.</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOPCNT</name>
                  <description>Stop Count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1BLOCK</name>
                  <description>1 block</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BLOCKS</name>
                  <description>2 blocks (and so on from 1-65535)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>65535BLOCKS</name>
                  <description>65535 blocks</description>
                  <value>65535</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HOSTSDMABUFSZ</name>
              <description>To perform long DMA transfer, System Address register shall be updated at every system boundary during DMA transfer. These bits specify the size of contiguous buffer in the system memory. The DMA transfer shall wait at the every boundary specified by these fields and the HC generates the DMA Interrupt to request the HD to update the System Address register. These bits shall support when the DMA Support in the Capabilities register is set to 1 and this function is active when the DMA Enable in the Transfer Mode register is set to 1.</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4KB</name>
                  <description>4KB(Detects A11 Carry out)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KB</name>
                  <description>8KB(Detects A12 Carry out)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16KB</name>
                  <description>16KB(Detects A13 Carry out)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32KB</name>
                  <description>32KB(Detects A14 Carry out)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64KB</name>
                  <description>64KB(Detects A15 Carry out)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128KB</name>
                  <description>128KB(Detects A16 Carry out)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256KB</name>
                  <description>256KB(Detects A17 Carry out)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512KB</name>
                  <description>512KB(Detects A18 Carry out)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRANSFERBLOCKSIZE</name>
              <description>This register specifies the block size for block data transfers for CMD17, CMD18, CMD24, CMD25, and CMD53. It can be accessed only if no transaction is executing (i.e after a transaction has stopped). Read operations during transfer return an invalid value and write operations shall be ignored.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODATAXFER</name>
                  <description>No Data Transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1BYTE</name>
                  <description>1 Byte</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BYTES</name>
                  <description>2 Bytes</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3BYTES</name>
                  <description>3 Bytes</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BYTES</name>
                  <description>4 Bytes (and so on from 1-2048)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>511BYTES</name>
                  <description>511 Bytes</description>
                  <value>511</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512BYTES</name>
                  <description>512 Bytes</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048BYTES</name>
                  <description>2048 Bytes</description>
                  <value>2048</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ARGUMENT1</name>
          <description>Argument1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CMDARG1</name>
              <description>The SD Command Argument is specified as bit39-8 of Command-Format.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

