AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>READWAITCTRL</name>
              <description>The read wait function is optional for SDIO cards. If the card supports read wait, set this bit to enable use of the read wait protocol to stop read data using DAT[2] line. Otherwise the HC has to stop the SD clock to hold read data, which restricts commands generation. When the HD detects an SD card insertion, it shall set this bit according to the CCCR of the SDIO card. If the card does not support read wait, this bit shall never be set to 1 otherwise DAT line conflict may occur. If this bit is set to 0, Suspend / Resume cannot be supported</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable Read Wait Control</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable Read Wait Control</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONTREQ</name>
              <description>This bit is used to restart a transaction which was stopped using the Stop At Block Gap Request. To cancel stop at the block gap, set Stop At block Gap Request to 0 and set this bit to restart the transfer. The HC automatically clears this bit in either of the following cases: 1) In the case of a read transaction, the DAT Line Active changes from 0 to 1 as a read transaction restarts. 2) In the case of a write transaction, the Write transfer active changes from 0 to 1 as the write transaction restarts. Therefore it is not necessary for Host driver to set this bit to 0. If Stop At Block Gap Request is set to 1, any write to this bit is ignored.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESTART</name>
                  <description>Restart</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORED</name>
                  <description>Ignored</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPATBLOCKGAPREQUEST</name>
              <description>This bit is used to stop executing a transaction at the next block gap for non- DMA,SDMA and ADMA transfers. Until the transfer complete is set to 1, indicating a transfer completion the HD shall leave this bit set to 1. Clearing both the Stop At Block Gap Request and Continue Request shall not cause the transaction to restart. Read Wait is used to stop the read transaction at the block gap. The HC shall honour Stop At Block Gap Request for write transfers, but for read transfers it requires that the SD card support Read Wait. Therefore the HD shall not set this bit during read transfers unless the SD card supports Read Wait and has set Read Wait Control to 1. In case of write transfers in which the HD writes data to the Buffer Data Port register, the HD shall set this bit after all block data is written. If this bit is set to 1, the HD shall not write data to Buffer data port register. This bit affects Read Transfer Active, Write Transfer Active, DAT line active and Command Inhibit (DAT) in the Present State register.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSFER</name>
                  <description>Transfer</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HWRESET</name>
              <description>Hardware reset signal is generated for eMMC card when this bit is set</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASSERT</name>
                  <description>Drives the hardware reset pin as ZERO (Active LOW to eMMC card)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEASSERT</name>
                  <description>Deassert the hardware reset pin</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOLTSELECT</name>
              <description>By setting these bits, the HD selects the voltage level for the SD card. Before setting this register, the HD shall check the voltage support bits in the capabilities register. If an unsupported voltage is selected, the Host System shall not supply SD bus voltage. All voltage select values not enumerated here are reserved.</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>3_3V</name>
                  <description>3.3 V(Typ.)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_0V</name>
                  <description>3.0 V(Typ.)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_8V</name>
                  <description>1.8 V(Typ.)</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDBUSPOWER</name>
              <description>Before setting this bit, the SD host driver shall set SD Bus Voltage Select. If the HC detects the No Card State, this bit shall be cleared.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERON</name>
                  <description>Power on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWEROFF</name>
                  <description>Power off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CARDSRC</name>
              <description>This bit selects source for card detection.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEST</name>
                  <description>The card detect test level is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDCD</name>
                  <description>SDCD is selected (for normal use)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TESTLEVEL</name>
              <description>This bit is enabled while the Card Detect Signal Selection is set to 1 and it indicates card inserted or not. Generates (card ins or card removal) interrupt when the normal int sts enable bit is set.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CARDINSERTED</name>
                  <description>Card Inserted</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCARD</name>
                  <description>No Card</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XFERWIDTH</name>
              <description>This bit controls 8-bit bus width mode for embedded device. Support of this function is indicated in 8-bit Support for Embedded Device in the Capabilities register. If a device supports 8-bit bus mode, this bit may be set to 1. If this bit is 0, bus width is controlled by Data Transfer Width in the Host Control 1 register.This bit is not effective when multiple devices are installed on a bus slot (Slot Type is set to 10b in the Capabilities register). In this case, each device bus width is controlled by Bus Width Preset field in the Shared Bus register.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit Bus Width</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XFER</name>
                  <description>Bus Width is selected by Data Transfer Width</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMASELECT</name>
              <description>One of supported DMA modes can be selected. The host driver shall check support of DMA modes by referring the Capabilities register.</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDMA</name>
                  <description>SDMA is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMA132</name>
                  <description>32-bit Address ADMA1 is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMA232</name>
                  <description>32-bit Address ADMA2 is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADMA264</name>
                  <description>64-bit Address ADMA2 is selected</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HISPEEDEN</name>
              <description>This bit is optional. Before setting this bit, the HD shall check the High Speed Support in the capabilities register. If this bit is set to 0 (default), the HC outputs CMD line and DAT lines at the falling edge of the SD clock (up to 25 MHz/ 20MHz for MMC). If this bit is set to 1, the HC outputs CMD line and DAT lines at the rising edge of the SD clock (up to 50 MHz for SD/52MHz for MMC)/ 208Mhz (for SD3.0) If Preset Value Enable in the Host Control 2 register is set to 1, Host Driver needs to reset SD Clock Enable before changing this field to avoid generating clock glitches. After setting this field, the Host Driver sets SD Clock Enable again</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High Speed Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Speed Mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATATRANSFERWIDTH</name>
              <description>(SD1 or SD4) This bit selects the data width of the HC. The HD shall select it to match the data width of the SD card.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SD4</name>
                  <description>4 bit mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SD1</name>
                  <description>1 bit mode</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LEDCONTROL</name>
              <description>This bit is used to caution the user not to remove the card while the SD card is being accessed. If the software is going to issue multiple SD commands, this bit can be set during all transactions. It is not necessary to change for each transaction.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>LED on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>LED off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCKCTRL</name>
          <description>Clock control</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x070FFFE7</resetMask>

          <fields>
            <field>
              <name>SWRSTDAT</name>
              <description>Only part of data circuit is reset. The following registers and bits are cleared by this bit: Buffer Data Port Register Buffer is cleared and Initialized. Present State register Buffer read Enable Buffer write Enable Read Transfer Active Write Transfer Active DAT Line Active Command Inhibit (DAT) Block Gap Control register Continue Request Stop At Block Gap Request Normal Interrupt Status register Buffer Read Ready Buffer Write Ready Block Gap Event Transfer Complete</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTCMD</name>
              <description>Only part of command circuit is reset. The following registers and bits are cleared by this bit: Present State register Command Inhibit (CMD) Normal Interrupt Status register Command Complete</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWRSTALL</name>
              <description>This reset affects the entire HC except for the card detection circuit. Register bits of type ROC, RW, RW1C, RWAC are cleared to 0. During its initialization, the HD shall set this bit to 1 to reset the HC. The HC shall reset this bit to 0 when capabilities registers are valid and the HD can read them. Additional use of Software Reset For All may not affect the value of the Capabilities registers. If this bit is set to 1, the SD card shall reset itself and must be re initialized by the HD. A reset pulse is generated when writing 1 to each bit of this register. After completing the reset, the HC shall clear each bit. Because it takes some time to complete software reset, the SD Host Driver shall confirm that these bits are 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WORK</name>
                  <description>Work</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMEOUTCNT</name>
              <description>This value determines the interval by which DAT line time-outs are detected. Refer to the Data Time-out Error in the Error Interrupt Status register for information on factors that dictate time-out generation. Time-out clock frequency will be generated by dividing the sdclockTMCLK by this value. When setting this register, prevent inadvertent time-out events by clearing the Data Time-out Error Status Enable (in the Error Interrupt Status Enable register) At the initialization of the HC, the HD shall set the Data Time-out Counter Value according to the Capabilities register. The general formula is TIMEOUT = 2 ^ (TIMEOUTCNT + 13).</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>27</name>
                  <description>TMCLK * 2^27</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>TMCLK * 2^26</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQSEL</name>
              <description>This register is used to select the frequency of the SDCLK pin. The frequency is not programmed directly; rather this register holds the divisor of the Base Clock Frequency For SD clock in the capabilities register. Only the following settings are allowed. (1) 8-bit Divided Clock Mode Setting 00h specifies the highest frequency of the SD Clock. When setting multiple bits, the most significant bit is used as the divisor. But multiple bits should not be set. The two default divider values can be calculated by the frequency that is defined by the Base Clock Frequency For SD Clock in the Capabilities register. 1) 25 MHz divider value 2) 400 KHz divider value The frequency of the SDCLK is set by the following formula: Clock Frequency = (Baseclock) / divisor. Thus choose the smallest possible divisor which results in a clock frequency that is less than or equal to the target frequency. Maximum Frequency for SD = 50Mhz (base clock) Maximum Frequency for MMC = 52Mhz (base clock) Minimum Frequency = 195.3125Khz (50Mhz / 256), same calculation for MMC also (2) 10-bit Divided Clock Mode Host Controller Version 3.00 supports this mandatory mode instead of the 8-bit Divided Clock Mode. The length of divider is extended to10 bits and all divider values shall be supported. 3FFh --1/2046 Divided Clock N -------1/2N Divided Clock (Duty 50%) 002h -- 1/4 Divided Clock 001h ---1/2 Divided Clock 000h --- Base Clock (10MHz-254MHz)</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>base clock divided by 256</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>base clock divided by 128</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>base clock divided by 64</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>base clock divided by 32</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>base clock divided by 16</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>base clock divided by 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>base clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>base clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECLK</name>
                  <description>Base clock (10MHz - 63MHz)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPRCLKDIV</name>
              <description>Bit 07-06 is assigned to bit 09-08 of clock divider in SDCLK Frequency Select</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

