AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
          <fields>
            <field>
              <name>SLOTTYPE</name>
              <description>This field indicates usage of a slot by a specific Host System. (A host controller register set is defined per slot.) Embedded slot for one device (01b) means that only one non-removable device is connected to a SD bus slot. Shared Bus Slot (10b) can be set if Host Controller supports Shared Bus Control register. The Standard Host Driver controls only a removable card or one embedded device is connected to a SD bus slot. If a slot is configured for shared bus (10b), the Standard Host Driver does not control embedded devices connected to a shared bus. Shared bus slot is controlled by a specific host driver developed by a Host System.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REMOVABLE</name>
                  <description>Removable card slot</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMBEDDED</name>
                  <description>Embedded Slot for One Device</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED</name>
                  <description>Shared Bus Slot</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ASYNCINT</name>
              <description>Refer to SDIO Specification Version 3.00 about asynchronous interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Asynchronous Interrupt Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Asynchronous Interrupt Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSBUS64</name>
              <description>Desc</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Supports 64 bit system address</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Does not support 64 bit system address</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOLT18V</name>
              <description>Voltage support 1.8v</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>1.8 V Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>1.8 V Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOLT30V</name>
              <description>Voltage support 3.0v</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>3.0 V Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>3.0 V Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOLT33V</name>
              <description>Desc</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>3.3 V Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>3.3 V Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUSPRES</name>
              <description>This bit indicates whether the HC supports Suspend / Resume functionality. If this bit is 0, the Suspend and Resume mechanism are not supported and the HD shall not issue either Suspend / Resume commands.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Suspend / Resume Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Suspend / Resume Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMA</name>
              <description>This bit indicates whether the HC is capable of using DMA to transfer data between system memory and the HC directly.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>SDMA Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>SDMA Supported.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIGHSPEED</name>
              <description>This bit indicates whether the HC and the Host System support High Speed mode and they can supply SD Clock frequency from 25Mhz to 50 Mhz (for SD)/ 20MHz to 52MHz (for MMC).</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>High Speed Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>High Speed Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMA2</name>
              <description>Desc</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>ADMA2 support.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>ADMA2 not support</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTMEDIA</name>
              <description>This bit indicates whether the Host Controller is capable of using 8-bit bus width mode. This bit is not effective when Slot Type is set to 10b. In this case, refer to Bus Width Preset in the Shared Bus resister. Supported</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Extended Media Bus Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Extended Media Bus not supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXBLKLEN</name>
              <description>This value indicates the maximum block size that the HD can read and write to the buffer in the HC. The buffer shall transfer this block size without wait cycles. Three sizes can be defined as indicated below.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 byte</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048</name>
                  <description>2048 byte</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096</name>
                  <description>4096 byte</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDCLKFREQ</name>
              <description>6-bit Base Clock Frequency This mode is supported by the Host Controller Version 1.00 and 2.00. Upper 2-bit is not effective and always 0. Unit values are 1MHz. The supported clock range is 10MHz to 63MHz. 11xx xxxxb Not supported 0011 1111b 63MHz 0000 0010b 2MHz 0000 0001b 1MHz 0000 0000b Get information via another method (2) 8-bit Base Clock Frequency This mode is supported by the Host Controller Version 3.00.Unit values are 1MHz. The supported clock range is 10MHz to 255MHz. FFh 255MHz 02h 2MHz 01h 1MHz 00h Get information via another method If the real frequency is 16.5MHz, the lager value shall be set 0001 0001b (17MHz) because the Host Driver use this value to calculate the clock divider value (Refer to the SDCLK Frequency Select in the Clock Control register.) and it shall not exceed upper limit of the SD Clock frequency. If these bits are all 0, the Host System has to get information via another method. Some example frequency values are enumerated below.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>255MHZ</name>
                  <description>2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63MHZ</name>
                  <description>1) 6-bit base clock frequency supports frequencies 10MHz-63MHz. 2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHZ</name>
                  <description>1) 6-bit base clock frequency supports frequencies 10MHz-63MHz. 2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MHZ</name>
                  <description>1) 6-bit base clock frequency supports frequencies 10MHz-63MHz. 2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOCLKUNIT</name>
              <description>This bit shows the unit of base clock frequency used to detect Data Timeout Error.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KHZ</name>
                  <description>Khz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHZ</name>
                  <description>Mhz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOCLKFREQ</name>
              <description>This bit shows the base clock frequency used to detect Data Timeout Error. Not 0 - 1Khz to 63Khz or 1Mhz to 63Mhz Note: The Host System shall support at least one of these voltages above. The HD sets the SD Bus Voltage Select in Power Control register according to these support bits. If multiple voltages are supported, select the usable lower voltage by comparing the OCR value from the card. These registers indicate maximum current capability for each voltage. The value is meaningful if Voltage Support is set in the Capabilities register.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1KHZ or 1MHZ</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2KHZ or 2MHZ</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>63KHZ or 63MHZ</description>
                  <value>63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get Information via another method.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAPABILITIES1</name>
          <description>Capabilities</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFEF77</resetMask>

