AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
          <fields>
            <field>
              <name>SPIBLOCKMODE</name>
              <description>Spi block mode</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPIMODE</name>
              <description>Spi mode</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Supported</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKMULT</name>
              <description>This field indicates clock multiplier value of programmable clock generator. Refer to Clock Control register. Setting 00h means that Host Controller does not support programmable clock generator. The multiplier is (CLKMULT+1).</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTX256</name>
                  <description>Clock Multiplier M = 256</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTX3</name>
                  <description>Clock Multiplier M = 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTX2</name>
                  <description>Clock Multiplier M = 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Clock Multiplier is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETUNINGMODES</name>
              <description>This field defines the re-tuning capability of a Host Controller and how to manage the data transfer length and a Re-Tuning Timer by the Host Driver There are two re-tuning timings: Re-Tuning Request and expiration of a Re-Tuning Timer. By receiving either timing, the Host Driver executes the re-tuning procedure just before a next command issue</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Mode1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE2</name>
                  <description>Mode2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE3</name>
                  <description>Mode3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Clock Multiplier is not supported.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TUNINGSDR50</name>
              <description>If this bit is set to 1, this Host Controller requires tuning to operate SDR50. (Tuning is always required to operate SDR104.)</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TUNINGREQD</name>
                  <description>SDR50 requires tuning</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTUNINGREQD</name>
                  <description>SDR50 does not require tuning</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RETUNINGTMRCNT</name>
              <description>This field indicates an initial value of the Re-Tuning Timer for Re-Tuning Mode 1 to 3. 0h - Get information via other source.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>0h Get information via other source.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1SEC</name>
                  <description>1 seconds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2SEC</name>
                  <description>2 seconds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4SEC</name>
                  <description>4 seconds</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8S</name>
                  <description>8 seconds</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16S</name>
                  <description>16 seconds</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32S</name>
                  <description>32 seconds</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64S</name>
                  <description>64 seconds</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128S</name>
                  <description>128 seconds</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256S</name>
                  <description>256 seconds</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512S</name>
                  <description>512 seconds</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024S</name>
                  <description>1024 seconds</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPED</name>
              <description>Reserved This bit indicates support of Driver Type D for 1.8 Signaling.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Driver Type D is Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Driver Type D is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPEC</name>
              <description>This bit indicates support of Driver Type C for 1.8 Signaling.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Driver Type C is Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Driver Type C is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPEA</name>
              <description>This bit indicates support of Driver Type A for 1.8 Signaling.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>Driver Type A is Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>Driver Type A is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR50</name>
              <description>DDR50 field description needed here.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>DDR50 is Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>DDR50 is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR104</name>
              <description>1- SDR104 is Supported</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>SDR104 is Not Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>SDR104 is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR50</name>
              <description>1- SDR50 is Supported</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPORTED</name>
                  <description>SDR50 is Not Supported</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTSUPPORTED</name>
                  <description>SDR50 is Not Supported</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAXIMUM0</name>
          <description>Maximum current capabilities</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ALLBITSRSVD</name>
              <description>The entire 32-bits of this register are reserved, do not read or write.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

