AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PRESET1</name>
          <description>Preset Value for high speed and SDR12</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>

          <fields>
            <field>
              <name>SDR12DRVRSTRSEL</name>
              <description>Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is Selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR12CLKGENSEL</name>
              <description>This bit is effective when Host Controller supports programmable clock generator.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGCLK</name>
                  <description>Programmable Clock Generator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCTLR</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR12SDCLKFREQSEL</name>
              <description>10 bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. When Host Controller supports shared bus, a set of Preset Value registers for each device required and the registers location are duplicated to the offset 06Fh-060h. A set of Preset Value registers can be accessible by selecting Clock Pin Select in the Shared Bus Control register</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSDRVRSTRSEL</name>
              <description>Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is Selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSCLKGENSEL</name>
              <description>This bit is effective when Host Controller supports programmable clock generator.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGCLK</name>
                  <description>Programmable Clock Generator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCTLR</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSSDCLKFREQSEL</name>
              <description>10 bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. When Host Controller supports shared bus, a set of Preset Value registers for each device required and the registers location are duplicated to the offset 06Fh-060h. A set of Preset Value registers can be accessible by selecting Clock Pin Select in the Shared Bus Control register</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PRESET2</name>
          <description>Preset Value for SDR25 and SDR50</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>

          <fields>
            <field>
              <name>SDR50DRVRSTRSEL</name>
              <description>Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is Selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR50CLKGENSEL</name>
              <description>This bit is effective when Host Controller supports programmable clock generator.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGCLK</name>
                  <description>Programmable Clock Generator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCTLR</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR50SDCLKFREQSEL</name>
              <description>10 bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. When Host Controller supports shared bus, a set of Preset Value registers for each device required and the registers location are duplicated to the offset 06Fh-060h. A set of Preset Value registers can be accessible by selecting Clock Pin Select in the Shared Bus Control register</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

