AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTTOCTRL</name>
          <description>Boot Data Timeout control</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BOOTDATATO</name>
              <description>This value determines the interval by which DAT line time-outs are detected during boot operation for eMMC card. The value is in number of sd clock.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VENDOR</name>
          <description>Vendor</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DLYDIS</name>
              <description>Chicken bit added to enable/disable the rtl fix made to delay the sampling of cmd_in and data_in.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the rtl fix made to delay the sampling of cmd_in and data_in</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the rtl fix made to delay the sampling of cmd_in and data_in</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GATESDCLKEN</name>
              <description>If this bit is 0, SD_CLK to card will not be gated automatically, when there is no transfer. If this bit set to 1, SD_CLK to card will be gated automatically,when there is no transfer.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GATE</name>
                  <description>SD_CLK to card will be gated automatically when there is no transfer.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOGATE</name>
                  <description>SD_CLK to card will NOT be gated automatically when there is no transfer.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SLOTSTAT</name>
          <description>Slot interrupt status</description>
          <addressOffset>0x000000FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0A020000</resetValue>
          <resetMask>0xFFFF0001</resetMask>

          <fields>
            <field>
              <name>VENDORVER</name>
              <description>The Vendor Version Number is set to 0x10 (1.0)</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPECVER</name>
              <description>The Host Controller Version Number is set to 0x02 (SD Host Specification Version 3.00).</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INTSLOT0</name>
              <description>This status bit indicates the OR of Interrupt signal and Wakeup signal for slot</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>SECURITY</name>
      <version>1.0</version>
      <description>Security Interfaces</description>
      <!-- <groupName>GROUP_SECURITY</groupName> -->
      <baseAddress>0x40030000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000090</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800000F1</resetMask>

          <fields>
            <field>
              <name>CRCERROR</name>
              <description>CRC Error Status - Set to 1 if an error occurs during a CRC operation. Cleared when CTRL register is written (with any value). Usually indicates an invalid address range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNCTION</name>
              <description>Function Select</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC32</name>
                  <description>Perform CRC32 operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAND</name>
                  <description>DMA pseudo-random number stream based on CRC value</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENADDR</name>
                  <description>Generate DMA stream based on address</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Function Enable. Software should set the ENABLE bit to initiate a CRC operation. Hardware will clear the ENABLE bit upon completion.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

