AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>TMR111INT</name>
              <description>Counter/Timer 11 interrupt based on CMP1.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR110INT</name>
              <description>Counter/Timer 11 interrupt based on CMP0.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR101INT</name>
              <description>Counter/Timer 10 interrupt based on CMP1.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR100INT</name>
              <description>Counter/Timer 10 interrupt based on CMP0.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR91INT</name>
              <description>Counter/Timer 9 interrupt based on CMP1.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR90INT</name>
              <description>Counter/Timer 9 interrupt based on CMP0.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR81INT</name>
              <description>Counter/Timer 8 interrupt based on CMP1.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR80INT</name>
              <description>Counter/Timer 8 interrupt based on CMP0.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR71INT</name>
              <description>Counter/Timer 7 interrupt based on CMP1.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR70INT</name>
              <description>Counter/Timer 7 interrupt based on CMP0.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR61INT</name>
              <description>Counter/Timer 6 interrupt based on CMP1.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR60INT</name>
              <description>Counter/Timer 6 interrupt based on CMP0.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR51INT</name>
              <description>Counter/Timer 5 interrupt based on CMP1.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR50INT</name>
              <description>Counter/Timer 5 interrupt based on CMP0.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR41INT</name>
              <description>Counter/Timer 4 interrupt based on CMP1.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR40INT</name>
              <description>Counter/Timer 4 interrupt based on CMP0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR31INT</name>
              <description>Counter/Timer 3 interrupt based on CMP1.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR30INT</name>
              <description>Counter/Timer 3 interrupt based on CMP0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR21INT</name>
              <description>Counter/Timer 2 interrupt based on CMP1.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR20INT</name>
              <description>Counter/Timer 2 interrupt based on CMP0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR11INT</name>
              <description>Counter/Timer 1 interrupt based on CMP1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR10INT</name>
              <description>Counter/Timer 1 interrupt based on CMP0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR01INT</name>
              <description>Counter/Timer 0 interrupt based on CMP1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR00INT</name>
              <description>Counter/Timer 0 interrupt based on CMP0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR151INT</name>
              <description>Counter/Timer 15 interrupt based on CMP1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

