AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>BF55</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF43</name>
              <description>Squelch detector bias current tuning,  2'b00 represents the minimum bias current 2'b11 represents the maximum bias current</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF20</name>
              <description>Manually set the Tx Clock phase select. These bits will tune the HS TX path sample timing between digital and analog inside PHY 3'b000 represents the earliest phase 3'b111 represents the latest phase The delay associated with each step is 256ps</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG08</name>
          <description>Register description here</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>digital squelch filter select, this bit is used to filter the glitch on the HS RX squelch signal. 1: 1 clock cycle filter 0: 2 clock cycle fitter</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF64</name>
              <description>HS eye height tuning 3'b000:400mV(default) 3'b001:475mV 3'b010:350mV 3'b011:500mV 3'b100:412.5mV 3'b101:425mV 3'b110:437.5mV 3'b111:450mV</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF30</name>
              <description>2'b00 represents the minimum bias current 2'b11 represents the maximum bias current Rx squelch trigger point configures. Allows tuning of the squelch trigger point in order to compensate for package and board level parasitic. 4'b0000:112.5mV 4'b0001:150mV 4'b0010:87.5mV 4'b0011:162.5mV 4'b0100:100mV 4'b0101:137.5mV 4'b0110:75mV 4'b0111:150mV 4'b1000:125mV 4'b1001:162.5mV 4'b1010:100mV 4'b1011:175mV 4'b1100:150mV(default) 4'b1101:187.5mV 4'b1110:125mV 4'b1111:200mV</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG0C</name>
          <description>Register description here</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF62</name>
              <description>45ohm HS ODT value tuning and FS/LS driver strength tuning 5'b11111: smallest HS ODT value and largest FS/LS driver strength and fastest FS/LS slew rate 5'b10000: biggest HS ODT value and smallest FS/LS driver strength and slowest FS/LS slew rate</description>
              <bitRange>[6:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF10</name>
              <description>BG output voltage reference adjust, normally these bits are recommended to be kept as the default values. 00: standard center level  around 1.25v output, recommended 01: relative higher output  1x: relative higher output</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG10</name>
          <description>Register description here</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF74</name>
              <description>HOST disconnect detection trigger point. Only valid in host mode. Allows compensation for package and board level parasitics which tend to drop in the input voltage. 4'b0000:625mV 4'b0001:675mV 4'b0010:612.5mV 4'b0011:575mV 4'b0100:550mV 4'b0101:600mV (default) 4'b0110:537.5mV 4'b0111:500mV 4'b1000:600mV 4'b1001:650mV 4'b1010:587.5mV 4'b1011:550mV 4'b1100:575mV 4'b1101:625mV 4'b1110:562.5mV 4'b1111:525mV</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF33</name>
              <description>Single ended disconnect detection enable, active high. 1: enable  Single ended disconnect detection  0: disenable  Single ended disconnect detection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF22</name>
              <description>Half bit pre-emphasis enable. Active high 1: half bit pre-emphasize mode, recommended  0: full bit pre-emphasize mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>Turn off LS/FS differential receiver  in suspend mode, active low 1: keep  the LS/FS differential receiver  , pin fss_rxrcv will toggling according to the DP/DM state 0: turn off  the LS/FS differential receiver, pin fss_rxrcv will not toggling according to the DP/DM state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

