AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>BF66</name>
              <description>Hs chirp mode amplitude increasing register, active high.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF55</name>
              <description>No leakage current on DP/DM pin when VCCA3P3 power down, active low. Keeping the default value was greatly appreciated</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF40</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG80</name>
          <description>Register description here</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF73</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF22</name>
              <description>utmi clock always on 1'b1: utmi clock always on 1'b0: utmi clock relative to suspendm</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>Digital clock enable bypass value 1'b1: digital clock enable 1'b0: digital clock disable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>Digital clock enable bypass 1'b1: digital clock bypass enable  1'b0: digital clock bypass disable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG84</name>
          <description>Register description here</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>USB</name>
      <version>1.0</version>
      <description>USB device register descriptions.</description>
      <!-- <groupName>GROUP_USB</groupName> -->
      <baseAddress>0x400B0000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0000202C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USB0</name>
        <description>USB0_IRQ</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG0</name>
          <description>Function address, power management, interrupt status register for EP0 and IN Endpoints 1 to 5</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FFFFF</resetMask>

          <fields>
            <field>
              <name>EP5InIntStat</name>
              <description>IN Endpoint 5 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP4InIntStat</name>
              <description>IN Endpoint 4 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP3InIntStat</name>
              <description>IN Endpoint 3 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP2InIntStat</name>
              <description>IN Endpoint 2 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP1InIntStat</name>
              <description>IN Endpoint 1 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EP0InIntStat</name>
              <description>IN Endpoint 0 interrupt status. All interrupts are cleared when the register is read.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>Interrupt inactive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Interrupt active.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOUpdate</name>
              <description>Isochronous Transfer Update. When set by the CPU, the USB Controller will wait for an SOF token from the time InPktRdy is set before sending the packet. If an IN token is received before an SOF token, then a zero length data packet will be sent. Note: This bit only affects endpoints performing Isochronous transfers. The ISOUpdate bit affects all IN Isochronous endpoints in the USB Controller. It is normally used as a method of ensuring 'clean' start-up of an IN Isochronous pipe.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DONT_WAIT</name>
                  <description>Clear for USB Controller not to wait for SOF token before sending packet.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAIT</name>
                  <description>Set to have USB Controller wait for SOF token before sending packet.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMSPECIFIC</name>
              <description>Software-enabled Connection (SoftConn). When set to 1, the PHY is placed in its normal mode and the D+/D- lines of the USB bus are enabled. When bit is cleared, the PHY is put into non-driving mode and D+ and D- are tri-stated.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_CONNECTED</name>
                  <description>Clear to disable/disconnect USB lines.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONNECTED</name>
                  <description>Set to enable USB lines.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSEnab</name>
              <description>High-speed Enable. When set by the CPU, the USB Controller will negotiate for high-speed mode when the device is reset by the hub. If not set, the device will only operate in Full-speed mode. The HSEnab bit can be used to disable high-speed operation. Normally the USB Controller will automatically negotiate for high speed operation, when it is reset, by sending a 'chirp' to the hub. However if this bit is cleared then the USB Controller will not send any 'chirps' to the hub so the function will remain in Full-speed mode, even when connected to a high-speed-capable USB.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS_HS</name>
                  <description>Clear to disable High-speed mode (Full-speed mode only).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_HS</name>
                  <description>Set to enable High-speed mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSMode</name>
              <description>This read-only bit is set when the USB Controller has successfully negotiated for High-speed mode. The HSMode bit can be used to determine whether the USB Controller is in High-speed mode or Full-speed mode. It will go high when the function has successfully negotiated for high-speed operation during a USB reset.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FS_MODE</name>
                  <description>Indicates USB Controller is in Full-speed mode only.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HS_MODE</name>
                  <description>Indicates USB Controller is in High-speed mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reset</name>
              <description>Reset Status. Cleared when either HS negotiation has completed successfully or after 2.1 ms of reset signaling if HS negotiation fails. The Reset bit can be used to determine when reset signaling is present on the USB. Set when Reset signaling is detected and remains high until the bus reverts to an idle state.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEG_RESET_COMPLETE</name>
                  <description>Indicates that HS negotiation has completed successfully, or 2.1 ms of reset signaling has elapsed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESETTING</name>
                  <description>Indicates that Reset signaling is detected and remains high until the bus reverts to an idle state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Resume</name>
              <description>Resume. Set should clear this bit after 10 ms (a maximum of 15 ms) to end Resume signaling. The Resume bit is used to force the USB Controller to generate Resume signaling on the USB to perform remote wake-up from Suspend mode. Once set high, it should be left high for approximately 10 ms (at least 1 ms and no more than 15 ms), then cleared.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>END_RESUME</name>
                  <description>Cleared automatically 10-15 ms after being manually set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Set to force USB Controller to generate Resume signal on the USB to cause remote wake-up from Suspend mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Suspen</name>
              <description>Suspend Status. This read-only bit is set when Suspend mode is entered. It is cleared when the CPU reads the interrupt register, or sets the Resume bit of this register. The Suspen bit is set by the USB Controller when Suspend mode is entered. It will be cleared when the CFG2_Suspend field is read (as a result of receiving a Suspend interrupt). It will also be cleared if Suspend mode is left by setting the Resume bit to initiate a remote wake-up.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESUMED</name>
                  <description>Indicates that Suspend Mode exited.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPENDED</name>
                  <description>Indicates that Suspend Mode entered.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Enabl</name>
              <description>Set by the CPU to enable the SUSPENDM signal. The Enabl bit is set to enable the SUSPENDM signal to put the UTM (and any other hardware which uses the SUSPENDM signal) into Suspend mode. If this bit is not set, Suspend mode will be detected as normal but the SUSPENDM signal will remain high so that the UTM does not go into its low-power mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE_SUSPENDM</name>
                  <description>Clear to disable SUSPENDM signal - UTM does not go into its low-power mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_SUSPENDM</name>
                  <description>Set to enable the SUSPENDM signal to put the UTM (and any other HW which uses the SUSPENDM signal) into Suspend mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Update</name>
              <description>Function Address Update. Set when FuncAddr is written. Cleared when the new address takes effect (at the end of the current transfer).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NEW_ADDR_SET</name>
                  <description>Indicates that the new address has taken effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEW_ADDR_WRITTEN</name>
                  <description>Indicates that a new function address has been written to the FuncAddr field.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FuncAddr</name>
              <description>The function address. This field should be written with the address value contained in the SET_ADDRESS standard device request, when it is received on Endpoint 0. The new address will not take effect immediately as the host will still be using the old address for the Status stage of the device request. The USB Controller will continue to use the old address for decoding packets until the device request has completed. The status of the device request can be determined by reading the Update bit. When a new address is written to this field, the Update bit will be automatically set. It will remain high until the device request has completed and will be cleared when the new address takes effect Note: While the firmware may write the new address to the FuncAddr field immediately when it is received, it is recommended to leave this operation to the Status phase of the operation in case the host aborts the command.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

