AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
          <fields>
            <field>
              <name>ForceFS</name>
              <description>Force Full-speed Mode. The CPU sets this bit to force the USB Controller into Full-speed mode when it receives a USB reset.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FS_NOT_FORCED</name>
                  <description>Do not force FS mode upon USB reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FS_FORCED</name>
                  <description>Force FS mode upon USB reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ForceHS</name>
              <description>Force High-speed Mode. The CPU sets this bit to force the USB Controller into High-speed mode when it receives a USB reset.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HS_NOT_FORCED</name>
                  <description>Do not force HS mode upon USB reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HS_FORCED</name>
                  <description>Force HS mode upon USB reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TestPacket</name>
              <description>Test Packet Test Mode. The CPU sets this bit to enter the Test_Packet test mode. In this mode, the USB Controller - in high-speed mode - repetitively transmits on the bus a 53-byte test packet. Note: The 53-byte test packet must be loaded into the Endpoint 0 FIFO before the test mode is entered.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_TPTM</name>
                  <description>Terminates Test Packet Test Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TPTM</name>
                  <description>Initiates Test Packet Test Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TestK</name>
              <description>Test_K Test Mode. The CPU sets this bit to enter the Test_K test mode. In this mode, the USB Controller - in high-speed mode - transmits a continuous K on the bus.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_TESTK</name>
                  <description>Terminates Test_K Test Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TESTK</name>
                  <description>Initiates Test_K Test Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TestJ</name>
              <description>Test_J Test Mode. The CPU sets this bit to enter the Test_J test mode. In this mode, the USB Controller - in high-speed mode - transmits a continuous J on the bus.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_TESTJ</name>
                  <description>Terminates Test_J Test Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TESTJ</name>
                  <description>Initiates Test_J Test Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TestSE0NAK</name>
              <description>Test_SE0_NAK Test Mode. The CPU sets this bit to enter the Test_SE0_NAK test mode. In this mode, the USB Controller remains in high-speed mode and responds to any valid IN token with a NAK.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP_TESTSE0NAK</name>
                  <description>Terminates Test_SE0_NAK Test Mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TESTSE0NAK</name>
                  <description>Initiates Test_SE0_NAK Test Mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Index selected endpoint.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENDPOINT0</name>
                  <description>Endpoint 0 selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPOINT1</name>
                  <description>Endpoint 1 selected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPOINT2</name>
                  <description>Endpoint 2 selected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPOINT3</name>
                  <description>Endpoint 3 selected.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPOINT4</name>
                  <description>Endpoint 4 selected.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENDPOINT5</name>
                  <description>Endpoint 5 selected.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRMNUM</name>
              <description>Frame Number. Read-only field containing the last received frame number in bits 10:0, 15:11 read 0.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

