AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DPktBufDis</name>
              <description>Double Packet Buffer Disable. This bit is used to control the use of Double Packet Buffering. It is ignored when Dynamic FIFO sizing is enabled. Clearing this bit does NOT necessarily enable Double Packet Buffering but rather allows Double Packet Buffering to be determined by the Endpoint's IDX2_OUTFIFOSZ setting and MAXPAYLOAD size relationship. Default is enabled.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_DPB</name>
                  <description>Clear to allow Double Packet Buffering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_DPB</name>
                  <description>Set to disable Double Packet Buffering regardless of the End Point FIFO size and MAXPAYLOAD size relationship.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IncompRx</name>
              <description>Incomplete Receive. This bit is set in a high-bandwidth Isochronous transfer if the packet in the OUT FIFO is incomplete because parts of the data were not received. It is cleared when OutPktRdy is cleared. Note: In anything other than a high-bandwidth Isochronous transfer, this bit will always return 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ClrDataTog</name>
              <description>Clear Data Toggle. Set this bit to reset the endpoint data toggle to 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SentStall</name>
              <description>Sent Stall. This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SendStall</name>
              <description>Send Stall. Issues a STALL handshake to a DATA packet.If IDX1_ISO = 0x1, this bit has no effect when the endpoint is being used for Isochronous transfers.If IDX1_ISO = 0x0, this field enables Stall Handshakes for Bulk/Interrupt transactions. Set this bit to issue a STALL handshake to a DATA packet. Clear this bit to terminate the stall condition.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FlushFIFO</name>
              <description>Flush FIFO. Set this bit to flush the next packet to be read from the endpoint OUT FIFO. The FIFO pointer is reset and the OutPktRdy bit is cleared. FlushFIFO should only be used when OutPktRdy is set. At other times, it may cause data to be corrupted. If the FIFO is double-buffered, FlushFIFO may need to be set twice to completely clear the FIFO.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DataError</name>
              <description>Data Error. Indicates a CRC error.If IDX1_ISO = 0x1 (ISO mode), this bit is set at the same time that OutPktRdy is set if the data packet has a CRC error. It is cleared when OutPktRdy is cleared.If IDX1_ISO = 0x0 (Bulk mode), this field always returns zero. This field is only valid when the endpoint is operating in ISO mode.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OverRun</name>
              <description>Overrun Condition. Indicates an overrun.If IDX1_ISO = 0x1 (ISO mode), this bit is set if an OUT packet arrives while FIFOFull is set, i.e., the OUT packet cannot be loaded into the OUT FIFO. The CPU should clear this bit.If IDX1_ISO = 0x0 (Bulk mode), this field always returns zero. This field is only valid when the endpoint is operating in ISO mode.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOFull</name>
              <description>FIFO Full. When set, this bit indicates that no more packets can be loaded into the OUT FIFO.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OutPktRdy</name>
              <description>OUT Packet Ready. This bit is set when a data packet has been received. Clear this bit when the packet has been unloaded from the OUT FIFO. An interrupt is generated (if enabled) when the bit is set.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKTSPLITOPTION</name>
              <description>Packet Split Option. When IDX1_ISO = 1, this bit serves as the MAXPAYLOAD multiplier for Isochronous OUT transfers. When IDX1_ISO = 0, this bit serves as the MAXPAYLOAD multiplier for Bulk IN transfers.If IDX1_ISO = 0x1, this field sets the multiplier for Isochronous transfers. For Isochronous endpoints operating in High-Speed mode and with the High-bandwidth option enabled, PKTSPLITOPTION may be either 2 or 3 (corresponding to this field's bit 0 set or bit 1 set, respectively, and bits[4:2] are ignored) and it specifies the maximum number of such transactions that can take place in a single microframe. If either bit 0 or bit 1 is non-zero, the USB Controller will automatically combine the separate USB packets received in any microframe into a single packet within the OUT FIFO. The maximum payload for each transaction is 1024 bytes, so this allows up to 3072 bytes to be received in each microframe. (For Isochronous transfers in full-speed mode or if high-bandwidth is not enabled, bits 0 and 1 are ignored.)If IDX1_ISO = 0x0, this field sets the multiplier for Bulk transfers. The field setting can be up to 31, and the multiplier, m, is (field setting + 1).  The multiplier defines the number of USB packets of the specified payload which are to be combined into a single data packet within the FIFO.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>

