AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>MAXPAYLOAD</name>
              <description>Maximum Payload transmitted in a single transaction. The value set can be up to 1024 bytes but is subject to the constraints placed by the USB Specification on packet sizes for Bulk, Interrupt and Isochronous transfers in Fullspeed and High-speed operations. The total amount of data represented by MAXPAYLOAD x (PKTSPLITOPTION + 1) must not exceed the FIFO size for the OUT endpoint, and should not exceed half the FIFO size if double-buffering is required. Note: The value written here (multiplied by m in the case of high-bandwidth Isochronous transfers) must match the value given in the wMaxPacketSize field of the Standard Endpoint Descriptor for the associated endpoint (see USB Specification Revision 2.0, Chapter 9). A mismatch could cause nexpected results.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IDX2</name>
          <description>Contains the outcount value for number of received bytes in the packet in the OUT FIFO, and the configurable IN and OUT Endpoint FIFO size.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F1F1FFF</resetMask>

          <fields>
            <field>
              <name>OUTFIFOSZ</name>
              <description>OUT FIFO Size. Sets the size of the selected OUT endpoint FIFO. Bit 4 of this field defines whether double-packet buffering is supported. When set, double-packet buffering is supported. When cleared, only single-packet buffering is supported. Bits [3:0] of this field determine maximum packet size, where 2^^(b3:b0 + 3) is the maximum packet size to be allowed (before any splitting within the FIFO of Bulk/High-Bandwidth packets prior to transmission).</description>
              <bitRange>[28:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INFIFOSZ</name>
              <description>IN FIFO Size. Sets the size of the selected IN endpoint FIFO. Bit 4 of this field defines whether double-packet buffering supported. When set, double-packet buffering is supported. When cleared, only single-packet buffering is supported. Bits [3:0] of this field determine maximum packet size, where 2^^(b3:b0 + 3) is the maximum packet size to be allowed (before any splitting within the FIFO of Bulk/High-Bandwidth packets prior to transmission).</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ENDPTOUTCOUNT</name>
              <description>Endpoint OUT Count. When CFG3_ENDPOINT = 1 to 5, this read-only field holds the number of received data bytes in the packet in the Endpoint's OUT FIFO. When CFG3_ENDPOINT = 0, this read-only field holds 7-bit data for number of received data bytes in Endpoint 0 FIFO (OUT count). In either case, the value returned changes as the contents of the FIFO change and is only valid while OutPktRdy is set. (IMPORTANT: The address for the OUTCOUNT register is actually the same as COUNT0. However to avoid CMSIS conflicts, the address here includes an additional offset of 0x1000. Access to this register must take this into account.)If CFG3_ENDPOINT = 0x1-0x5, this read-only field holds the number of received data bytes in the packet in the OUT FIFO. If the packet was transmitted as multiple bulk packets, the number given will be for the combined packet.If CFG3_ENDPOINT = 0x0, this read-only field holds 7-bit data for number of received data bytes in Endpoint 0 FIFO (OUT count).</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOADD</name>
          <description>Sets the start address of the selected IN and OUT endpoint FIFOs.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFF1FFF</resetMask>

          <fields>
            <field>
              <name>OUTFIFOADD</name>
              <description>Sets the start address of the selected OUT endpoint FIFO.</description>
              <bitRange>[28:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INFIFOADD</name>
              <description>Sets the start address of the selected IN endpoint FIFO.</description>
              <bitRange>[12:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO0</name>
          <description>Endpoint 0 FIFO register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO1</name>
          <description>Endpoint 1 FIFO register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

