AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO2</name>
          <description>Endpoint 2 FIFO register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 2.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO3</name>
          <description>Endpoint 3 FIFO register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 3.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO4</name>
          <description>Endpoint 4 FIFO register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 4.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFO5</name>
          <description>Endpoint 5 FIFO register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FIFO</name>
              <description>Writing to this register loads data into the IN FIFO and reading from this register unloads data from the OUT FIFO for endpoint 5.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HWVERS</name>
          <description>Read-only register that returns version number (xx.yyy) of the core hardware.</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>RC</name>
              <description>Unused</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>xx</name>
              <description>Major Version Number (Range 0 - 31).</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>yyy</name>
              <description>Minor Version Number (Range 0 - 999).</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INFO</name>
          <description>Contains read-only info of the number of IN and OUT endpoints included in the design, width of the RAM, the ability to reset the USB Controller via software, a soft reset bit for the CLK clock domain and a soft reset bit for the XCLK clock domain.</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030FFF</resetMask>

          <fields>
            <field>
              <name>RSTXS</name>
              <description>Soft reset for the XCLK domain. will cause the output signal NRSTXO to be asserted low. This bit is self-clearing. For reset to actually occur, the output NRSTXO must be connected to the input NRSTX.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSTS</name>
              <description>Soft reset for the CLK domain. cause the output signal NRSTO to be asserted low. This bit is self-clearing. For reset to actually occur, the output NRSTO must be connected to the input NRST.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RamBits</name>
              <description>Provides the width of the RAM address bus.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OutEndPoints</name>
              <description>Provides the number of implemented OUT Endpoints.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>InEndPoints</name>
              <description>Provides the number of implemented IN Endpoints.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

