AmbiqAI/heartkit-vitals-demo/pack/svd/apollo4p.svd
            </field>
            <field>
              <name>DSP0INTVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog interrupt.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0RESVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog reset for the DSP logic. This will cause a software reset to the DSP core if the RESEN bit is set and optionally interrupt the CPU.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0PMRESEN</name>
              <description>This bitfield enables the DSP0 Power Controller (PM) reset. This needs to be set together with the DSP0WDTEN bit to allow the reset to trigger.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0RESEN</name>
              <description>This bitfield enables the DSP0 reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0INTEN</name>
              <description>This bitfield enables the DSP0 WDT interrupt. Note : This bit must be set before the interrupt status bit will reflect a watchdog timer expiration. The IER interrupt register must also be enabled for a WDT interrupt to be sent to the NVIC.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0WDTEN</name>
              <description>This bitfield enables the WDT. Setting the lock implicitly sets the WTDEN bit as well.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0RSTRT</name>
          <description>This register will restart the watchdog timer. Writing a special key value into this register will result in the watch dog timer being reset, so that the count will start again. It is expected that the software will periodically write to this register to indicate that the system is functional. The watch dog timer can continue running when the system is in deep sleep, and the interrupt will trigger the wake. After the wake, the core can reset the watch dog timer.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP0RSTART</name>
              <description>Writing 0x69 to DSP0RSTRT restarts the watchdog timer. This is a write only register. Reading this register will return 0.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>This is the key value to write to WDTRSTRT to restart the WDT. This is a write only register.</description>
                  <value>105</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Reset value</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0TLOCK</name>
          <description>This register locks the watch dog timer. Once it is locked, the configuration register (DSP0CFG) for watch dog timer cannot be written to and the timer is automatically enabled (WDTEN is set).</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP0LOCK</name>
              <description>Writing 0xa7 locks the watchdog timer. Once locked, the WDTCFG reg cannot be written and WDTEN is set.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>This is the key value to write to WDTLOCK to lock the WDT.</description>
                  <value>167</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Reset Value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0COUNT</name>
          <description>This register holds the current count for the watch dog timer. This is a read only register. SW cannot set the value in the counter, but can reset it.</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP0COUNT</name>
              <description>Read-Only current value of the WDT counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1CFG</name>
          <description>This is the configuration register for the DSP1 watch dog timer. It controls the enable, interrupt set, clocks for the timer, the compare values for the counters to trigger a reset or interrupt. This register can only be written to if the associated DSP1TLOCK is not set.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFF00</resetValue>
          <resetMask>0xFFFFFF0F</resetMask>

          <fields>
            <field>
              <name>DSP1PMRESVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog reset. This will cause a software reset to the DSP Power Management logic if the PMRESEN bit is set and optionally interrupt the CPU.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

